ch3/ch3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-08-28 Fri 08:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Structure and Interpretation of Computer Programs (SICP)</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Robert Irelan" />
</head>
<body>
<div id="content">
<h1 class="title">Structure and Interpretation of Computer Programs (SICP)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline109"><span class="todo nilTODO">TODO</span> Chapter 3: Modularity, Objects, and State</a>
<ul>
<li><a href="#orgheadline12"><span class="done nilDONE">DONE</span> 3.1: Assignment and Local State</a>
<ul>
<li><a href="#orgheadline5"><span class="done nilDONE">DONE</span> 3.1.1: Local State Variables</a>
<ul>
<li><a href="#orgheadline1"><span class="done nilDONE">DONE</span> Exercise 3.1.</a></li>
<li><a href="#orgheadline2"><span class="done nilDONE">DONE</span> Exercise 3.2.</a></li>
<li><a href="#orgheadline3"><span class="done nilDONE">DONE</span> Exercise 3.3.</a></li>
<li><a href="#orgheadline4"><span class="done nilDONE">DONE</span> Exercise 3.4.</a></li>
</ul>
</li>
<li><a href="#orgheadline8"><span class="done nilDONE">DONE</span> 3.1.2: The Benefits of Introducing Assignment</a>
<ul>
<li><a href="#orgheadline6"><span class="done nilDONE">DONE</span> Exercise 3.5.</a></li>
<li><a href="#orgheadline7"><span class="done nilDONE">DONE</span> Exercise 3.6.</a></li>
</ul>
</li>
<li><a href="#orgheadline11"><span class="done nilDONE">DONE</span> 3.1.3: The Costs of Introducing Assignment</a>
<ul>
<li><a href="#orgheadline9"><span class="done nilDONE">DONE</span> Exercise 3.7.</a></li>
<li><a href="#orgheadline10"><span class="done nilDONE">DONE</span> Exercise 3.8.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline20"><span class="done nilDONE">DONE</span> 3.2: The Environment Model of Evaluation</a>
<ul>
<li><a href="#orgheadline13"><span class="done nilDONE">DONE</span> 3.2.1: The Rules for Evaluation</a></li>
<li><a href="#orgheadline15"><span class="done nilDONE">DONE</span> 3.2.2: Applying Simple Procedures</a>
<ul>
<li><a href="#orgheadline14"><span class="done nilDONE">DONE</span> Exercise 3.9.</a></li>
</ul>
</li>
<li><a href="#orgheadline17"><span class="done nilDONE">DONE</span> 3.2.3: Frames as the Repository of Local State</a>
<ul>
<li><a href="#orgheadline16"><span class="done nilDONE">DONE</span> Exercise 3.10.</a></li>
</ul>
</li>
<li><a href="#orgheadline19"><span class="done nilDONE">DONE</span> 3.2.4: Internal Definitions</a>
<ul>
<li><a href="#orgheadline18"><span class="done nilDONE">DONE</span> Exercise 3.11.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline52"><span class="done nilDONE">DONE</span> 3.3: Modeling with Mutable Data</a>
<ul>
<li><a href="#orgheadline30"><span class="done nilDONE">DONE</span> 3.3.1: Mutable List Structure</a>
<ul>
<li><a href="#orgheadline21"><span class="done nilDONE">DONE</span> Exercise 3.12.</a></li>
<li><a href="#orgheadline22"><span class="done nilDONE">DONE</span> Exercise 3.13.</a></li>
<li><a href="#orgheadline23"><span class="done nilDONE">DONE</span> Exercise 3.14.</a></li>
<li><a href="#orgheadline24"><span class="done nilDONE">DONE</span> Exercise 3.15.</a></li>
<li><a href="#orgheadline25"><span class="done nilDONE">DONE</span> Exercise 3.16.</a></li>
<li><a href="#orgheadline26"><span class="done nilDONE">DONE</span> Exercise 3.17.</a></li>
<li><a href="#orgheadline27"><span class="done nilDONE">DONE</span> Exercise 3.18.</a></li>
<li><a href="#orgheadline28"><span class="done nilDONE">DONE</span> Exercise 3.19.</a></li>
<li><a href="#orgheadline29"><span class="done nilDONE">DONE</span> Exercise 3.20.</a></li>
</ul>
</li>
<li><a href="#orgheadline31"><span class="done nilDONE">DONE</span> 3.3.2: Representing Queues</a>
<ul>
<li><a href="#orgheadline32"><span class="done nilDONE">DONE</span> Exercise 3.21.</a></li>
<li><a href="#orgheadline33"><span class="done nilDONE">DONE</span> Exercise 3.22.</a></li>
<li><a href="#orgheadline34"><span class="done nilDONE">DONE</span> Exercise 3.23.</a></li>
</ul>
</li>
<li><a href="#orgheadline39"><span class="done nilDONE">DONE</span> 3.3.3: Representing Tables</a>
<ul>
<li><a href="#orgheadline35"><span class="done nilDONE">DONE</span> Exercise 3.24.</a></li>
<li><a href="#orgheadline36"><span class="done nilDONE">DONE</span> Exercise 3.25.</a></li>
<li><a href="#orgheadline37"><span class="done nilDONE">DONE</span> Exercise 3.26.</a></li>
<li><a href="#orgheadline38"><span class="todo nilHOLD">HOLD</span> Exercise 3.27.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="HOLD">HOLD</span></span></a></li>
</ul>
</li>
<li><a href="#orgheadline40"><span class="done nilDONE">DONE</span> 3.3.4: A Simulator for Digital Circuits</a>
<ul>
<li><a href="#orgheadline41"><span class="done nilDONE">DONE</span> Exercise 3.28.</a></li>
<li><a href="#orgheadline42"><span class="done nilDONE">DONE</span> Exercise 3.29.</a></li>
<li><a href="#orgheadline43"><span class="done nilDONE">DONE</span> Exercise 3.30.</a></li>
<li><a href="#orgheadline44"><span class="done nilDONE">DONE</span> Exercise 3.31.</a></li>
<li><a href="#orgheadline45"><span class="done nilDONE">DONE</span> Exercise 3.32.</a></li>
</ul>
</li>
<li><a href="#orgheadline46"><span class="done nilDONE">DONE</span> 3.3.5: Propagation of Constraints</a>
<ul>
<li><a href="#orgheadline47"><span class="done nilDONE">DONE</span> Exercise 3.33.</a></li>
<li><a href="#orgheadline48"><span class="done nilDONE">DONE</span> Exercise 3.34.</a></li>
<li><a href="#orgheadline49"><span class="done nilDONE">DONE</span> Exercise 3.35.</a></li>
<li><a href="#orgheadline50"><span class="done nilDONE">DONE</span> Exercise 3.36.</a></li>
<li><a href="#orgheadline51"><span class="done nilDONE">DONE</span> Exercise 3.37.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline68"><span class="todo nilTODO">TODO</span> 3.4: Concurrency: Time Is of the Essence</a>
<ul>
<li><a href="#orgheadline53"><span class="done nilDONE">DONE</span> Read Section 3.4</a></li>
<li><a href="#orgheadline54"><span class="todo nilTODO">TODO</span> 3.4.1: The Nature of Time in Concurrent Systems</a>
<ul>
<li><a href="#orgheadline55"><span class="todo nilTODO">TODO</span> Exercise 3.38.</a></li>
</ul>
</li>
<li><a href="#orgheadline56"><span class="todo nilTODO">TODO</span> 3.4.2: Mechanisms for Controlling Concurrency</a>
<ul>
<li><a href="#orgheadline57"><span class="todo nilTODO">TODO</span> Exercise 3.39.</a></li>
<li><a href="#orgheadline58"><span class="todo nilTODO">TODO</span> Exercise 3.40.</a></li>
<li><a href="#orgheadline59"><span class="todo nilTODO">TODO</span> Exercise 3.41.</a></li>
<li><a href="#orgheadline60"><span class="todo nilTODO">TODO</span> Exercise 3.42.</a></li>
<li><a href="#orgheadline61"><span class="todo nilTODO">TODO</span> Exercise 3.43.</a></li>
<li><a href="#orgheadline62"><span class="todo nilTODO">TODO</span> Exercise 3.44.</a></li>
<li><a href="#orgheadline63"><span class="todo nilTODO">TODO</span> Exercise 3.45.</a></li>
<li><a href="#orgheadline64"><span class="todo nilTODO">TODO</span> Exercise 3.46.</a></li>
<li><a href="#orgheadline65"><span class="todo nilTODO">TODO</span> Exercise 3.47.</a></li>
<li><a href="#orgheadline66"><span class="todo nilTODO">TODO</span> Exercise 3.48.</a></li>
<li><a href="#orgheadline67"><span class="todo nilTODO">TODO</span> Exercise 3.49.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline69"><span class="todo nilTODO">TODO</span> 3.5: Streams</a>
<ul>
<li><a href="#orgheadline73"><span class="done nilDONE">DONE</span> 3.5.1: Streams Are Delayed Lists</a>
<ul>
<li><a href="#orgheadline70"><span class="done nilDONE">DONE</span> Exercise 3.50.</a></li>
<li><a href="#orgheadline71"><span class="done nilDONE">DONE</span> Exercise 3.51.</a></li>
<li><a href="#orgheadline72"><span class="done nilDONE">DONE</span> Exercise 3.52.</a></li>
</ul>
</li>
<li><a href="#orgheadline74"><span class="todo nilTODO">TODO</span> 3.5.2: Infinite Streams</a>
<ul>
<li><a href="#orgheadline75"><span class="done nilDONE">DONE</span> Exercise 3.53.</a></li>
<li><a href="#orgheadline76"><span class="todo nilTODO">TODO</span> Exercise 3.54.</a></li>
<li><a href="#orgheadline77"><span class="done nilDONE">DONE</span> Exercise 3.55.</a></li>
<li><a href="#orgheadline78"><span class="done nilDONE">DONE</span> Exercise 3.56.</a></li>
<li><a href="#orgheadline79"><span class="todo nilTODO">TODO</span> Exercise 3.57.</a></li>
<li><a href="#orgheadline80"><span class="todo nilTODO">TODO</span> Exercise 3.58.</a></li>
<li><a href="#orgheadline81"><span class="todo nilTODO">TODO</span> Exercise 3.59.</a></li>
<li><a href="#orgheadline82"><span class="todo nilTODO">TODO</span> Exercise 3.60.</a></li>
<li><a href="#orgheadline83"><span class="todo nilTODO">TODO</span> Exercise 3.61.</a></li>
<li><a href="#orgheadline84"><span class="todo nilTODO">TODO</span> Exercise 3.62.</a></li>
</ul>
</li>
<li><a href="#orgheadline85"><span class="todo nilTODO">TODO</span> 3.5.3: Exploiting the Stream Paradigm</a>
<ul>
<li><a href="#orgheadline86"><span class="done nilDONE">DONE</span> Exercise 3.63.</a></li>
<li><a href="#orgheadline87"><span class="done nilDONE">DONE</span> Exercise 3.64.</a></li>
<li><a href="#orgheadline88"><span class="done nilDONE">DONE</span> Exercise 3.65.</a></li>
<li><a href="#orgheadline89"><span class="done nilDONE">DONE</span> Exercise 3.66.</a></li>
<li><a href="#orgheadline90"><span class="done nilDONE">DONE</span> Exercise 3.67.</a></li>
<li><a href="#orgheadline91"><span class="todo nilTODO">TODO</span> Exercise 3.68.</a></li>
<li><a href="#orgheadline92"><span class="todo nilTODO">TODO</span> Exercise 3.69.</a></li>
<li><a href="#orgheadline93"><span class="todo nilTODO">TODO</span> Exercise 3.70.</a></li>
<li><a href="#orgheadline94"><span class="todo nilTODO">TODO</span> Exercise 3.71.</a></li>
<li><a href="#orgheadline95"><span class="todo nilTODO">TODO</span> Exercise 3.72.</a></li>
<li><a href="#orgheadline96"><span class="done nilDONE">DONE</span> Exercise 3.73.</a></li>
<li><a href="#orgheadline97"><span class="done nilDONE">DONE</span> Exercise 3.74.</a></li>
<li><a href="#orgheadline98"><span class="done nilDONE">DONE</span> Exercise 3.75.</a></li>
<li><a href="#orgheadline99"><span class="done nilDONE">DONE</span> Exercise 3.76.</a></li>
</ul>
</li>
<li><a href="#orgheadline100"><span class="done nilDONE">DONE</span> 3.5.4: Streams and Delayed Evaluation</a>
<ul>
<li><a href="#orgheadline101">Code</a></li>
<li><a href="#orgheadline102"><span class="done nilDONE">DONE</span> Exercise 3.77.</a></li>
<li><a href="#orgheadline103"><span class="done nilDONE">DONE</span> Exercise 3.78.</a></li>
<li><a href="#orgheadline104"><span class="done nilDONE">DONE</span> Exercise 3.79.</a></li>
<li><a href="#orgheadline105"><span class="done nilDONE">DONE</span> Exercise 3.80.</a></li>
</ul>
</li>
<li><a href="#orgheadline106"><span class="done nilDONE">DONE</span> 3.5.5: Modularity of Functional Programs and Modularity of Objects</a>
<ul>
<li><a href="#orgheadline107"><span class="done nilDONE">DONE</span> Exercise 3.81.</a></li>
<li><a href="#orgheadline108"><span class="done nilDONE">DONE</span> Exercise 3.82.</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline109" class="outline-2">
<h2 id="orgheadline109"><span class="todo TODO">TODO</span> Chapter 3: <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-19.html#%_chap_3">Modularity, Objects, and State</a></h2>
<div class="outline-text-2" id="text-orgheadline109">
</div><div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="done DONE">DONE</span> 3.1: <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-20.html#%_sec_3.1">Assignment and Local State</a></h3>
<div class="outline-text-3" id="text-orgheadline12">
</div><div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="done DONE">DONE</span> 3.1.1: <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-20.html#%_sec_3.1.1">Local State Variables</a></h4>
<div class="outline-text-4" id="text-orgheadline5">
</div><div id="outline-container-orgheadline1" class="outline-5">
<h5 id="orgheadline1"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-20.html#%_thm_3.1">Exercise 3.1.</a></h5>
<div class="outline-text-5" id="text-orgheadline1">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-accumulator</span> initial<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>increment<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">set!</span> initial <span style="color: #709870;">(</span>+ initial increment<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    initial<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-1"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">A</span> <span style="color: #7388d6;">(</span>make-accumulator 5<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 15
      <span style="color: #7388d6;">(</span>A 10<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 25
      <span style="color: #7388d6;">(</span>A 10<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
