ch3/ch3.html

<div id="outline-container-orgheadline2" class="outline-5">
<h5 id="orgheadline2"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-20.html#%_thm_3.2">Exercise 3.2.</a></h5>
<div class="outline-text-5" id="text-orgheadline2">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-monitored</span> f<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">counter</span> 0<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>x<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>equal? x 'how-many-calls?<span style="color: #907373;">)</span>
           counter<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>equal? x 'reset-count<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span><span style="color: #a020f0;">set!</span> counter 0<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span>
           <span style="color: #907373;">(</span>f x<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span><span style="color: #a020f0;">set!</span> counter <span style="color: #6276ba;">(</span>+ counter 1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-2"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">s</span> <span style="color: #7388d6;">(</span>make-monitored sqrt<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 10
      <span style="color: #7388d6;">(</span>s 100<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 1
      <span style="color: #7388d6;">(</span>s 'how-many-calls?<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-5">
<h5 id="orgheadline3"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-20.html#%_thm_3.3">Exercise 3.3.</a></h5>
<div class="outline-text-5" id="text-orgheadline3">
<p>
Modify the <code>make-account</code> procedure so that it creates password-protected
accounts. That is, <code>make-account</code> should take a symbol as an additional
argument, as in
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-account</span> balance password<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">withdraw</span> amount<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>&gt;= balance amount<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">begin</span> <span style="color: #907373;">(</span><span style="color: #a020f0;">set!</span> balance <span style="color: #6276ba;">(</span>- balance amount<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
               balance<span style="color: #709870;">)</span>
        <span style="color: #8b2252;">"Insufficient funds"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">deposit</span> amount<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">set!</span> balance <span style="color: #709870;">(</span>+ balance amount<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    balance<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">dispatch</span> p m<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>equal? p password<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #907373;">(</span>x<span style="color: #907373;">)</span> <span style="color: #8b2252;">"Incorrect password"</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'withdraw<span style="color: #6276ba;">)</span> withdraw<span style="color: #907373;">)</span>
              <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'deposit<span style="color: #6276ba;">)</span> deposit<span style="color: #907373;">)</span>
              <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span>error <span style="color: #8b2252;">"Unknown request -- MAKE-ACCOUNT"</span>
                           m<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  dispatch<span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-3"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">acc</span> <span style="color: #7388d6;">(</span>make-account 100 'secret-password<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 60
      <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>acc 'secret-password 'withdraw<span style="color: #909183;">)</span> 40<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test <span style="color: #8b2252;">"Incorrect password"</span>
      <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>acc 'some-other-password 'deposit<span style="color: #909183;">)</span> 50<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
