ch3/ch3.html

<div id="outline-container-orgheadline4" class="outline-5">
<h5 id="orgheadline4"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-20.html#%_thm_3.4">Exercise 3.4.</a></h5>
<div class="outline-text-5" id="text-orgheadline4">
<p>
As the prompt states, there's little more work involved than to add
a <code>incorrect-password-attempts</code>, which we use to <code>call-the-cops</code> when too many
incorrect attempts in a row have been made. Ideally, a different response
would not be returned to the user when the cops have been called, but I've
decided to do so for ease of testing.
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-account</span> balance password<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">incorrect-password-attempts</span> 0<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">call-the-cops</span><span style="color: #909183;">)</span>
    <span style="color: #8b2252;">"Please wait -- calling the cops..."</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">withdraw</span> amount<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>&gt;= balance amount<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">begin</span> <span style="color: #907373;">(</span><span style="color: #a020f0;">set!</span> balance <span style="color: #6276ba;">(</span>- balance amount<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
               balance<span style="color: #709870;">)</span>
        <span style="color: #8b2252;">"Insufficient funds"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">deposit</span> amount<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">set!</span> balance <span style="color: #709870;">(</span>+ balance amount<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    balance<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">dispatch</span> p m<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>equal? p password<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #907373;">(</span>x<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">set!</span> incorrect-password-attempts
                <span style="color: #6276ba;">(</span>+ incorrect-password-attempts 1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">if</span> <span style="color: #6276ba;">(</span>&gt; incorrect-password-attempts 7<span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span>call-the-cops<span style="color: #6276ba;">)</span>
              <span style="color: #8b2252;">"Incorrect password"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">begin</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">set!</span> incorrect-password-attempts 0<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>eq? m 'withdraw<span style="color: #858580;">)</span> withdraw<span style="color: #6276ba;">)</span>
                <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>eq? m 'deposit<span style="color: #858580;">)</span> deposit<span style="color: #6276ba;">)</span>
                <span style="color: #6276ba;">(</span><span style="color: #a020f0;">else</span> <span style="color: #858580;">(</span>error <span style="color: #8b2252;">"Unknown request -- MAKE-ACCOUNT"</span>
                             m<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  dispatch<span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-4"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">acc</span> <span style="color: #7388d6;">(</span>make-account 100 'secret-password<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">for-each</span> <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>i<span style="color: #909183;">)</span>
            <span style="color: #909183;">(</span>test <span style="color: #8b2252;">"Incorrect password"</span>
                  <span style="color: #709870;">(</span><span style="color: #907373;">(</span>acc 'some-other-password 'withdraw<span style="color: #907373;">)</span> 100<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
          <span style="color: #7388d6;">(</span>iota 7<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test <span style="color: #8b2252;">"Please wait -- calling the cops..."</span>
      <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>acc 'some-other-password 'withdraw<span style="color: #909183;">)</span> 100<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="done DONE">DONE</span> 3.1.2: <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-20.html#%_sec_3.1.2">The Benefits of Introducing Assignment</a></h4>
