ch3/ch3.html
<div class="outline-text-4" id="text-orgheadline8">
</div><div id="outline-container-orgheadline6" class="outline-5">
<h5 id="orgheadline6"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-20.html#%_thm_3.5">Exercise 3.5.</a></h5>
<div class="outline-text-5" id="text-orgheadline6">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">estimate-integral</span> P x1 x2 y1 y2 ntrial<span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Number of trials for which the trial point was inside the region to be</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">integrated (i.e., where (= (P x y) #t)).</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">ninside</span> 0<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">random-x</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>random-in-range x1 x2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">random-y</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>random-in-range y1 y2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">try</span> x y<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>P x y<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">set!</span> ninside <span style="color: #907373;">(</span>+ ninside 1<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">for-each</span> <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>i<span style="color: #709870;">)</span>
              <span style="color: #709870;">(</span>try <span style="color: #907373;">(</span>random-x<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>random-y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
            <span style="color: #909183;">(</span>iota ntrial<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>* <span style="color: #909183;">(</span>- x2 x1<span style="color: #909183;">)</span>
     <span style="color: #909183;">(</span>- y2 y1<span style="color: #909183;">)</span>
     <span style="color: #909183;">(</span>/ ninside ntrial<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-5"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">p-circle</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>x y<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>&gt; <span style="color: #709870;">(</span>* 1.0 1.0<span style="color: #709870;">)</span>
       <span style="color: #709870;">(</span>+ <span style="color: #907373;">(</span>* x x<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>* y y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>current-test-epsilon 0.10<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">pi</span> <span style="color: #7388d6;">(</span>* 4 <span style="color: #909183;">(</span>atan 1 1<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">parameterize</span> <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>current-test-epsilon 0.10<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
              <span style="color: #7388d6;">(</span>test pi
                    <span style="color: #909183;">(</span>estimate-integral <span style="color: #709870;">(</span>p-circle<span style="color: #709870;">)</span> -2.0 2.0 -2.0 2.0 100000<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-5">
<h5 id="orgheadline7"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-20.html#%_thm_3.6">Exercise 3.6.</a></h5>
<div class="outline-text-5" id="text-orgheadline7">
<p>
This is a fairly simple modification of the <code>rand</code> command defined in the
book. The main change is to dispatch on a <code>command</code> argument to <code>rand</code>. Also,
since the <code>reset</code> argument sets the seed of the random number generator, I
don't define a <code>random-init</code> variable here. Thus, it is necessary to make at
least one call to <code>(rand 'reset)</code> before using <code>(rand 'generate)</code> to make sure
the seed is initialized.
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">rand</span> command<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span> nil<span style="color: #7388d6;">)</span>                        <span style="color: #b22222;">; </span><span style="color: #b22222;">Don't produce random numbers until initialized</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>equal? command 'generate<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span><span style="color: #a020f0;">set!</span> x <span style="color: #907373;">(</span>rand-update x<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         x<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>equal? command 'reset<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #907373;">(</span>x-init<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span><span style="color: #a020f0;">set!</span> x x-init<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span>
         <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"RAND -- bad command"</span><span style="color: #709870;">)</span>
         command<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="done DONE">DONE</span> 3.1.3: <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-20.html#%_sec_3.1.3">The Costs of Introducing Assignment</a></h4>
