ch3/ch3.html
<div class="outline-text-4" id="text-orgheadline11">
</div><div id="outline-container-orgheadline9" class="outline-5">
<h5 id="orgheadline9"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-20.html#%_thm_3.7">Exercise 3.7.</a></h5>
<div class="outline-text-5" id="text-orgheadline9">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-3"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-joint</span> account original-password new-password<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">dispatch</span> p m<span style="color: #909183;">)</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">The underlying account accepts only original-password, so accept</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">new-password by passing original-password. Otherwise, let the underlying</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">account deal with error handling for a wrong password.</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>equal? p new-password<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>account original-password m<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>account p m<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  dispatch<span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-7"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">acc</span> <span style="color: #7388d6;">(</span>make-account 140 'secret-password<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">joint-acc</span>
  <span style="color: #7388d6;">(</span>make-joint acc 'secret-password 'proxy-password<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Both `acc` and `joint-acc` accept the original password, and actions on</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">either affect the other since `joint-acc` delegates all messages to `acc`.</span>
<span style="color: #707183;">(</span>test 100
      <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>joint-acc 'secret-password 'withdraw<span style="color: #909183;">)</span> 40<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 60
      <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>joint-acc 'secret-password 'withdraw<span style="color: #909183;">)</span> 40<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Neither account works with an unknown password.</span>
<span style="color: #707183;">(</span>test <span style="color: #8b2252;">"Incorrect password"</span>
      <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>acc 'some-other-password 'deposit<span style="color: #909183;">)</span> 50<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test <span style="color: #8b2252;">"Incorrect password"</span>
      <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>joint-acc 'some-other-password 'deposit<span style="color: #909183;">)</span> 50<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Original account `acc` doesn't work with the proxy password, but the joint</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">account `joint-acc` does.</span>
<span style="color: #707183;">(</span>test <span style="color: #8b2252;">"Incorrect password"</span>
      <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>acc 'proxy-password 'withdraw<span style="color: #909183;">)</span> 20<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 40
      <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>joint-acc 'proxy-password 'withdraw<span style="color: #909183;">)</span> 20<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-5">
<h5 id="orgheadline10"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-20.html#%_thm_3.8">Exercise 3.8.</a></h5>
<div class="outline-text-5" id="text-orgheadline10">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">f</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>cache '<span style="color: #907373;">()</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>null? x<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span><span style="color: #a020f0;">set!</span> cache '<span style="color: #858580;">()</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> <span style="color: #b22222;">; </span><span style="color: #b22222;">Allow cache to be cleared.</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>not <span style="color: #858580;">(</span>null? cache<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> 0<span style="color: #907373;">)</span>      <span style="color: #b22222;">; </span><span style="color: #b22222;">Return 0 if cache isn't clear.</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span><span style="color: #a020f0;">set!</span> cache x<span style="color: #6276ba;">)</span>       <span style="color: #b22222;">; </span><span style="color: #b22222;">Set cache if it isn't clear already.</span>
                  x<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-8"</span><span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Simulate left-to-right evaluation by assigning to temporaries</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span> <span style="color: #7388d6;">(</span>f 0<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">y</span> <span style="color: #7388d6;">(</span>f 1<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 0
      <span style="color: #7388d6;">(</span>+ x y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Reset cache</span>
<span style="color: #707183;">(</span>f '<span style="color: #7388d6;">()</span><span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Right-to-left evaluation</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">y</span> <span style="color: #7388d6;">(</span>f 1<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span> <span style="color: #7388d6;">(</span>f 0<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 1
      <span style="color: #7388d6;">(</span>+ x y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="done DONE">DONE</span> 3.2: <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-21.html#%_sec_3.2">The Environment Model of Evaluation</a></h3>
<div class="outline-text-3" id="text-orgheadline20">
</div><div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="done DONE">DONE</span> 3.2.1: <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-21.html#%_sec_3.2.1">The Rules for Evaluation</a></h4>
<div class="outline-text-4" id="text-orgheadline13">
<p>
No exercises
</p>
</div>
</div>


<div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15"><span class="done DONE">DONE</span> 3.2.2: <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-21.html#%_sec_3.2.2">Applying Simple Procedures</a></h4>
