ch3/ch3.html
<div class="outline-text-4" id="text-orgheadline15">
</div><div id="outline-container-orgheadline14" class="outline-5">
<h5 id="orgheadline14"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-21.html#%_thm_3.9">Exercise 3.9.</a></h5>
<div class="outline-text-5" id="text-orgheadline14">
<p>
I don't want to draw, so I'll use Scheme S-expressions instead.
</p>

<p>
In general, each invocation of a procedure creates an environment containing a
reference to its enclosing environment and a list of references to its
parameters. The global environment is much the same except that has a nil
pointer for the enclosing environment since there is no enclosing
environment. In the below, I've represented each parameter as a list of the
symbol name and value, but the symbol name is only preserved here for ease of
following the examples &#x2013; it doesn't necessarily have to be kept in an actual
interpreter.
</p>

<p>
The recursive definition of <code>factorial</code>,
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">factorial</span> n<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>= n 1<span style="color: #909183;">)</span>
      1
      <span style="color: #909183;">(</span>* n <span style="color: #709870;">(</span>factorial <span style="color: #907373;">(</span>- n 1<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
spawns a separate environment for each call of <code>factorial</code>, each of which has a
reference to the global environment and the value of its one argument:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">global-env</span> `<span style="color: #7388d6;">(</span><span style="color: #909183;">()</span> <span style="color: #909183;">(</span>factorial ,factorial-proc<span style="color: #909183;">)</span>
                        <span style="color: #909183;">(</span>fact-iter ,fact-iter-proc<span style="color: #909183;">)</span>
                        ,@intrinsic-defs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">all-envs</span> `<span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>,global-env <span style="color: #709870;">(</span>n ,6<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">set!</span> ,all-envs `<span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>,global-env <span style="color: #709870;">(</span>n ,5<span style="color: #709870;">)</span><span style="color: #909183;">)</span> ,all-envs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">set!</span> ,all-envs `<span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>,global-env <span style="color: #709870;">(</span>n ,4<span style="color: #709870;">)</span><span style="color: #909183;">)</span> ,all-envs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">set!</span> ,all-envs `<span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>,global-env <span style="color: #709870;">(</span>n ,3<span style="color: #709870;">)</span><span style="color: #909183;">)</span> ,all-envs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">set!</span> ,all-envs `<span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>,global-env <span style="color: #709870;">(</span>n ,2<span style="color: #709870;">)</span><span style="color: #909183;">)</span> ,all-envs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">set!</span> ,all-envs `<span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>,global-env <span style="color: #709870;">(</span>n ,1<span style="color: #709870;">)</span><span style="color: #909183;">)</span> ,all-envs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">set!</span> all-envs <span style="color: #7388d6;">(</span>cdr all-envs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">set!</span> all-envs <span style="color: #7388d6;">(</span>cdr all-envs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">set!</span> all-envs <span style="color: #7388d6;">(</span>cdr all-envs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">set!</span> all-envs <span style="color: #7388d6;">(</span>cdr all-envs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">set!</span> all-envs <span style="color: #7388d6;">(</span>cdr all-envs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">set!</span> all-envs <span style="color: #7388d6;">(</span>cdr all-envs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>assert <span style="color: #7388d6;">(</span>null? all-envs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
In contrast, the iterative version,
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">factorial</span> n<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>fact-iter 1 1 n<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">fact-iter</span> product counter max-count<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>&gt; counter max-count<span style="color: #909183;">)</span>
      product
      <span style="color: #909183;">(</span>fact-iter <span style="color: #709870;">(</span>* counter product<span style="color: #709870;">)</span>
                 <span style="color: #709870;">(</span>+ counter 1<span style="color: #709870;">)</span>
                 max-count<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
because it is tail recursive, replaces the environment of the function from
which a tail recursive call is made with the environment for the target
function of the tail recursive call. Since all function calls in both
<code>factorial</code> and <code>fact-iter</code> are tail recursive, the list of environments
changes basically as described in the pseudocode below:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">global-env</span> `<span style="color: #7388d6;">(</span><span style="color: #909183;">()</span> <span style="color: #909183;">(</span>factorial ,factorial-proc<span style="color: #909183;">)</span>
                     <span style="color: #909183;">(</span>fact-iter ,fact-iter-proc<span style="color: #909183;">)</span>
                     ,@intrinsic-defs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">all-envs</span> `<span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>global-env <span style="color: #709870;">(</span>n ,6<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>set-car! all-envs `<span style="color: #7388d6;">(</span>global-env <span style="color: #909183;">(</span>product ,1<span style="color: #909183;">)</span>
                                <span style="color: #909183;">(</span>counter ,1<span style="color: #909183;">)</span>
                                <span style="color: #909183;">(</span>max-count ,6<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>set-car! all-envs `<span style="color: #7388d6;">(</span>global-env <span style="color: #909183;">(</span>product ,1<span style="color: #909183;">)</span>
                                <span style="color: #909183;">(</span>counter ,2<span style="color: #909183;">)</span>
                                <span style="color: #909183;">(</span>max-count ,6<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>set-car! all-envs `<span style="color: #7388d6;">(</span>global-env <span style="color: #909183;">(</span>product ,2<span style="color: #909183;">)</span>
                                <span style="color: #909183;">(</span>counter ,3<span style="color: #909183;">)</span>
                                <span style="color: #909183;">(</span>max-count ,6<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>set-car! all-envs `<span style="color: #7388d6;">(</span>global-env <span style="color: #909183;">(</span>product ,6<span style="color: #909183;">)</span>
                                <span style="color: #909183;">(</span>counter ,4<span style="color: #909183;">)</span>
                                <span style="color: #909183;">(</span>max-count ,6<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>set-car! all-envs `<span style="color: #7388d6;">(</span>global-env <span style="color: #909183;">(</span>product ,24<span style="color: #909183;">)</span>
                                <span style="color: #909183;">(</span>counter ,5<span style="color: #909183;">)</span>
                                <span style="color: #909183;">(</span>max-count ,6<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>set-car! all-envs `<span style="color: #7388d6;">(</span>global-env <span style="color: #909183;">(</span>product ,120<span style="color: #909183;">)</span>
                                <span style="color: #909183;">(</span>counter ,6<span style="color: #909183;">)</span>
                                <span style="color: #909183;">(</span>max-count ,6<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>set-car! all-envs `<span style="color: #7388d6;">(</span>global-env <span style="color: #909183;">(</span>product ,720<span style="color: #909183;">)</span>
                                <span style="color: #909183;">(</span>counter ,7<span style="color: #909183;">)</span>
                                <span style="color: #909183;">(</span>max-count ,6<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">set!</span> all-envs <span style="color: #7388d6;">(</span>cdr all-envs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>assert <span style="color: #7388d6;">(</span>null? all-envs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Notice above that we've really simulated a stack, with <code>set-car!</code> performing a
mutation-in-place of the top entry of the stack.
</p>
</div>
</div>
</div>
