ch3/ch3.html

<div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17"><span class="done DONE">DONE</span> 3.2.3: <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-21.html#%_sec_3.2.3">Frames as the Repository of Local State</a></h4>
<div class="outline-text-4" id="text-orgheadline17">
</div><div id="outline-container-orgheadline16" class="outline-5">
<h5 id="orgheadline16"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-21.html#%_thm_3.10">Exercise 3.10.</a></h5>
<div class="outline-text-5" id="text-orgheadline16">
<p>
The procedure to be analyzed,
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-withdraw</span> initial-amount<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>balance initial-amount<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>amount<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> <span style="color: #907373;">(</span>&gt;= balance amount<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">begin</span> <span style="color: #6276ba;">(</span><span style="color: #a020f0;">set!</span> balance <span style="color: #858580;">(</span>- balance amount<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                 balance<span style="color: #907373;">)</span>
          <span style="color: #8b2252;">"Insufficient funds"</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
expands to the following when <code>let</code> is expanded to its underlying syntax:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-withdraw</span> initial-amount<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>balance<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #907373;">(</span>amount<span style="color: #907373;">)</span>
       <span style="color: #907373;">(</span><span style="color: #a020f0;">if</span> <span style="color: #6276ba;">(</span>&gt;= balance amount<span style="color: #6276ba;">)</span>
           <span style="color: #6276ba;">(</span><span style="color: #a020f0;">begin</span> <span style="color: #858580;">(</span><span style="color: #a020f0;">set!</span> balance <span style="color: #80a880;">(</span>- balance amount<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                  balance<span style="color: #6276ba;">)</span>
           <span style="color: #8b2252;">"Insufficient funds"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   initial-amount<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Without TCE, the function returned by <code>make-withdraw</code> (i.e.,
<code>(lambda (amount) )</code>), has a pointer the environment of
<code>(lambda (balance) )</code>, which has a pointer to the global environment. However,
the call to <code>(lambda (balance) )</code> is in tail position, so it replaces the
environment formed by the call of <code>make-withdraw</code>. When the returned
<code>(lambda (amount) )</code> is called, it therefore has a pointer to the environment
of <code>(lambda (balance) )</code>, which points to the global environment.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-4">
<h4 id="orgheadline19"><span class="done DONE">DONE</span> 3.2.4: <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-21.html#%_sec_3.2.4">Internal Definitions</a></h4>
<div class="outline-text-4" id="text-orgheadline19">
</div><div id="outline-container-orgheadline18" class="outline-5">
<h5 id="orgheadline18"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-21.html#%_thm_3.11">Exercise 3.11.</a></h5>
<div class="outline-text-5" id="text-orgheadline18">
<p>
The environment for <code>make-account</code> points to the global environment. In this
environment exist references to the argument <code>balance</code> as well as the local
procedures <code>withdraw</code>, <code>deposit</code>, and <code>dispatch</code>. Each local procedure points to
the environment of <code>make-account</code> (and retains references to its own arguments
as well). It's necessary to keep references to the local procedures in the
environment of <code>make-account</code> so that <code>dispatch</code> can resolve the references to
<code>withdraw</code> and <code>deposit</code> in its body. (On the other hand, it should not
strictly be necessary to retain a reference to <code>dispatch</code> since a reference to
that procedure is returned.)
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline52" class="outline-3">
<h3 id="orgheadline52"><span class="done DONE">DONE</span> 3.3: <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_sec_3.3">Modeling with Mutable Data</a></h3>
<div class="outline-text-3" id="text-orgheadline52">
</div><div id="outline-container-orgheadline30" class="outline-4">
<h4 id="orgheadline30"><span class="done DONE">DONE</span> 3.3.1: <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_sec_3.3.1">Mutable List Structure</a></h4>
<div class="outline-text-4" id="text-orgheadline30">
</div><div id="outline-container-orgheadline21" class="outline-5">
<h5 id="orgheadline21"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.12">Exercise 3.12.</a></h5>
<div class="outline-text-5" id="text-orgheadline21">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Nondestructive</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span> <span style="color: #7388d6;">(</span>list 'a 'b<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">y</span> <span style="color: #7388d6;">(</span>list 'c 'd<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">z</span> <span style="color: #7388d6;">(</span>append x y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>test z
      '<span style="color: #7388d6;">(</span>a b c d<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test <span style="color: #7388d6;">(</span>cdr x<span style="color: #7388d6;">)</span>
      '<span style="color: #7388d6;">(</span>b<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Destructive</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">w</span> <span style="color: #7388d6;">(</span>append! x y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>test w
      '<span style="color: #7388d6;">(</span>a b c d<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test <span style="color: #7388d6;">(</span>cdr w<span style="color: #7388d6;">)</span>
      '<span style="color: #7388d6;">(</span>b c d<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline22" class="outline-5">
<h5 id="orgheadline22"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.13">Exercise 3.13.</a></h5>
<div class="outline-text-5" id="text-orgheadline22">
<p>
When a circular list is constructed from a linear list, the last cons cell in
the original list has its cdr set to the head of the original list. Thus,
<code>(null? (cdr x))</code> never returns true for any element <code>x</code> in the list and the
<code>last-pair</code> procedure loops around the list forever.
</p>
</div>
</div>
