ch3/ch3.html

<div id="outline-container-orgheadline23" class="outline-5">
<h5 id="orgheadline23"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.14">Exercise 3.14.</a></h5>
<div class="outline-text-5" id="text-orgheadline23">
<p>
<code>mystery</code> reverses a list destructively:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock1"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">mystery</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">loop</span> x y<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>null? x<span style="color: #709870;">)</span>
        y
        <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>temp <span style="color: #858580;">(</span>cdr x<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>set-cdr! x y<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>loop temp x<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>loop x '<span style="color: #909183;">()</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #228b22;">&lt;&lt;ex-3-14&gt;&gt;</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">v</span> '<span style="color: #7388d6;">(</span>a b c d<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">w</span> <span style="color: #7388d6;">(</span>mystery v<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test w
      '<span style="color: #7388d6;">(</span>d c b a<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline24" class="outline-5">
<h5 id="orgheadline24"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.15">Exercise 3.15.</a></h5>
<div class="outline-text-5" id="text-orgheadline24">
<p>
In Figure 3.16, modify the diagram so that the arrow pointing to the ~'a~ cell
now points to a ~'wow~ cell.
</p>

<p>
In Figure 3.17, only the arrow pointing to ~'a~ from below now points to ~'wow~
&#x2013; the arrow from above continues to point to ~'a~.
</p>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-5">
<h5 id="orgheadline25"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.16">Exercise 3.16.</a></h5>
<div class="outline-text-5" id="text-orgheadline25">
<p>
Ben Bitdiddle's flawed procedure:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock2"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">count-pairs</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span>pair? x<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      0
      <span style="color: #909183;">(</span>+ <span style="color: #709870;">(</span>count-pairs <span style="color: #907373;">(</span>car x<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>count-pairs <span style="color: #907373;">(</span>cdr x<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         1<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
We define some test data here, containing a simple list, some more complex
linked structures, and a list containing a cycle, for this and the rest of the
exercises in this section.
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">pairs-3</span> '<span style="color: #7388d6;">(</span>a b c<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">pairs-4</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">begin</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span> '<span style="color: #709870;">(</span>a b c<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>set-car! x <span style="color: #709870;">(</span>cddr x<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    x<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">pairs-7</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">begin</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span> '<span style="color: #709870;">(</span>a b c<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>set-car! x <span style="color: #709870;">(</span>cdr x<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>set-car! <span style="color: #709870;">(</span>cdr x<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>cddr x<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    x<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">pairs-cycle</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">begin</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span> '<span style="color: #709870;">(</span>a b c<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>set-cdr! <span style="color: #709870;">(</span>cddr x<span style="color: #709870;">)</span> x<span style="color: #909183;">)</span>
    x<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"sharing-identity-test-data"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 0
      <span style="color: #7388d6;">(</span>count-pairs '<span style="color: #909183;">()</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 0
      <span style="color: #7388d6;">(</span>count-pairs 'a<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 3
      <span style="color: #7388d6;">(</span>count-pairs pairs-3<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 4
      <span style="color: #7388d6;">(</span>count-pairs pairs-4<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 7
      <span style="color: #7388d6;">(</span>count-pairs pairs-7<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">No test for pairs-cycle, because a cycle causes this version of count-pairs</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">to run forever.</span>
</pre>
</div>
</div>
</div>
