ch3/ch3.html

<div id="outline-container-orgheadline26" class="outline-5">
<h5 id="orgheadline26"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.17">Exercise 3.17.</a></h5>
<div class="outline-text-5" id="text-orgheadline26">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">count-pairs</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>seens '<span style="color: #907373;">()</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">inner</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>x x<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> <span style="color: #907373;">(</span><span style="color: #a020f0;">or</span> <span style="color: #6276ba;">(</span>not <span style="color: #858580;">(</span>pair? x<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span>memq x seens<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          0
          <span style="color: #907373;">(</span><span style="color: #a020f0;">begin</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">set!</span> seens <span style="color: #858580;">(</span>cons x seens<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>+ <span style="color: #858580;">(</span>inner <span style="color: #80a880;">(</span>car x<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>inner <span style="color: #80a880;">(</span>cdr x<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
               1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"sharing-identity-test-data"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-17-count-pairs"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 0
      <span style="color: #7388d6;">(</span>count-pairs '<span style="color: #909183;">()</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 0
      <span style="color: #7388d6;">(</span>count-pairs 'a<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 3
      <span style="color: #7388d6;">(</span>count-pairs pairs-3<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 4
      <span style="color: #7388d6;">(</span>count-pairs pairs-4<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 7
      <span style="color: #7388d6;">(</span>count-pairs pairs-7<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 3
      <span style="color: #7388d6;">(</span>count-pairs pairs-cycle<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline27" class="outline-5">
<h5 id="orgheadline27"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.18">Exercise 3.18.</a></h5>
<div class="outline-text-5" id="text-orgheadline27">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cycle?</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>seens '<span style="color: #907373;">()</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">inner</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>x x<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>not <span style="color: #858580;">(</span>pair? x<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> #f<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>memq x seens<span style="color: #6276ba;">)</span> #t<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span><span style="color: #a020f0;">set!</span> seens <span style="color: #858580;">(</span>cons x seens<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                  <span style="color: #6276ba;">(</span>inner <span style="color: #858580;">(</span>cdr x<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"sharing-identity-test-data"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-18"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>cycle? '<span style="color: #909183;">()</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>cycle? 'a<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>cycle? pairs-3<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>cycle? pairs-4<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>cycle? pairs-7<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #t
      <span style="color: #7388d6;">(</span>cycle? pairs-cycle<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
