ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.19][Exercise 3.19.]]

Use [[http://en.wikipedia.org/wiki/Cycle_detection#Tortoise_and_hare][Floyd's cycle-finding algorithm]], also known as the "tortoise-and-hare"
algorithm. Two pointers to the list elements are kept. The "tortoise" is
advanced by 1 position for every call, while the "hare" is advanced by 2
positions. If a cycle exists, the tortoise and hare will eventually run into
other (i.e., compare equal via ~eq?~ after the initial call).

#+BEGIN_SRC scheme :tangle ex-3-19.scm
  (define (cycle? x)
    (define (cdr-safe x)
      (if (not (pair? x))
          x
          (cdr x)))
    (define (cddr-safe x)
      (if (not (pair? x))
          x
          (cdr-safe (cdr x))))
    (define (inner tortoise hare first-run)
      (cond ((any (lambda (p) (not (pair? p)))
                  (list tortoise hare))
             #f)
            ((and (not first-run)
                  (eq? tortoise hare))
             #t)
            (else (inner (cdr-safe tortoise)
                         (cddr-safe hare)
                         #f))))
    (inner x x #t))
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-3-19-test.scm
  (use test)
  (include "sharing-identity-test-data")
  (include "ex-3-19")
  (test #f
        (cycle? '()))
  (test #f
        (cycle? 'a))
  (test #f
        (cycle? pairs-3))
  (test #f
        (cycle? pairs-4))
  (test #f
        (cycle? pairs-7))
  (test #t
        (cycle? pairs-cycle))
#+END_SRC

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.20][Exercise 3.20.]]

Given the implementation of the primitive list functions in terms of
dispatching, now including mutation,

#+BEGIN_SRC scheme :tangle ex-3-20-cons-dispatch.scm
  ;;; -d for dispatching.
  (define (cons-d x y)
    (define (set-x! v) (set! x v))
    (define (set-y! v) (set! y v))
    (define (dispatch m)
      (cond ((eq? m 'car) x)
            ((eq? m 'cdr) y)
            ((eq? m 'set-car!) set-x!)
            ((eq? m 'set-cdr!) set-y!)
            (else (error "Undefined operation -- CONS" m))))
    dispatch)
  (define (car-d z) (z 'car))
  (define (cdr-d z) (z 'cdr))
  (define (set-car-d! z new-value)
    ((z 'set-car!) new-value)
    z)
  (define (set-cdr-d! z new-value)
    ((z 'set-cdr!) new-value)
    z)
#+END_SRC

we can understand the environment diagram of the following code

#+BEGIN_SRC scheme :tangle ex-3-20-test.scm
  (use test)
  (include "ex-3-20-cons-dispatch")
  (define x (cons 1 2))
  (define z (cons x x))
  (set-car! (cdr z) 17)
  (test 17
        (car x))
#+END_SRC

as follows:

- Every call to ~cons-d~ returns a ~dispatch~ closure which has a pointer to
  the environment of the ~cons-d~ closure, which holds the arguments to
  ~cons-d~, ~x~ and ~y~.
- All messages to the ~dispatch~ closure read or write to the environment of
  the original ~cons-d~ call, which is preserved by the link from ~dispatch~.
- ~x~ and ~y~, the arguments to ~cons-d~, are acted upon in precisely the same
  way as the ~car~ and ~cdr~ of a normal ~cons~ cell.


