ch3/ch3.html

<div id="outline-container-orgheadline28" class="outline-5">
<h5 id="orgheadline28"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.19">Exercise 3.19.</a></h5>
<div class="outline-text-5" id="text-orgheadline28">
<p>
Use <a href="http://en.wikipedia.org/wiki/Cycle_detection#Tortoise_and_hare">Floyd's cycle-finding algorithm</a>, also known as the "tortoise-and-hare"
algorithm. Two pointers to the list elements are kept. The "tortoise" is
advanced by 1 position for every call, while the "hare" is advanced by 2
positions. If a cycle exists, the tortoise and hare will eventually run into
other (i.e., compare equal via <code>eq?</code> after the initial call).
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cycle?</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">cdr-safe</span> x<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>pair? x<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        x
        <span style="color: #709870;">(</span>cdr x<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">cddr-safe</span> x<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>pair? x<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        x
        <span style="color: #709870;">(</span>cdr-safe <span style="color: #907373;">(</span>cdr x<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">inner</span> tortoise hare first-run<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>any <span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #858580;">(</span>p<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>not <span style="color: #80a880;">(</span>pair? p<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                <span style="color: #6276ba;">(</span>list tortoise hare<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           #f<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">and</span> <span style="color: #6276ba;">(</span>not first-run<span style="color: #6276ba;">)</span>
                <span style="color: #6276ba;">(</span>eq? tortoise hare<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           #t<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span> <span style="color: #907373;">(</span>inner <span style="color: #6276ba;">(</span>cdr-safe tortoise<span style="color: #6276ba;">)</span>
                       <span style="color: #6276ba;">(</span>cddr-safe hare<span style="color: #6276ba;">)</span>
                       #f<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>inner x x #t<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"sharing-identity-test-data"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-19"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>cycle? '<span style="color: #909183;">()</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>cycle? 'a<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>cycle? pairs-3<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>cycle? pairs-4<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>cycle? pairs-7<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #t
      <span style="color: #7388d6;">(</span>cycle? pairs-cycle<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline29" class="outline-5">
<h5 id="orgheadline29"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.20">Exercise 3.20.</a></h5>
<div class="outline-text-5" id="text-orgheadline29">
<p>
Given the implementation of the primitive list functions in terms of
dispatching, now including mutation,
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #b22222;">;;; </span><span style="color: #b22222;">-d for dispatching.</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cons-d</span> x y<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">set-x!</span> v<span style="color: #909183;">)</span> <span style="color: #909183;">(</span><span style="color: #a020f0;">set!</span> x v<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">set-y!</span> v<span style="color: #909183;">)</span> <span style="color: #909183;">(</span><span style="color: #a020f0;">set!</span> y v<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">dispatch</span> m<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? m 'car<span style="color: #907373;">)</span> x<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? m 'cdr<span style="color: #907373;">)</span> y<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? m 'set-car!<span style="color: #907373;">)</span> set-x!<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? m 'set-cdr!<span style="color: #907373;">)</span> set-y!<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span> <span style="color: #907373;">(</span>error <span style="color: #8b2252;">"Undefined operation -- CONS"</span> m<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  dispatch<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">car-d</span> z<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>z 'car<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cdr-d</span> z<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>z 'cdr<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">set-car-d!</span> z new-value<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>z 'set-car!<span style="color: #909183;">)</span> new-value<span style="color: #7388d6;">)</span>
  z<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">set-cdr-d!</span> z new-value<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>z 'set-cdr!<span style="color: #909183;">)</span> new-value<span style="color: #7388d6;">)</span>
  z<span style="color: #707183;">)</span>
</pre>
</div>

<p>
we can understand the environment diagram of the following code
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-20-cons-dispatch"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span> <span style="color: #7388d6;">(</span>cons 1 2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">z</span> <span style="color: #7388d6;">(</span>cons x x<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>set-car! <span style="color: #7388d6;">(</span>cdr z<span style="color: #7388d6;">)</span> 17<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 17
      <span style="color: #7388d6;">(</span>car x<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
as follows:
</p>

<ul class="org-ul">
<li>Every call to <code>cons-d</code> returns a <code>dispatch</code> closure which has a pointer to
the environment of the <code>cons-d</code> closure, which holds the arguments to
<code>cons-d</code>, <code>x</code> and <code>y</code>.</li>
<li>All messages to the <code>dispatch</code> closure read or write to the environment of
the original <code>cons-d</code> call, which is preserved by the link from <code>dispatch</code>.</li>
<li><code>x</code> and <code>y</code>, the arguments to <code>cons-d</code>, are acted upon in precisely the same
way as the <code>car</code> and <code>cdr</code> of a normal <code>cons</code> cell.</li>
</ul>
</div>
</div>
</div>
