ch3/ch3.org
*** DONE 3.3.2: [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_sec_3.3.2][Representing Queues]]

#+BEGIN_SRC scheme :tangle queue-cons.scm
  (define (front-ptr queue) (car queue))
  (define (rear-ptr queue) (cdr queue))
  (define (set-front-ptr! queue item) (set-car! queue item))
  (define (set-rear-ptr! queue item) (set-cdr! queue item))
  (define (empty-queue? queue) (null? (front-ptr queue)))
  (define (make-queue) (cons '() '()))
  (define (front-queue queue)
    (if (empty-queue? queue)
        (error "FRONT called with an empty queue" queue)
        (car (front-ptr queue))))
  (define (insert-queue! queue item)
    (let ((new-pair (cons item '())))
      (cond ((empty-queue? queue)
             (set-front-ptr! queue new-pair)
             (set-rear-ptr! queue new-pair)
             queue)
            (else
             (set-cdr! (rear-ptr queue) new-pair)
             (set-rear-ptr! queue new-pair)
             queue))))
  (define (delete-queue! queue)
    (cond ((empty-queue? queue)
           (error "DELETE! called with an empty queue" queue))
          (else
           (set-front-ptr! queue (cdr (front-ptr queue)))
           queue)))
#+END_SRC

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.21][Exercise 3.21.]]

The standard Lisp printer recursively prints the contents of a list (or cons
cell) in order. In particular, this implementation does not treat two pointers
to the same underlying object specially. With the mutation used to implement
the queue, ~(rear-ptr queue)~ points to the last item in the queue, while
~(front-ptr queue)~ points to the head of the list that actually stores the
items in the queue. Since the last item is in the queue list, it is printed
twice, once as an element of the list and once as a lone item. (As an aside, it
appears that the queue is keeping the last item alive longer than necessary
through the pointer ~rear-ptr~ after the queue is empty. The implementation
should set ~rear-ptr~ to nil (or some other small, primitive, immutable value)
to fix this.)

Since ~front-ptr~ returns a pointer to the list that represents the queue, all
we need to do to print the queue properly is print that list:

#+BEGIN_SRC scheme :tangle ex-3-21-print-queue.scm
  (define (print-queue q)
    (display (front-ptr q)))
#+END_SRC

