ch3/ch3.html


<div id="outline-container-orgheadline31" class="outline-4">
<h4 id="orgheadline31"><span class="done DONE">DONE</span> 3.3.2: <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_sec_3.3.2">Representing Queues</a></h4>
<div class="outline-text-4" id="text-orgheadline31">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">front-ptr</span> queue<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>car queue<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">rear-ptr</span> queue<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cdr queue<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">set-front-ptr!</span> queue item<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>set-car! queue item<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">set-rear-ptr!</span> queue item<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>set-cdr! queue item<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">empty-queue?</span> queue<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>null? <span style="color: #909183;">(</span>front-ptr queue<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-queue</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cons '<span style="color: #909183;">()</span> '<span style="color: #909183;">()</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">front-queue</span> queue<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>empty-queue? queue<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>error <span style="color: #8b2252;">"FRONT called with an empty queue"</span> queue<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>car <span style="color: #709870;">(</span>front-ptr queue<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">insert-queue!</span> queue item<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>new-pair <span style="color: #907373;">(</span>cons item '<span style="color: #6276ba;">()</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>empty-queue? queue<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>set-front-ptr! queue new-pair<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>set-rear-ptr! queue new-pair<span style="color: #907373;">)</span>
           queue<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span>
           <span style="color: #907373;">(</span>set-cdr! <span style="color: #6276ba;">(</span>rear-ptr queue<span style="color: #6276ba;">)</span> new-pair<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>set-rear-ptr! queue new-pair<span style="color: #907373;">)</span>
           queue<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">delete-queue!</span> queue<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>empty-queue? queue<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"DELETE! called with an empty queue"</span> queue<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span>
         <span style="color: #709870;">(</span>set-front-ptr! queue <span style="color: #907373;">(</span>cdr <span style="color: #6276ba;">(</span>front-ptr queue<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         queue<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>

<div id="outline-container-orgheadline32" class="outline-5">
<h5 id="orgheadline32"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.21">Exercise 3.21.</a></h5>
<div class="outline-text-5" id="text-orgheadline32">
<p>
The standard Lisp printer recursively prints the contents of a list (or cons
cell) in order. In particular, this implementation does not treat two pointers
to the same underlying object specially. With the mutation used to implement
the queue, <code>(rear-ptr queue)</code> points to the last item in the queue, while
<code>(front-ptr queue)</code> points to the head of the list that actually stores the
items in the queue. Since the last item is in the queue list, it is printed
twice, once as an element of the list and once as a lone item. (As an aside, it
appears that the queue is keeping the last item alive longer than necessary
through the pointer <code>rear-ptr</code> after the queue is empty. The implementation
should set <code>rear-ptr</code> to nil (or some other small, primitive, immutable value)
to fix this.)
</p>

<p>
Since <code>front-ptr</code> returns a pointer to the list that represents the queue, all
we need to do to print the queue properly is print that list:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">print-queue</span> q<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>display <span style="color: #909183;">(</span>front-ptr q<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
