ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.22][Exercise 3.22.]]

A straightforward implementation uses the same approach as implementing cons
cells using dispatch -- the arguments to the constructor, retained by the
~dispatch~ closure, are manipulated by subprocedures in ~dispatch~ in the same
way as the car and cdr of the cons cell we use to implement the queue above.

#+BEGIN_SRC scheme :tangle ex-3-22-queue-dispatch.scm
  (define (make-queue-d)
    (let ((front-ptr '())
          (rear-ptr '()))
      ;; Some of these procedures are defined to return a reference to the queue
      ;; on which the procedure was invoked. For consistency, we define all these
      ;; procedures to take `queue`.
      (define (set-front-ptr! queue item) (set! front-ptr item))
      (define (set-rear-ptr! queue item) (set! rear-ptr item))
      (define (empty-queue? queue) (null? front-ptr))
      (define (front-queue queue)
        (if (empty-queue? queue)
            (error "FRONT called with an empty queue" queue)
            (car front-ptr)))
      (define (insert-queue! queue item)
        (let ((new-pair (cons item '())))
          (cond ((empty-queue? queue)
                 (set-front-ptr! queue new-pair)
                 (set-rear-ptr! queue new-pair)
                 queue)
                (else
                 (set-cdr! rear-ptr new-pair)
                 (set-rear-ptr! queue new-pair)
                 queue))))
      (define (delete-queue! queue)
        (cond ((empty-queue? queue)
               (error "DELETE! called with an empty queue" queue))
              (else
               (set-front-ptr! queue (cdr front-ptr))
               ;; If the queue becomes empty, clear `rear-ptr` to avoid
               ;; unnecessarily retaining a reference to it.
               (when (null? front-ptr)
                     (set-rear-ptr! queue '()))
               queue)))
      (define (dispatch m)
        (cond ((eq? m 'front-ptr) front-ptr)
              ((eq? m 'rear-ptr) rear-ptr)
              ((eq? m 'set-front-ptr!)
               (lambda (item) (set-front-ptr! dispatch item)))
              ((eq? m 'set-rear-ptr!)
               (lambda (item) (set-rear-ptr! dispatch item)))
              ((eq? m 'empty-queue?)
               (empty-queue? dispatch))
              ((eq? m 'front-queue)
               (front-queue dispatch))
              ((eq? m 'insert-queue!)
               (lambda (item) (insert-queue! dispatch item)))
              ((eq? m 'delete-queue!)
               (delete-queue! dispatch))
              (else
               error "Undefined operation - QUEUE" m)))
      dispatch))
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-3-22-test.scm
  (use test)
  (include "ex-3-22-queue-dispatch")
  (define q (make-queue-d))
  ((q 'insert-queue!) 0)
  (test 0
        (q 'front-queue))
  ((q 'insert-queue!) 1)
  ((q 'insert-queue!) 2)
  (test 2
        (car (q 'rear-ptr)))
  (q 'delete-queue!)
  (test 1
        (q 'front-queue))
  (q 'delete-queue!)
  (q 'delete-queue!)
  (test #t
        (q 'empty-queue?))
  (test #t
        (null? (q 'rear-ptr)))
#+END_SRC

