ch3/ch3.html

<div id="outline-container-orgheadline33" class="outline-5">
<h5 id="orgheadline33"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.22">Exercise 3.22.</a></h5>
<div class="outline-text-5" id="text-orgheadline33">
<p>
A straightforward implementation uses the same approach as implementing cons
cells using dispatch &#x2013; the arguments to the constructor, retained by the
<code>dispatch</code> closure, are manipulated by subprocedures in <code>dispatch</code> in the same
way as the car and cdr of the cons cell we use to implement the queue above.
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-queue-d</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>front-ptr '<span style="color: #907373;">()</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>rear-ptr '<span style="color: #907373;">()</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">Some of these procedures are defined to return a reference to the queue</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">on which the procedure was invoked. For consistency, we define all these</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">procedures to take `queue`.</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">set-front-ptr!</span> queue item<span style="color: #709870;">)</span> <span style="color: #709870;">(</span><span style="color: #a020f0;">set!</span> front-ptr item<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">set-rear-ptr!</span> queue item<span style="color: #709870;">)</span> <span style="color: #709870;">(</span><span style="color: #a020f0;">set!</span> rear-ptr item<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">empty-queue?</span> queue<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>null? front-ptr<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">front-queue</span> queue<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> <span style="color: #907373;">(</span>empty-queue? queue<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>error <span style="color: #8b2252;">"FRONT called with an empty queue"</span> queue<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>car front-ptr<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">insert-queue!</span> queue item<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>new-pair <span style="color: #858580;">(</span>cons item '<span style="color: #80a880;">()</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>empty-queue? queue<span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>set-front-ptr! queue new-pair<span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>set-rear-ptr! queue new-pair<span style="color: #858580;">)</span>
               queue<span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span><span style="color: #a020f0;">else</span>
               <span style="color: #858580;">(</span>set-cdr! rear-ptr new-pair<span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>set-rear-ptr! queue new-pair<span style="color: #858580;">)</span>
               queue<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">delete-queue!</span> queue<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>empty-queue? queue<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>error <span style="color: #8b2252;">"DELETE! called with an empty queue"</span> queue<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span>
             <span style="color: #6276ba;">(</span>set-front-ptr! queue <span style="color: #858580;">(</span>cdr front-ptr<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #b22222;">;; </span><span style="color: #b22222;">If the queue becomes empty, clear `rear-ptr` to avoid</span>
             <span style="color: #b22222;">;; </span><span style="color: #b22222;">unnecessarily retaining a reference to it.</span>
             <span style="color: #6276ba;">(</span><span style="color: #a020f0;">when</span> <span style="color: #858580;">(</span>null? front-ptr<span style="color: #858580;">)</span>
                   <span style="color: #858580;">(</span>set-rear-ptr! queue '<span style="color: #80a880;">()</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             queue<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">dispatch</span> m<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'front-ptr<span style="color: #6276ba;">)</span> front-ptr<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'rear-ptr<span style="color: #6276ba;">)</span> rear-ptr<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'set-front-ptr!<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #858580;">(</span>item<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>set-front-ptr! dispatch item<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'set-rear-ptr!<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #858580;">(</span>item<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>set-rear-ptr! dispatch item<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'empty-queue?<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>empty-queue? dispatch<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'front-queue<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>front-queue dispatch<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'insert-queue!<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #858580;">(</span>item<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>insert-queue! dispatch item<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'delete-queue!<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>delete-queue! dispatch<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span>
             error <span style="color: #8b2252;">"Undefined operation - QUEUE"</span> m<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    dispatch<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-22-queue-dispatch"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">q</span> <span style="color: #7388d6;">(</span>make-queue-d<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7388d6;">(</span>q 'insert-queue!<span style="color: #7388d6;">)</span> 0<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 0
      <span style="color: #7388d6;">(</span>q 'front-queue<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7388d6;">(</span>q 'insert-queue!<span style="color: #7388d6;">)</span> 1<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7388d6;">(</span>q 'insert-queue!<span style="color: #7388d6;">)</span> 2<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 2
      <span style="color: #7388d6;">(</span>car <span style="color: #909183;">(</span>q 'rear-ptr<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>q 'delete-queue!<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 1
      <span style="color: #7388d6;">(</span>q 'front-queue<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>q 'delete-queue!<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>q 'delete-queue!<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #t
      <span style="color: #7388d6;">(</span>q 'empty-queue?<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #t
      <span style="color: #7388d6;">(</span>null? <span style="color: #909183;">(</span>q 'rear-ptr<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
