ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.23][Exercise 3.23.]]

Represent as doubly-linked list. Will need selectors for DLL:

#+BEGIN_SRC scheme :tangle ex-3-23.scm
  (define (make-deque)
    (let ((header (cons '() '())))
      ;; Internal procedures on internal representation of deque.
      (define (make-node item prev next)
        (cons (cons item prev) next))
      (define (front) (car header))
      (define (rear) (cdr header))
      (define (set-front! node) (set-car! header node))
      (define (set-rear! node) (set-cdr! header node))
      (define (item node) (caar node))
      (define (prev node) (cdar node))
      (define (next node) (cdr node))
      (define (set-prev! this that) (set-cdr! (car this) that))
      (define (set-next! this that) (set-cdr! this that))

      ;; Exported procedures
      (define (empty? self)
        (eq? (front) '()))
      (define (front-deque self)
        (item (front)))
      (define (rear-deque self)
        (item (rear)))
      (define (front-insert! self item)
        (set-front! (make-node item '() (front))))
      (define (rear-insert! self item)
        (set-rear! (make-node item (rear) '())))
      (define (front-delete! self)
        (set-front! (next (front))))
      (define (rear-delete! self)
        (set-rear! (prev (rear))))

      (define (dispatch m)
        (cond ((eq? m 'empty?) (empty? header))
              ((eq? m 'front-deque) (front-deque header))
              ((eq? m 'rear-deque) (rear-deque header))
              ((eq? m 'front-insert!) (front-insert! header item))
              ((eq? m 'rear-insert!) (rear-insert! header item))
              ((eq? m 'front-delete!) (front-delete! header))
              ((eq? m 'rear-delete!) (rear-delete! header))
              (else (error "Undefined operation -- DEQUE" m))))
      dispatch))
#+END_SRC


*** DONE 3.3.3: [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_sec_3.3.3][Representing Tables]]

