ch3/ch3.html

<div id="outline-container-orgheadline34" class="outline-5">
<h5 id="orgheadline34"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.23">Exercise 3.23.</a></h5>
<div class="outline-text-5" id="text-orgheadline34">
<p>
Represent as doubly-linked list. Will need selectors for DLL:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-deque</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>header <span style="color: #907373;">(</span>cons '<span style="color: #6276ba;">()</span> '<span style="color: #6276ba;">()</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">Internal procedures on internal representation of deque.</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">make-node</span> item prev next<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>cons <span style="color: #907373;">(</span>cons item prev<span style="color: #907373;">)</span> next<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">front</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>car header<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">rear</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>cdr header<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">set-front!</span> node<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>set-car! header node<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">set-rear!</span> node<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>set-cdr! header node<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">item</span> node<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>caar node<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">prev</span> node<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>cdar node<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">next</span> node<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>cdr node<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">set-prev!</span> this that<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>set-cdr! <span style="color: #907373;">(</span>car this<span style="color: #907373;">)</span> that<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">set-next!</span> this that<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>set-cdr! this that<span style="color: #709870;">)</span><span style="color: #909183;">)</span>

    <span style="color: #b22222;">;; </span><span style="color: #b22222;">Exported procedures</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">empty?</span> self<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>eq? <span style="color: #907373;">(</span>front<span style="color: #907373;">)</span> '<span style="color: #907373;">()</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">front-deque</span> self<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>item <span style="color: #907373;">(</span>front<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">rear-deque</span> self<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>item <span style="color: #907373;">(</span>rear<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">front-insert!</span> self item<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>set-front! <span style="color: #907373;">(</span>make-node item '<span style="color: #6276ba;">()</span> <span style="color: #6276ba;">(</span>front<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">rear-insert!</span> self item<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>set-rear! <span style="color: #907373;">(</span>make-node item <span style="color: #6276ba;">(</span>rear<span style="color: #6276ba;">)</span> '<span style="color: #6276ba;">()</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">front-delete!</span> self<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>set-front! <span style="color: #907373;">(</span>next <span style="color: #6276ba;">(</span>front<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">rear-delete!</span> self<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>set-rear! <span style="color: #907373;">(</span>prev <span style="color: #6276ba;">(</span>rear<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>

    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">dispatch</span> m<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'empty?<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>empty? header<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'front-deque<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>front-deque header<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'rear-deque<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>rear-deque header<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'front-insert!<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>front-insert! header item<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'rear-insert!<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>rear-insert! header item<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'front-delete!<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>front-delete! header<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'rear-delete!<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>rear-delete! header<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span>error <span style="color: #8b2252;">"Undefined operation -- DEQUE"</span> m<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    dispatch<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline39" class="outline-4">
<h4 id="orgheadline39"><span class="done DONE">DONE</span> 3.3.3: <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_sec_3.3.3">Representing Tables</a></h4>
