ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.24][Exercise 3.24.]]

#+BEGIN_SRC scheme :tangle ex-3-24.scm
  (define (make-table same-key?)
    (let ((tbl (cons '*table* '())))
      ;; Internal procedure
      (define (assoc key records)
        (cond ((null? records) #f)
              ((same-key? key (caar records)) (car records))
              (else (assoc key (cdr records)))))
      ;; Exported procedures
      (define (lookup key)
        (let ((record (assoc key (cdr tbl))))
          (if record
              (cdr record)
              #f)))
      (define (insert! key value)
        (let ((record (assoc key (cdr tbl))))
          (if record
              (set! (cdr record) value)
              (set! (cdr tbl) (cons (cons key value) (cdr tbl))))))
      ;; Dispatch
      (define (dispatch msg)
        (cond ((equal? msg 'lookup) lookup)
              ((equal? msg 'insert!) insert!)
              (else (error "TABLE -- unknown message")))))
      dispatch)
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-3-24-test.scm
  (include "ex-3-24")
  (use test)

  (define tbl-exact (make-table (lambda (x y) (equal? x y))))
  (test #f
        ((tbl-exact 'lookup) 'foo))

  ((tbl-exact 'insert!) 'a 1)
  ((tbl-exact 'insert!) 'b 2)
  ((tbl-exact 'insert!) 'c 3)
  (test 1
        ((tbl-exact 'lookup) 'a))
  (test 2
        ((tbl-exact 'lookup) 'b))
  (test 3
        ((tbl-exact 'lookup) 'c))

  (define tbl-inexact (make-table (lambda (x y)
                                    (< (abs (- x y)) .1))))
  (test #f
        ((tbl-inexact 'lookup) 'foo))
  ((tbl-inexact 'insert!) 1.0 'x)
  (test 'x
        ((tbl-inexact 'lookup) 1.05))
#+END_SRC

