ch3/ch3.html
<div class="outline-text-4" id="text-orgheadline39">
</div><div id="outline-container-orgheadline35" class="outline-5">
<h5 id="orgheadline35"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.24">Exercise 3.24.</a></h5>
<div class="outline-text-5" id="text-orgheadline35">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-table</span> same-key?<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>tbl <span style="color: #907373;">(</span>cons '*table* '<span style="color: #6276ba;">()</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">Internal procedure</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">assoc</span> key records<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>null? records<span style="color: #6276ba;">)</span> #f<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>same-key? key <span style="color: #858580;">(</span>caar records<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>car records<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span>assoc key <span style="color: #858580;">(</span>cdr records<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">Exported procedures</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">lookup</span> key<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>record <span style="color: #858580;">(</span>assoc key <span style="color: #80a880;">(</span>cdr tbl<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #a020f0;">if</span> record
            <span style="color: #6276ba;">(</span>cdr record<span style="color: #6276ba;">)</span>
            #f<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">insert!</span> key value<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>record <span style="color: #858580;">(</span>assoc key <span style="color: #80a880;">(</span>cdr tbl<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #a020f0;">if</span> record
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">set!</span> <span style="color: #858580;">(</span>cdr record<span style="color: #858580;">)</span> value<span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">set!</span> <span style="color: #858580;">(</span>cdr tbl<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>cons <span style="color: #80a880;">(</span>cons key value<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>cdr tbl<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">Dispatch</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">dispatch</span> msg<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>equal? msg 'lookup<span style="color: #6276ba;">)</span> lookup<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>equal? msg 'insert!<span style="color: #6276ba;">)</span> insert!<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span>error <span style="color: #8b2252;">"TABLE -- unknown message"</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
    dispatch<span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-24"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">tbl-exact</span> <span style="color: #7388d6;">(</span>make-table <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x y<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>equal? x y<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>tbl-exact 'lookup<span style="color: #909183;">)</span> 'foo<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #7388d6;">(</span>tbl-exact 'insert!<span style="color: #7388d6;">)</span> 'a 1<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7388d6;">(</span>tbl-exact 'insert!<span style="color: #7388d6;">)</span> 'b 2<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7388d6;">(</span>tbl-exact 'insert!<span style="color: #7388d6;">)</span> 'c 3<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 1
      <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>tbl-exact 'lookup<span style="color: #909183;">)</span> 'a<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 2
      <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>tbl-exact 'lookup<span style="color: #909183;">)</span> 'b<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 3
      <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>tbl-exact 'lookup<span style="color: #909183;">)</span> 'c<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">tbl-inexact</span> <span style="color: #7388d6;">(</span>make-table <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x y<span style="color: #709870;">)</span>
                                  <span style="color: #709870;">(</span>&lt; <span style="color: #907373;">(</span>abs <span style="color: #6276ba;">(</span>- x y<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> .1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>tbl-inexact 'lookup<span style="color: #909183;">)</span> 'foo<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7388d6;">(</span>tbl-inexact 'insert!<span style="color: #7388d6;">)</span> 1.0 'x<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 'x
      <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>tbl-inexact 'lookup<span style="color: #909183;">)</span> 1.05<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
