ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.25][Exercise 3.25.]]

#+BEGIN_SRC scheme :tangle ex-3-25.scm
  (define (make-table same-key?)
    (let ((tbl (cons '*table* '())))
      (define (assoc key records)
        (cond ((null? records) #f)
              ((same-key? key (caar records)) (car records))
              (else (assoc key (cdr records)))))
      (define (lookup keys)
        (let recur ((elems (cdr tbl))
                    (keys keys))
          (let ((record (assoc (car keys) elems)))
            (if record
                (cond
                 ;; If the current key maps to a list, there must be more keys to
                 ;; continue the search.
                 ((and (pair? (cdr keys)) (pair? (cdr record)))
                  (recur (cdr record) (cdr keys)))
                 ;; Ensure that e.g. `(lookup '(a b))` does not succeed if
                 ;; `(lookup '(a))` does not return a list.
                 ((null? (cdr keys))
                  (cdr record))
                 (else #f))
                #f))))
      (define (insert! keys value)
        (when (null? keys)
              (error "INSERT! -- keys cannot be empty"))
        (let recur ((header tbl)
                    (keys keys))
          (define (recursively-insert record)
            (if (null? (cdr keys))
                (set! (cdr record) value)
                (begin
                  ;; Obliterate any non-list associated with the current key,
                  ;; since it will need to be replaced.
                  (when (not (pair? (cdr record)))
                        (set! (cdr record) '()))
                  (recur record (cdr keys)))))
          (let ((record (assoc (car keys) (cdr header))))
            (if (pair? record)
                (recursively-insert record)
                (let ((inserted (if record
                                    record
                                    (cons (car keys) '()))))
                  (when (not record)
                        (set! (cdr header) (cons inserted (cdr header))))
                  (recursively-insert inserted))))))
      (define (dispatch msg)
        (cond ((equal? msg 'lookup) lookup)
              ((equal? msg 'insert!) insert!)
              (else (error "TABLE -- unknown message"))))
      dispatch))
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-3-25-test.scm
  (include "ex-3-25")
  (use test)

  (define (lookup tbl keys)
    ((tbl 'lookup) keys))
  (define (insert! tbl keys value)
    ((tbl 'insert!) keys value))
  (define tbl (make-table equal?))
  (test #f
        (lookup tbl '(a)))
  (test #f
        (lookup tbl '(0 1 2)))

  (insert! tbl '(a) 'foo)
  (insert! tbl '(0 1 2) 'bar)
  (test 'foo
        (lookup tbl '(a)))
  (test #f
        (lookup tbl '(a b)))
  (test 'bar
        (lookup tbl '(0 1 2)))
  (test #t
        (pair? (lookup tbl '(0))))

  (insert! tbl '(a b) 'baz)
  (test 'baz
        (lookup tbl '(a b)))
  (test #t
        (pair? (lookup tbl '(a))))
#+END_SRC

