ch3/ch3.html

<div id="outline-container-orgheadline36" class="outline-5">
<h5 id="orgheadline36"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.25">Exercise 3.25.</a></h5>
<div class="outline-text-5" id="text-orgheadline36">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-table</span> same-key?<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>tbl <span style="color: #907373;">(</span>cons '*table* '<span style="color: #6276ba;">()</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">assoc</span> key records<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>null? records<span style="color: #6276ba;">)</span> #f<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>same-key? key <span style="color: #858580;">(</span>caar records<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>car records<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span>assoc key <span style="color: #858580;">(</span>cdr records<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">lookup</span> keys<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">recur</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>elems <span style="color: #858580;">(</span>cdr tbl<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                  <span style="color: #6276ba;">(</span>keys keys<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #a020f0;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>record <span style="color: #80a880;">(</span>assoc <span style="color: #887070;">(</span>car keys<span style="color: #887070;">)</span> elems<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span><span style="color: #a020f0;">if</span> record
              <span style="color: #858580;">(</span><span style="color: #a020f0;">cond</span>
               <span style="color: #b22222;">;; </span><span style="color: #b22222;">If the current key maps to a list, there must be more keys to</span>
               <span style="color: #b22222;">;; </span><span style="color: #b22222;">continue the search.</span>
               <span style="color: #80a880;">(</span><span style="color: #887070;">(</span><span style="color: #a020f0;">and</span> <span style="color: #707183;">(</span>pair? <span style="color: #7388d6;">(</span>cdr keys<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> <span style="color: #707183;">(</span>pair? <span style="color: #7388d6;">(</span>cdr record<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                <span style="color: #887070;">(</span>recur <span style="color: #707183;">(</span>cdr record<span style="color: #707183;">)</span> <span style="color: #707183;">(</span>cdr keys<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
               <span style="color: #b22222;">;; </span><span style="color: #b22222;">Ensure that e.g. `(lookup '(a b))` does not succeed if</span>
               <span style="color: #b22222;">;; </span><span style="color: #b22222;">`(lookup '(a))` does not return a list.</span>
               <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>null? <span style="color: #707183;">(</span>cdr keys<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                <span style="color: #887070;">(</span>cdr record<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
               <span style="color: #80a880;">(</span><span style="color: #a020f0;">else</span> #f<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
              #f<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">insert!</span> keys value<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">when</span> <span style="color: #907373;">(</span>null? keys<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span>error <span style="color: #8b2252;">"INSERT! -- keys cannot be empty"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">recur</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>header tbl<span style="color: #6276ba;">)</span>
                  <span style="color: #6276ba;">(</span>keys keys<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #a020f0;">define</span> <span style="color: #6276ba;">(</span><span style="color: #0000ff;">recursively-insert</span> record<span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span><span style="color: #a020f0;">if</span> <span style="color: #858580;">(</span>null? <span style="color: #80a880;">(</span>cdr keys<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span><span style="color: #a020f0;">set!</span> <span style="color: #80a880;">(</span>cdr record<span style="color: #80a880;">)</span> value<span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span><span style="color: #a020f0;">begin</span>
                <span style="color: #b22222;">;; </span><span style="color: #b22222;">Obliterate any non-list associated with the current key,</span>
                <span style="color: #b22222;">;; </span><span style="color: #b22222;">since it will need to be replaced.</span>
                <span style="color: #80a880;">(</span><span style="color: #a020f0;">when</span> <span style="color: #887070;">(</span>not <span style="color: #707183;">(</span>pair? <span style="color: #7388d6;">(</span>cdr record<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                      <span style="color: #887070;">(</span><span style="color: #a020f0;">set!</span> <span style="color: #707183;">(</span>cdr record<span style="color: #707183;">)</span> '<span style="color: #707183;">()</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                <span style="color: #80a880;">(</span>recur record <span style="color: #887070;">(</span>cdr keys<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #a020f0;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>record <span style="color: #80a880;">(</span>assoc <span style="color: #887070;">(</span>car keys<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>cdr header<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span><span style="color: #a020f0;">if</span> <span style="color: #858580;">(</span>pair? record<span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span>recursively-insert record<span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span><span style="color: #a020f0;">let</span> <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>inserted <span style="color: #707183;">(</span><span style="color: #a020f0;">if</span> record
                                  record
                                  <span style="color: #7388d6;">(</span>cons <span style="color: #909183;">(</span>car keys<span style="color: #909183;">)</span> '<span style="color: #909183;">()</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                <span style="color: #80a880;">(</span><span style="color: #a020f0;">when</span> <span style="color: #887070;">(</span>not record<span style="color: #887070;">)</span>
                      <span style="color: #887070;">(</span><span style="color: #a020f0;">set!</span> <span style="color: #707183;">(</span>cdr header<span style="color: #707183;">)</span> <span style="color: #707183;">(</span>cons inserted <span style="color: #7388d6;">(</span>cdr header<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                <span style="color: #80a880;">(</span>recursively-insert inserted<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">dispatch</span> msg<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>equal? msg 'lookup<span style="color: #6276ba;">)</span> lookup<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>equal? msg 'insert!<span style="color: #6276ba;">)</span> insert!<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span>error <span style="color: #8b2252;">"TABLE -- unknown message"</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    dispatch<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-25"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">lookup</span> tbl keys<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>tbl 'lookup<span style="color: #909183;">)</span> keys<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">insert!</span> tbl keys value<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>tbl 'insert!<span style="color: #909183;">)</span> keys value<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">tbl</span> <span style="color: #7388d6;">(</span>make-table equal?<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>lookup tbl '<span style="color: #909183;">(</span>a<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>lookup tbl '<span style="color: #909183;">(</span>0 1 2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>insert! tbl '<span style="color: #7388d6;">(</span>a<span style="color: #7388d6;">)</span> 'foo<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>insert! tbl '<span style="color: #7388d6;">(</span>0 1 2<span style="color: #7388d6;">)</span> 'bar<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 'foo
      <span style="color: #7388d6;">(</span>lookup tbl '<span style="color: #909183;">(</span>a<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>lookup tbl '<span style="color: #909183;">(</span>a b<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 'bar
      <span style="color: #7388d6;">(</span>lookup tbl '<span style="color: #909183;">(</span>0 1 2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #t
      <span style="color: #7388d6;">(</span>pair? <span style="color: #909183;">(</span>lookup tbl '<span style="color: #709870;">(</span>0<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>insert! tbl '<span style="color: #7388d6;">(</span>a b<span style="color: #7388d6;">)</span> 'baz<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 'baz
      <span style="color: #7388d6;">(</span>lookup tbl '<span style="color: #909183;">(</span>a b<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #t
      <span style="color: #7388d6;">(</span>pair? <span style="color: #909183;">(</span>lookup tbl '<span style="color: #709870;">(</span>a<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
