ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.26][Exercise 3.26.]]

#+BEGIN_SRC scheme :tangle ex-3-26.scm
  (define (make-table cmp)
    (let ((tbl (cons '*table* '())))
      ;; Accessor functions
      (define (key node) (caar node))
      (define (value node) (cdar node))
      (define (left node) (cadr node))
      (define (right node) (cddr node))
      (define (set-value! node v) (set-cdr! (car node) v))
      (define (set-left! node n) (set-car! (cdr node) n))
      (define (set-right! node n) (set-cdr! (cdr node) n))
      (define (make-node k v) (cons #|payload|#  (cons k v)
                                    #|children|# (cons '() '())))

      (define (lookup k)
        (let recur ((node (cdr tbl)))
          (cond ((null? node) #f)
                ((< (cmp k (key node)) 0) (recur (left node)))
                ((> (cmp k (key node)) 0) (recur (right node)))
                (else (value node)))))
      (define (insert! k v)
        (set! (cdr tbl)
              (let recur ((node (cdr tbl)))
                (cond ((null? node) (make-node k v))
                      ((< (cmp k (key node)) 0)
                       (set-left! node (recur (left node)))
                       node)
                      ((> (cmp k (key node)) 0)
                       (set-right! node (recur (right node)))
                       node)
                      (else (set-value! node v)
                            node)))))
      (define (dispatch msg)
        (cond ((equal? msg 'lookup) lookup)
              ((equal? msg 'insert!) insert!)
              (else (error "TABLE -- unknown message"))))
      dispatch))
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-3-26-test.scm
  (include "ex-3-26")
  (use test)

  (define (lookup tbl key)
    ((tbl 'lookup) key))
  (define (insert! tbl key value)
    ((tbl 'insert!) key value))
  (define tbl (make-table (lambda (x y)
                            (cond ((< x y) -1)
                                  ((> x y) 1)
                                  (else 0)))))

  (test #f
        (lookup tbl 0))
  (insert! tbl 0 'foo)
  (test 'foo
        (lookup tbl 0))
  (test #f
        (lookup tbl 1))
  (insert! tbl -3 'bar)
  (test 'foo
        (lookup tbl 0))
  (test 'bar
        (lookup tbl -3))
#+END_SRC

