ch3/ch3.html

<div id="outline-container-orgheadline37" class="outline-5">
<h5 id="orgheadline37"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.26">Exercise 3.26.</a></h5>
<div class="outline-text-5" id="text-orgheadline37">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-table</span> cmp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>tbl <span style="color: #907373;">(</span>cons '*table* '<span style="color: #6276ba;">()</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">Accessor functions</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">key</span> node<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>caar node<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">value</span> node<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>cdar node<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">left</span> node<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>cadr node<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">right</span> node<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>cddr node<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">set-value!</span> node v<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>set-cdr! <span style="color: #907373;">(</span>car node<span style="color: #907373;">)</span> v<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">set-left!</span> node n<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>set-car! <span style="color: #907373;">(</span>cdr node<span style="color: #907373;">)</span> n<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">set-right!</span> node n<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>set-cdr! <span style="color: #907373;">(</span>cdr node<span style="color: #907373;">)</span> n<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">make-node</span> k v<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>cons <span style="color: #b22222;">#|payload|#</span>  <span style="color: #907373;">(</span>cons k v<span style="color: #907373;">)</span>
                                  <span style="color: #b22222;">#|children|#</span> <span style="color: #907373;">(</span>cons '<span style="color: #6276ba;">()</span> '<span style="color: #6276ba;">()</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>

    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">lookup</span> k<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">recur</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>node <span style="color: #858580;">(</span>cdr tbl<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>null? node<span style="color: #858580;">)</span> #f<span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>&lt; <span style="color: #80a880;">(</span>cmp k <span style="color: #887070;">(</span>key node<span style="color: #887070;">)</span><span style="color: #80a880;">)</span> 0<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>recur <span style="color: #80a880;">(</span>left node<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>&gt; <span style="color: #80a880;">(</span>cmp k <span style="color: #887070;">(</span>key node<span style="color: #887070;">)</span><span style="color: #80a880;">)</span> 0<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>recur <span style="color: #80a880;">(</span>right node<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span><span style="color: #a020f0;">else</span> <span style="color: #858580;">(</span>value node<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">insert!</span> k v<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">set!</span> <span style="color: #907373;">(</span>cdr tbl<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">recur</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>node <span style="color: #80a880;">(</span>cdr tbl<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>null? node<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>make-node k v<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                    <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>&lt; <span style="color: #887070;">(</span>cmp k <span style="color: #707183;">(</span>key node<span style="color: #707183;">)</span><span style="color: #887070;">)</span> 0<span style="color: #80a880;">)</span>
                     <span style="color: #80a880;">(</span>set-left! node <span style="color: #887070;">(</span>recur <span style="color: #707183;">(</span>left node<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                     node<span style="color: #858580;">)</span>
                    <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>&gt; <span style="color: #887070;">(</span>cmp k <span style="color: #707183;">(</span>key node<span style="color: #707183;">)</span><span style="color: #887070;">)</span> 0<span style="color: #80a880;">)</span>
                     <span style="color: #80a880;">(</span>set-right! node <span style="color: #887070;">(</span>recur <span style="color: #707183;">(</span>right node<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                     node<span style="color: #858580;">)</span>
                    <span style="color: #858580;">(</span><span style="color: #a020f0;">else</span> <span style="color: #80a880;">(</span>set-value! node v<span style="color: #80a880;">)</span>
                          node<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">dispatch</span> msg<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>equal? msg 'lookup<span style="color: #6276ba;">)</span> lookup<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>equal? msg 'insert!<span style="color: #6276ba;">)</span> insert!<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span>error <span style="color: #8b2252;">"TABLE -- unknown message"</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    dispatch<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-26"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">lookup</span> tbl key<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>tbl 'lookup<span style="color: #909183;">)</span> key<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">insert!</span> tbl key value<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>tbl 'insert!<span style="color: #909183;">)</span> key value<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">tbl</span> <span style="color: #7388d6;">(</span>make-table <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x y<span style="color: #709870;">)</span>
                          <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>&lt; x y<span style="color: #6276ba;">)</span> -1<span style="color: #907373;">)</span>
                                <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>&gt; x y<span style="color: #6276ba;">)</span> 1<span style="color: #907373;">)</span>
                                <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> 0<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>lookup tbl 0<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>insert! tbl 0 'foo<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 'foo
      <span style="color: #7388d6;">(</span>lookup tbl 0<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>lookup tbl 1<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>insert! tbl -3 'bar<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 'foo
      <span style="color: #7388d6;">(</span>lookup tbl 0<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 'bar
      <span style="color: #7388d6;">(</span>lookup tbl -3<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
