ch3/ch3.org
**** HOLD [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.27][Exercise 3.27.]]                                               :HOLD:
     - State "HOLD"       from "TODO"       [2015-01-18 Sun 19:09]

Ehh...


*** DONE 3.3.4: [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_sec_3.3.4][A Simulator for Digital Circuits]]

Some common procedures, most copied from the book.

#+BEGIN_SRC scheme :tangle logic-gates-common.scm
  (include "logic-gates-agenda")

  (define (make-wire)
    (let ((signal-value 0) (action-procedures '()))
      (define (set-my-signal! new-value)
        (if (not (= signal-value new-value))
            (begin (set! signal-value new-value)
                   (call-each action-procedures))
            'done))
      (define (accept-action-procedure! proc)
        (set! action-procedures (cons proc action-procedures))
        (proc))
      (define (dispatch m)
        (cond ((eq? m 'get-signal) signal-value)
              ((eq? m 'set-signal!) set-my-signal!)
              ((eq? m 'add-action!) accept-action-procedure!)
              (else (error "Unknown operation -- WIRE" m))))
      dispatch))
  (define (call-each procedures)
    (if (null? procedures)
        'done
        (begin
          ((car procedures))
          (call-each (cdr procedures)))))
  (define (get-signal wire)
    (wire 'get-signal))
  (define (set-signal! wire new-value)
    ((wire 'set-signal!) new-value))
  (define (add-action! wire action-procedure)
    ((wire 'add-action!) action-procedure))


#+END_SRC

#+BEGIN_SRC scheme
  (define (make-probe log)
    (define (probe name wire)
      (add-action! wire
                   (lambda ()
                     (cons (list name
                                 (current-time the-agenda)
                                 (get-signal wire))
                           log))))
    probe)

#+END_SRC

