ch3/ch3.html

<div id="outline-container-orgheadline38" class="outline-5">
<h5 id="orgheadline38"><span class="todo HOLD">HOLD</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.27">Exercise 3.27.</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="HOLD">HOLD</span></span></h5>
<div class="outline-text-5" id="text-orgheadline38">
<ul class="org-ul">
<li>State "HOLD"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2015-01-18 Sun 19:09]</span></span></li>
</ul>

<p>
Ehh&#x2026;
</p>
</div>
</div>
</div>


<div id="outline-container-orgheadline40" class="outline-4">
<h4 id="orgheadline40"><span class="done DONE">DONE</span> 3.3.4: <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_sec_3.3.4">A Simulator for Digital Circuits</a></h4>
<div class="outline-text-4" id="text-orgheadline40">
<p>
Some common procedures, most copied from the book.
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"logic-gates-agenda"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-wire</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>signal-value 0<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>action-procedures '<span style="color: #907373;">()</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">set-my-signal!</span> new-value<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> <span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>= signal-value new-value<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">begin</span> <span style="color: #6276ba;">(</span><span style="color: #a020f0;">set!</span> signal-value new-value<span style="color: #6276ba;">)</span>
                 <span style="color: #6276ba;">(</span>call-each action-procedures<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          'done<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">accept-action-procedure!</span> proc<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">set!</span> action-procedures <span style="color: #907373;">(</span>cons proc action-procedures<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>proc<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">dispatch</span> m<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'get-signal<span style="color: #6276ba;">)</span> signal-value<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'set-signal!<span style="color: #6276ba;">)</span> set-my-signal!<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? m 'add-action!<span style="color: #6276ba;">)</span> accept-action-procedure!<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span>error <span style="color: #8b2252;">"Unknown operation -- WIRE"</span> m<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    dispatch<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">call-each</span> procedures<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>null? procedures<span style="color: #909183;">)</span>
      'done
      <span style="color: #909183;">(</span><span style="color: #a020f0;">begin</span>
        <span style="color: #709870;">(</span><span style="color: #907373;">(</span>car procedures<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>call-each <span style="color: #907373;">(</span>cdr procedures<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">get-signal</span> wire<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>wire 'get-signal<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">set-signal!</span> wire new-value<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>wire 'set-signal!<span style="color: #909183;">)</span> new-value<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">add-action!</span> wire action-procedure<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>wire 'add-action!<span style="color: #909183;">)</span> action-procedure<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-probe</span> log<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">probe</span> name wire<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>add-action! wire
                 <span style="color: #709870;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #907373;">()</span>
                   <span style="color: #907373;">(</span>cons <span style="color: #6276ba;">(</span>list name
                               <span style="color: #858580;">(</span>current-time the-agenda<span style="color: #858580;">)</span>
                               <span style="color: #858580;">(</span>get-signal wire<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                         log<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  probe<span style="color: #707183;">)</span>
</pre>
</div>
</div>
