ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.28][Exercise 3.28.]]

#+NAME: ex-3-28-or-gate
#+BEGIN_SRC scheme
  (define (or-gate a1 a2 output)
    (define (logical-or s1 s2)
      (define (signal-valid s)
        (or (= s 0) (= s 1)))
      (cond ((not (signal-valid s1)) (error "Invalid signal on a1" s1))
            ((not (signal-valid s2)) (error "Invalid signal on a2" s2))
            ((and (= s1 0) (= s2 0)) 0)
            ((and (= s1 1) (= s2 0)) 1)
            ((and (= s1 0) (= s2 1)) 1)
            ((and (= s1 1) (= s2 1)) 1)
            (else (error "Unreachable"))))
    (define (or-action-procedure)
      (let ((new-value
             (logical-or (get-signal a1) (get-signal a2))))
        (after-delay or-gate-delay
                     (lambda ()
                       (set-signal! output new-value)))))
    (add-action! a1 or-action-procedure)
    (add-action! a2 or-action-procedure)
    'ok)
#+END_SRC

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.29][Exercise 3.29.]]

We use this result from De Morgan's laws

\begin{equation*}
a \vee b = \neg \left( \neg a \wedge \neg b \right)
\end{equation*}

to implement the or-gate in terms of and-gates and inverters:

#+BEGIN_SRC scheme
  (define (or-gate a1 a2 output)
    (let ((na (make-wire)) (nb (make-wire))
          (c (make-wire)))
      (inverter a na)
      (inverter b nb)
      (and-gate na nb c)
      (inverter c output)
      'ok))
#+END_SRC

This construction is simpler than the primitive and-gate constructed
above. However, its propagation times are more complex -- the formula for the
total propagation time \(t_{\mathrm{total}}\), where \(t_{x}\) is the
propagation delay due to the gate that begins the wire \(x\), is

\begin{equation*}
t_{\mathrm{total}} = \t_{output} + \t_{c} + \max{(na, nb)}
\end{equation*}

This may be a larger delay than that of the primitive or-gate if the primitive
gate can be manufactured to have a delay similar to that of the and-gate, for
example. On the other hand, if the composition of inverters and and-gates has
enough of an advantage, such as individual speed or cost, over a single
primitive or-gate or-gate for whatever reason, the composed or-gate may still
be preferable.

