ch3/ch3.html

<div id="outline-container-orgheadline41" class="outline-5">
<h5 id="orgheadline41"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.28">Exercise 3.28.</a></h5>
<div class="outline-text-5" id="text-orgheadline41">
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock3"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">or-gate</span> a1 a2 output<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">logical-or</span> s1 s2<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">signal-valid</span> s<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">or</span> <span style="color: #907373;">(</span>= s 0<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>= s 1<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>signal-valid s1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> <span style="color: #907373;">(</span>error <span style="color: #8b2252;">"Invalid signal on a1"</span> s1<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>signal-valid s2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> <span style="color: #907373;">(</span>error <span style="color: #8b2252;">"Invalid signal on a2"</span> s2<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">and</span> <span style="color: #6276ba;">(</span>= s1 0<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>= s2 0<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> 0<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">and</span> <span style="color: #6276ba;">(</span>= s1 1<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>= s2 0<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> 1<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">and</span> <span style="color: #6276ba;">(</span>= s1 0<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>= s2 1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> 1<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">and</span> <span style="color: #6276ba;">(</span>= s1 1<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>= s2 1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> 1<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span> <span style="color: #907373;">(</span>error <span style="color: #8b2252;">"Unreachable"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">or-action-procedure</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>new-value
           <span style="color: #6276ba;">(</span>logical-or <span style="color: #858580;">(</span>get-signal a1<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>get-signal a2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>after-delay or-gate-delay
                   <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">()</span>
                     <span style="color: #6276ba;">(</span>set-signal! output new-value<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>add-action! a1 or-action-procedure<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>add-action! a2 or-action-procedure<span style="color: #7388d6;">)</span>
  'ok<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline42" class="outline-5">
<h5 id="orgheadline42"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.29">Exercise 3.29.</a></h5>
<div class="outline-text-5" id="text-orgheadline42">
<p>
We use this result from De Morgan's laws
</p>

\begin{equation*}
a \vee b = \neg \left( \neg a \wedge \neg b \right)
\end{equation*}

<p>
to implement the or-gate in terms of and-gates and inverters:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">or-gate</span> a1 a2 output<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>na <span style="color: #907373;">(</span>make-wire<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>nb <span style="color: #907373;">(</span>make-wire<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>c <span style="color: #907373;">(</span>make-wire<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>inverter a na<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>inverter b nb<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>and-gate na nb c<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>inverter c output<span style="color: #909183;">)</span>
    'ok<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
This construction is simpler than the primitive and-gate constructed
above. However, its propagation times are more complex &#x2013; the formula for the
total propagation time \(t_{\mathrm{total}}\), where \(t_{x}\) is the
propagation delay due to the gate that begins the wire \(x\), is
</p>

\begin{equation*}
t_{\mathrm{total}} = \t_{output} + \t_{c} + \max{(na, nb)}
\end{equation*}

<p>
This may be a larger delay than that of the primitive or-gate if the primitive
gate can be manufactured to have a delay similar to that of the and-gate, for
example. On the other hand, if the composition of inverters and and-gates has
enough of an advantage, such as individual speed or cost, over a single
primitive or-gate or-gate for whatever reason, the composed or-gate may still
be preferable.
</p>
</div>
</div>
