ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.30][Exercise 3.30.]]

Straightforward implementation of the diagram:

#+BEGIN_SRC scheme :tangle ex-3-30.scm
  (define (ripple-carry-adder as bs ss carry)
    (let ((cs
           ;; Construct the n internal wires needed to link the full-adders
           ;; internally and verify that as, bs, and ss all have the same length.
           (let make-cs ((as as) (bs bs) (ss ss) (cs '()))
                (cond ((and (null? as) (null? bs) (null? ss)) cs)
                      ((null? as) (error "Too few bits in as"))
                      ((null? bs) (error "Too few bits in bs"))
                      ((null? ss) (error "Too few bits in ss"))
                      (else (make-cs (cdr as) (cdr bs) (cdr ss)
                                   (cons (make-wire) cs)))))))
      (let make-adder ((as as) (bs bs) (cs cs) (ss ss) (carry carry))
        (cond ((null? as) 'ok)  ; Only test `as` since all lists have same length.
            (else (full-adder (car as) (car bs) (car cs) (car ss) carry)
                  (make-adder (cdr as) (cdr bs) (cdr cs) (cdr ss) (car cs)))))))
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-3-30-test.scm
  (include "ex-3-30")
  (use test)
#+END_SRC

The delay is troublesome -- \(n \mathrm{delay}_{\mathrm{full-adder}}\).

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.31][Exercise 3.31.]]

If the procedure is merely added without executing it, the state of the circuit
can become inconsistent until the first change to the inputs is made. For
example, consider the execution of ~(half-adder a b s c)~, with ~a~ and ~b~
initially ~1~ and ~s~ and ~c~ initially ~0~. Without the argument ~proc~ being
called immediately on the call to ~accept-action-procedure!~, no calls to
~set-my-signal!~, which is the only means now to call any of the
~action-procedures~, are made, so ~s~ and ~c~ remain set to ~0~ until the first
input is set.

