ch3/ch3.html

<div id="outline-container-orgheadline43" class="outline-5">
<h5 id="orgheadline43"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.30">Exercise 3.30.</a></h5>
<div class="outline-text-5" id="text-orgheadline43">
<p>
Straightforward implementation of the diagram:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">ripple-carry-adder</span> as bs ss carry<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>cs
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">Construct the n internal wires needed to link the full-adders</span>
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">internally and verify that as, bs, and ss all have the same length.</span>
         <span style="color: #907373;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">make-cs</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>as as<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>bs bs<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>ss ss<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>cs '<span style="color: #80a880;">()</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #858580;">(</span><span style="color: #80a880;">(</span><span style="color: #a020f0;">and</span> <span style="color: #887070;">(</span>null? as<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>null? bs<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>null? ss<span style="color: #887070;">)</span><span style="color: #80a880;">)</span> cs<span style="color: #858580;">)</span>
                    <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>null? as<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>error <span style="color: #8b2252;">"Too few bits in as"</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                    <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>null? bs<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>error <span style="color: #8b2252;">"Too few bits in bs"</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                    <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>null? ss<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>error <span style="color: #8b2252;">"Too few bits in ss"</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                    <span style="color: #858580;">(</span><span style="color: #a020f0;">else</span> <span style="color: #80a880;">(</span>make-cs <span style="color: #887070;">(</span>cdr as<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>cdr bs<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>cdr ss<span style="color: #887070;">)</span>
                                 <span style="color: #887070;">(</span>cons <span style="color: #707183;">(</span>make-wire<span style="color: #707183;">)</span> cs<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">make-adder</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>as as<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>bs bs<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>cs cs<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>ss ss<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>carry carry<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>null? as<span style="color: #6276ba;">)</span> 'ok<span style="color: #907373;">)</span>  <span style="color: #b22222;">; </span><span style="color: #b22222;">Only test `as` since all lists have same length.</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span>full-adder <span style="color: #858580;">(</span>car as<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>car bs<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>car cs<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>car ss<span style="color: #858580;">)</span> carry<span style="color: #6276ba;">)</span>
                <span style="color: #6276ba;">(</span>make-adder <span style="color: #858580;">(</span>cdr as<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>cdr bs<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>cdr cs<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>cdr ss<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>car cs<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-30"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
</pre>
</div>

<p>
The delay is troublesome &#x2013; \(n \mathrm{delay}_{\mathrm{full-adder}}\).
</p>
</div>
</div>

<div id="outline-container-orgheadline44" class="outline-5">
<h5 id="orgheadline44"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.31">Exercise 3.31.</a></h5>
<div class="outline-text-5" id="text-orgheadline44">
<p>
If the procedure is merely added without executing it, the state of the circuit
can become inconsistent until the first change to the inputs is made. For
example, consider the execution of <code>(half-adder a b s c)</code>, with <code>a</code> and <code>b</code>
initially <code>1</code> and <code>s</code> and <code>c</code> initially <code>0</code>. Without the argument <code>proc</code> being
called immediately on the call to <code>accept-action-procedure!</code>, no calls to
<code>set-my-signal!</code>, which is the only means now to call any of the
<code>action-procedures</code>, are made, so <code>s</code> and <code>c</code> remain set to <code>0</code> until the first
input is set.
</p>
</div>
</div>
