ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.32][Exercise 3.32.]]

It is necessary to execute the events in the same queue (i.e., those that take
place "at the same time") in FIFO order because it is in fact the case that the
and-gate observes the change to ~a1~ while it is scheduling ~a2~.

#+NAME: FIFO-agenda
#+BEGIN_SRC scheme
  (define agenda
    '((0 ((lambda () (set-a1! 0))
          (lambda () (set-a2! 1))))
      ;; Stable value of and-gate output after initialization.
      (5 ((lambda () (assert-output 0))))
      ;; Change a1 and a2 simultaneously.
      (10 ((lambda () (set-a1! 1))
           (lambda () (set-a2! 0))))
      (13 ((lambda ()
             ;; Lexical capture of new-value at t = 10 after setting just a1.
             (set-output! 1))
           (lambda ()
             ;; Lexical capture of new-value at t = 10 after setting a1 followed
             ;; by a2.
             (set-output! 0))))))
#+END_SRC

#+NAME: LIFO-agenda
#+BEGIN_SRC scheme
  (define agenda
    '((0 ((lambda () (set-a1! 0))
          (lambda () (set-a2! 1))))
      ;; Stable value of and-gate output after initialization.
      (5 ((lambda () (assert-output 0))))
      ;; Change a1 and a2 simultaneously.
      (10 ((lambda () (set-a1! 1))
           (lambda () (set-a2! 0))))
      (13 ((lambda ()
             ;; Lexical capture of new-value at t = 10 after setting a1 followed
             ;; by a2.
             (set-output! 0))
           (lambda ()
             ;; Lexical capture of new-value at t = 10 after setting just a1.
             ;; THIS IS THE INCORRECT RESULT.
             (set-output! 1))))))
#+END_SRC

