ch3/ch3.html

<div id="outline-container-orgheadline45" class="outline-5">
<h5 id="orgheadline45"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.32">Exercise 3.32.</a></h5>
<div class="outline-text-5" id="text-orgheadline45">
<p>
It is necessary to execute the events in the same queue (i.e., those that take
place "at the same time") in FIFO order because it is in fact the case that the
and-gate observes the change to <code>a1</code> while it is scheduling <code>a2</code>.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock4"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">agenda</span>
  '<span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>0 <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">()</span> <span style="color: #6276ba;">(</span>set-a1! 0<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">()</span> <span style="color: #6276ba;">(</span>set-a2! 1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">Stable value of and-gate output after initialization.</span>
    <span style="color: #909183;">(</span>5 <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">()</span> <span style="color: #6276ba;">(</span>assert-output 0<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">Change a1 and a2 simultaneously.</span>
    <span style="color: #909183;">(</span>10 <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">()</span> <span style="color: #6276ba;">(</span>set-a1! 1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
         <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">()</span> <span style="color: #6276ba;">(</span>set-a2! 0<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>13 <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">()</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">Lexical capture of new-value at t = 10 after setting just a1.</span>
           <span style="color: #6276ba;">(</span>set-output! 1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
         <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">()</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">Lexical capture of new-value at t = 10 after setting a1 followed</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">by a2.</span>
           <span style="color: #6276ba;">(</span>set-output! 0<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock5"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">agenda</span>
  '<span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>0 <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">()</span> <span style="color: #6276ba;">(</span>set-a1! 0<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">()</span> <span style="color: #6276ba;">(</span>set-a2! 1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">Stable value of and-gate output after initialization.</span>
    <span style="color: #909183;">(</span>5 <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">()</span> <span style="color: #6276ba;">(</span>assert-output 0<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">Change a1 and a2 simultaneously.</span>
    <span style="color: #909183;">(</span>10 <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">()</span> <span style="color: #6276ba;">(</span>set-a1! 1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
         <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">()</span> <span style="color: #6276ba;">(</span>set-a2! 0<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>13 <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">()</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">Lexical capture of new-value at t = 10 after setting a1 followed</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">by a2.</span>
           <span style="color: #6276ba;">(</span>set-output! 0<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
         <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">()</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">Lexical capture of new-value at t = 10 after setting just a1.</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">THIS IS THE INCORRECT RESULT.</span>
           <span style="color: #6276ba;">(</span>set-output! 1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
