ch3/ch3.html

<div id="outline-container-orgheadline46" class="outline-4">
<h4 id="orgheadline46"><span class="done DONE">DONE</span> 3.3.5: <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_sec_3.3.4">Propagation of Constraints</a></h4>
<div class="outline-text-4" id="text-orgheadline46">
<p>
Implementation of constraint objects from book. Includes the primitive
procedures
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #b22222;">;;; </span><span style="color: #b22222;">Primitive connector construction</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-connector</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>value #f<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>informant #f<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>constraints '<span style="color: #907373;">()</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">set-my-value</span> newval setter<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>not <span style="color: #858580;">(</span>has-value? me<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span><span style="color: #a020f0;">set!</span> value newval<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span><span style="color: #a020f0;">set!</span> informant setter<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>for-each-except setter
                              inform-about-value
                              constraints<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>not <span style="color: #858580;">(</span>= value newval<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>error <span style="color: #8b2252;">"Contradiction"</span> <span style="color: #858580;">(</span>list value newval<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> 'ignored<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">forget-my-value</span> retractor<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> <span style="color: #907373;">(</span>eq? retractor informant<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">begin</span> <span style="color: #6276ba;">(</span><span style="color: #a020f0;">set!</span> informant #f<span style="color: #6276ba;">)</span>
                 <span style="color: #6276ba;">(</span>for-each-except retractor
                                  inform-about-no-value
                                  constraints<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          'ignored<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">connect</span> new-constraint<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> <span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>memq new-constraint constraints<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">set!</span> constraints
                <span style="color: #6276ba;">(</span>cons new-constraint constraints<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> <span style="color: #907373;">(</span>has-value? me<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>inform-about-value new-constraint<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      'done<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">me</span> request<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? request 'has-value?<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span><span style="color: #a020f0;">if</span> informant #t #f<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? request 'value<span style="color: #6276ba;">)</span> value<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? request 'set-value!<span style="color: #6276ba;">)</span> set-my-value<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? request 'forget<span style="color: #6276ba;">)</span> forget-my-value<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? request 'connect<span style="color: #6276ba;">)</span> connect<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span>error <span style="color: #8b2252;">"Unknown operation -- CONNECTOR"</span>
                         request<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    me<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Convenience procedures for make-connector.</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">for-each-except</span> exception procedure list<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">loop</span> items<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>null? items<span style="color: #907373;">)</span> 'done<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? <span style="color: #6276ba;">(</span>car items<span style="color: #6276ba;">)</span> exception<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>loop <span style="color: #6276ba;">(</span>cdr items<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span> <span style="color: #907373;">(</span>procedure <span style="color: #6276ba;">(</span>car items<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                <span style="color: #907373;">(</span>loop <span style="color: #6276ba;">(</span>cdr items<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>loop list<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">has-value?</span> connector<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>connector 'has-value?<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">get-value</span> connector<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>connector 'value<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">set-value!</span> connector new-value informant<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>connector 'set-value!<span style="color: #909183;">)</span> new-value informant<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">forget-value!</span> connector retractor<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>connector 'forget<span style="color: #909183;">)</span> retractor<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">connect</span> connector new-constraint<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>connector 'connect<span style="color: #909183;">)</span> new-constraint<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">inform-about-value</span> constraint<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>constraint 'I-have-a-value<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">inform-about-no-value</span> constraint<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>constraint 'I-lost-my-value<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
and some commonly used constraints, implemented in terms of the primitives:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"constraint-primitive"</span><span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Adder constraint between summands and sum</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">adder</span> a1 a2 sum<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">process-new-value</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">and</span> <span style="color: #6276ba;">(</span>has-value? a1<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>has-value? a2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>set-value! sum
                       <span style="color: #6276ba;">(</span>+ <span style="color: #858580;">(</span>get-value a1<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>get-value a2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                       me<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">and</span> <span style="color: #6276ba;">(</span>has-value? a1<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>has-value? sum<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>set-value! a2
                       <span style="color: #6276ba;">(</span>- <span style="color: #858580;">(</span>get-value sum<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>get-value a1<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                       me<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">and</span> <span style="color: #6276ba;">(</span>has-value? a2<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>has-value? sum<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>set-value! a1
                       <span style="color: #6276ba;">(</span>- <span style="color: #858580;">(</span>get-value sum<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>get-value a2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                       me<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">process-forget-value</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>forget-value! sum me<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>forget-value! a1 me<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>forget-value! a2 me<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>process-new-value<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">me</span> request<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? request 'I-have-a-value<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>process-new-value<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? request 'I-lost-my-value<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>process-forget-value<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span>
           <span style="color: #907373;">(</span>error <span style="color: #8b2252;">"Unknown request -- ADDER"</span> request<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>connect a1 me<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>connect a2 me<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>connect sum me<span style="color: #7388d6;">)</span>
  me<span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Multiplier constraint between multiplicands and product.</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">multiplier</span> m1 m2 product<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">process-new-value</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">or</span> <span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>has-value? m1<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>= <span style="color: #80a880;">(</span>get-value m1<span style="color: #80a880;">)</span> 0<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
               <span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>has-value? m2<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>= <span style="color: #80a880;">(</span>get-value m2<span style="color: #80a880;">)</span> 0<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>set-value! product 0 me<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">and</span> <span style="color: #6276ba;">(</span>has-value? m1<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>has-value? m2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>set-value! product
                       <span style="color: #6276ba;">(</span>* <span style="color: #858580;">(</span>get-value m1<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>get-value m2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                       me<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">and</span> <span style="color: #6276ba;">(</span>has-value? product<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>has-value? m1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>set-value! m2
                       <span style="color: #6276ba;">(</span>/ <span style="color: #858580;">(</span>get-value product<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>get-value m1<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                       me<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">and</span> <span style="color: #6276ba;">(</span>has-value? product<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>has-value? m2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>set-value! m1
                       <span style="color: #6276ba;">(</span>/ <span style="color: #858580;">(</span>get-value product<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>get-value m2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                       me<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">process-forget-value</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>forget-value! product me<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>forget-value! m1 me<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>forget-value! m2 me<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>process-new-value<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">me</span> request<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? request 'I-have-a-value<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>process-new-value<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? request 'I-lost-my-value<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>process-forget-value<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span>
           <span style="color: #907373;">(</span>error <span style="color: #8b2252;">"Unknown request -- MULTIPLIER"</span> request<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>connect m1 me<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>connect m2 me<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>connect product me<span style="color: #7388d6;">)</span>
  me<span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Constrain connector to a constant</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">constant</span> value connector<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">me</span> request<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>error <span style="color: #8b2252;">"Unknown request -- CONSTANT"</span> request<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>connect connector me<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>set-value! connector value me<span style="color: #7388d6;">)</span>
  me<span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Print a message about setting or unsetting of a connector (e.g., for</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">testing).</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">probe</span> name connector<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">print-probe</span> value<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>display <span style="color: #8b2252;">"Probe: "</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>display name<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>display <span style="color: #8b2252;">" = "</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>display value<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>newline<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">process-new-value</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>print-probe <span style="color: #709870;">(</span>get-value connector<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">process-forget-value</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>print-probe <span style="color: #8b2252;">"?"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">me</span> request<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? request 'I-have-a-value<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>process-new-value<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? request 'I-lost-my-value<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>process-forget-value<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span>
           <span style="color: #907373;">(</span>error <span style="color: #8b2252;">"Unknown request -- PROBE"</span> request<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>connect connector me<span style="color: #7388d6;">)</span>
  me<span style="color: #707183;">)</span>
</pre>
</div>
</div>
