ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.33][Exercise 3.33.]]

#+BEGIN_SRC scheme :tangle ex-3-33.scm
  (define (averager a b c)
    (let ((half (make-connector))
          (sum (make-connector)))
      (constant 0.5 half)
      (adder a b sum)
      (multiplier half sum c)
      'ok))
#+END_SRC

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.34][Exercise 3.34.]]

The procedure suggested by Louis won't work when propagation from the
product to the multiplicands is needed. ~multiplier~ needs at least two of
~m1~, ~m2~, and ~product~ to be set in order to propagate the constraint from
the set values to the unset value. However, if one of the multiplicands is
unset, both are, a situation that ~multiplier~ can't handle.

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.35][Exercise 3.35.]]

Straightforward implementation based on ~multiplier~:

#+BEGIN_SRC scheme :tangle ex-3-35.scm
  (define (squarer a b)
    (define (process-new-value)
      (if (has-value? b)
          (if (< (get-value b) 0)
              (error "square less than 0 -- SQUARER" (get-value b))
              (set-value! a (sqrt b)))
          (let ((aval (get-value a)))
            (set-value! b (* aval aval))))
    (define (process-forget-value)
      (forget-value! b me)
      (forget-value! a me)
      (process-new-value))
    (define (me request)
      (cond ((eq? request 'I-have-a-value)
             (process-new-value))
            ((eq? request 'I-lost-my-value)
             (process-forget-value))
            (else
             (error "Unknown request -- SQUARER" request))))
    (connect a me)
    (connect b me)
    me)
#+END_SRC

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.36][Exercise 3.36.]]

Do in class.

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%25_thm_3.37][Exercise 3.37.]]

The expression-oriented constraint adder is defined thus in the book:

#+NAME: constraint-adder-expression
#+BEGIN_SRC scheme
  (define (c+ x y)
    (let ((z (make-connector)))
      (adder x y z)
      z))
#+END_SRC

We define similar procedures for subtraction, multiplication, division, and
constant values:

#+BEGIN_SRC scheme :tangle ex-3-37.scm
  (include "constraint-common")

  <<constraint-adder-expression>>

  ;;; Constant
  (define (cv x)
    (let ((z (make-connector)))
      (constant x z)
      z))

  ;;; Subtraction
  (define (c- x y)
    ;; $x - y = z \Rightarrow x = y + z$ to avoid having to introduce an
    ;; additional multiplier and constant constraint.
    (let ((z (make-connector)))
      (adder y z x)
      z))

  ;;; Multiplication
  (define (c* x y)
    (let ((z (make-connector)))
      (multiplier x y z)
      z))

  ;;; Division
  (define (c/ x y)
    ;; $x / y = z \Rightarrow x = y * z$ to avoid having to implement division as
    ;; a primitive constraint. Pray that $y \neq 0$.
    (let ((z (make-connector)))
      (multiplier y z x)
      z))
#+END_SRC


** TODO 3.4: Concurrency: Time Is of the Essence

