ch3/ch3.html

<div id="outline-container-orgheadline47" class="outline-5">
<h5 id="orgheadline47"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.33">Exercise 3.33.</a></h5>
<div class="outline-text-5" id="text-orgheadline47">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">averager</span> a b c<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>half <span style="color: #907373;">(</span>make-connector<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>sum <span style="color: #907373;">(</span>make-connector<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>constant 0.5 half<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>adder a b sum<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>multiplier half sum c<span style="color: #909183;">)</span>
    'ok<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline48" class="outline-5">
<h5 id="orgheadline48"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.34">Exercise 3.34.</a></h5>
<div class="outline-text-5" id="text-orgheadline48">
<p>
The procedure suggested by Louis won't work when propagation from the
product to the multiplicands is needed. <code>multiplier</code> needs at least two of
<code>m1</code>, <code>m2</code>, and <code>product</code> to be set in order to propagate the constraint from
the set values to the unset value. However, if one of the multiplicands is
unset, both are, a situation that <code>multiplier</code> can't handle.
</p>
</div>
</div>

<div id="outline-container-orgheadline49" class="outline-5">
<h5 id="orgheadline49"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.35">Exercise 3.35.</a></h5>
<div class="outline-text-5" id="text-orgheadline49">
<p>
Straightforward implementation based on <code>multiplier</code>:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">squarer</span> a b<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">process-new-value</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>has-value? b<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> <span style="color: #907373;">(</span>&lt; <span style="color: #6276ba;">(</span>get-value b<span style="color: #6276ba;">)</span> 0<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span>error <span style="color: #8b2252;">"square less than 0 -- SQUARER"</span> <span style="color: #6276ba;">(</span>get-value b<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span>set-value! a <span style="color: #6276ba;">(</span>sqrt b<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>aval <span style="color: #858580;">(</span>get-value a<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>set-value! b <span style="color: #6276ba;">(</span>* aval aval<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
  <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">process-forget-value</span><span style="color: #709870;">)</span>
    <span style="color: #709870;">(</span>forget-value! b me<span style="color: #709870;">)</span>
    <span style="color: #709870;">(</span>forget-value! a me<span style="color: #709870;">)</span>
    <span style="color: #709870;">(</span>process-new-value<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
  <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">me</span> request<span style="color: #709870;">)</span>
    <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? request 'I-have-a-value<span style="color: #6276ba;">)</span>
           <span style="color: #6276ba;">(</span>process-new-value<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? request 'I-lost-my-value<span style="color: #6276ba;">)</span>
           <span style="color: #6276ba;">(</span>process-forget-value<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span>
           <span style="color: #6276ba;">(</span>error <span style="color: #8b2252;">"Unknown request -- SQUARER"</span> request<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
  <span style="color: #909183;">(</span>connect a me<span style="color: #909183;">)</span>
  <span style="color: #909183;">(</span>connect b me<span style="color: #909183;">)</span>
  me<span style="color: #7388d6;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline50" class="outline-5">
<h5 id="orgheadline50"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.36">Exercise 3.36.</a></h5>
<div class="outline-text-5" id="text-orgheadline50">
<p>
Do in class.
</p>
</div>
</div>

<div id="outline-container-orgheadline51" class="outline-5">
<h5 id="orgheadline51"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-22.html#%_thm_3.37">Exercise 3.37.</a></h5>
<div class="outline-text-5" id="text-orgheadline51">
<p>
The expression-oriented constraint adder is defined thus in the book:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock6"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">c+</span> x y<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>z <span style="color: #907373;">(</span>make-connector<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>adder x y z<span style="color: #909183;">)</span>
    z<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
We define similar procedures for subtraction, multiplication, division, and
constant values:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"constraint-common"</span><span style="color: #707183;">)</span>

<span style="color: #228b22;">&lt;&lt;constraint-adder-expression&gt;&gt;</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Constant</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cv</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>z <span style="color: #907373;">(</span>make-connector<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>constant x z<span style="color: #909183;">)</span>
    z<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Subtraction</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">c-</span> x y<span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">$x - y = z \Rightarrow x = y + z$ to avoid having to introduce an</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">additional multiplier and constant constraint.</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>z <span style="color: #907373;">(</span>make-connector<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>adder y z x<span style="color: #909183;">)</span>
    z<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Multiplication</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">c*</span> x y<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>z <span style="color: #907373;">(</span>make-connector<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>multiplier x y z<span style="color: #909183;">)</span>
    z<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Division</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">c/</span> x y<span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">$x / y = z \Rightarrow x = y * z$ to avoid having to implement division as</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">a primitive constraint. Pray that $y \neq 0$.</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>z <span style="color: #907373;">(</span>make-connector<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>multiplier y z x<span style="color: #909183;">)</span>
    z<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline68" class="outline-3">
<h3 id="orgheadline68"><span class="todo TODO">TODO</span> 3.4: Concurrency: Time Is of the Essence</h3>
