ch3/ch3.org
*** DONE Read Section 3.4
    SCHEDULED: <2014-11-22 Sat>
    - State "DONE"       from "STARTED"    [2014-11-22 Sat 15:07]
    CLOCK: [2014-11-22 Sat 14:43]--[2014-11-22 Sat 15:07] =>  0:24
    - State "STARTED"    from "TODO"       [2014-11-22 Sat 14:42]
    [2014-11-22 Sat]

*** TODO 3.4.1: The Nature of Time in Concurrent Systems

Complexity of concurrent systems comes from:

- Dependence of ordering of events in a system with mutation.
- Reduced ability to control ordering of events, and difficulty in mentally
  taking this into account.

Concurrency models:

- No two operations on any shared state variable can occur at the same
  time. Too strict for most uses (for example, implies that only one
  transaction can occur at a time in a bank system).
- System must proceed as if events had been executed sequentially in /some/
  order (not guaranteed what order is used).
  - There can still be more than one "correct" answer -- may need to restrict
    some parts of the program further depending on requirements.

   CLOCK: [2014-11-22 Sat 16:42]--[2014-11-22 Sat 17:09] =>  0:27
   - State "STARTED"    from "STARTED"    [2014-11-22 Sat 16:41] \\
   - State "STARTED"    from "TODO"       [2014-11-22 Sat 14:26]
     Want SRFI-18 to support concurrency.
   :PROPERTIES:
   :Effort:   0:30
   :END:
   [2014-11-22 Sat]

**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%25_thm_3.38][Exercise 3.38.]]

a. There are 6 combinations of Peter (A), Paul (B), and Mary (C):

   | Order     | Final amount |
   |-----------+--------------|
   | (A, B, C) |           45 |
   | (A, C, B) |           35 |
   | (B, A, C) |           45 |
   | (B, C, A) |           50 |
   | (C, A, B) |           40 |
   | (C, B, A) |           40 |

b. For transactions A and B, there are 3 steps:

   - Read the current balance from the shared account [Xr].
   - Perform the calculation.
   - Write the new balance to the shared account [Xw].

   However, transaction C reads the shared variable ~balance~ twice, so there
   are 5 steps:

   - Read the current balance from the shared account [Cr1].
   - Perform the division.
   - Read the current balance from the shared account [Cr2].
   - Perform the subtraction.
   - Write the new balance to the shared account [Cw].

   The calculations don't modify a shared variable, so the relevant
   combinations for each transaction are combinations of Ar, Aw, Br, Bw, Cr1,
   Cr2, and Cw, with the constraint that \(t(Ar) \leq t(Aw)\),
   \(t(Br) \leq t(Bw)\), and \(t(Cr1) \leq t(Cr2) \leq t(Cw)\) or
   \(t(Cr2) \leq t(Cr1) \leq t(Cw)\).

*** TODO 3.4.2: Mechanisms for Controlling Concurrency

There are too many possible orderings of concurrent processes to ensure a
single answer or to analyze in many cases.

Serializer:
- Ensures that only one procedure under the control of the serializer can be
  executed at a time.
- Example: In the below, ~foo~ and ~bar~ are guaranteed to not execute at the
  same time (i.e., their execution is /serialized/).

  #+BEGIN_SRC scheme
    (define s (make-serializer))
    (parallel-execute (s (foo))
                      (s (bar)))
  #+END_SRC

- Implemented in terms of /mutexes/.
- Mutex implemented as a spin lock using a test-and-set instruction.

Here's an implementation of the threading tools ~parallel-execute~ and
~make-serializer~ using SRFI-18 mutexes and threads:

#+BEGIN_SRC scheme :tangle concurrency.scm
  (use srfi-18)

  (define (make-serializer)
    (let ((mutex (make-mutex)))
      (lambda (p)
        (define (serialized-p . args)
          (mutex-lock! mutex)
          (let ((val (apply p args)))
            (mutex-unlock! mutex)
            val))
        serialized-p)))

  (define (parallel-execute . fs)
    (let ((ts (map make-thread fs)))
      (for-each thread-start! ts)
      (for-each thread-join! ts)
      '()))
#+END_SRC

   - State "HOLD"       from "STARTED"    [2014-12-10 Wed 19:54] \\
     Do at some point
   CLOCK: [2014-12-07 Sun 23:25]--[2014-12-07 Sun 23:48] =>  0:23
   - State "STARTED"    from "STARTED"    [2014-11-22 Sat 17:31] \\
     Implemented those two functions.
   CLOCK: [2014-11-22 Sat 17:11]--[2014-11-22 Sat 17:30] =>  0:19
   - State "STARTED"    from "TODO"       [2014-11-22 Sat 17:11]
   Need to implement ~make-serializer~ and perhaps ~parallel-execute~.
   :PROPERTIES:
   :Effort:   3:00
   :END:
   [2014-11-22 Sat]

**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%25_thm_3.39][Exercise 3.39.]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%25_thm_3.40][Exercise 3.40.]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%25_thm_3.41][Exercise 3.41.]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%25_thm_3.42][Exercise 3.42.]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%25_thm_3.43][Exercise 3.43.]]
