ch3/ch3.html
<div class="outline-text-3" id="text-orgheadline68">
</div><div id="outline-container-orgheadline53" class="outline-4">
<h4 id="orgheadline53"><span class="done DONE">DONE</span> Read Section 3.4</h4>
<div class="outline-text-4" id="text-orgheadline53">
<ul class="org-ul">
<li>State "DONE"       from "STARTED"    <span class="timestamp-wrapper"><span class="timestamp">[2014-11-22 Sat 15:07]</span></span></li>
</ul>
<ul class="org-ul">
<li>State "STARTED"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2014-11-22 Sat 14:42]</span></span></li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2014-11-22 Sat]</span></span>
</p>
</div>
</div>

<div id="outline-container-orgheadline54" class="outline-4">
<h4 id="orgheadline54"><span class="todo TODO">TODO</span> 3.4.1: The Nature of Time in Concurrent Systems</h4>
<div class="outline-text-4" id="text-orgheadline54">
<p>
Complexity of concurrent systems comes from:
</p>

<ul class="org-ul">
<li>Dependence of ordering of events in a system with mutation.</li>
<li>Reduced ability to control ordering of events, and difficulty in mentally
taking this into account.</li>
</ul>

<p>
Concurrency models:
</p>

<ul class="org-ul">
<li>No two operations on any shared state variable can occur at the same
time. Too strict for most uses (for example, implies that only one
transaction can occur at a time in a bank system).</li>
<li>System must proceed as if events had been executed sequentially in <i>some</i>
  order (not guaranteed what order is used).
<ul class="org-ul">
<li><p>
There can still be more than one "correct" answer &#x2013; may need to restrict
some parts of the program further depending on requirements.
</p>

<ul class="org-ul">
<li>State "STARTED"    from "STARTED"    <span class="timestamp-wrapper"><span class="timestamp">[2014-11-22 Sat 16:41] </span></span> <br  /></li>
<li>State "STARTED"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2014-11-22 Sat 14:26]</span></span>
     Want SRFI-18 to support concurrency.</li>
</ul>
<p>
:Effort:   0:30
</p>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2014-11-22 Sat]</span></span>
</p></li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgheadline55" class="outline-5">
<h5 id="orgheadline55"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%_thm_3.38">Exercise 3.38.</a></h5>
<div class="outline-text-5" id="text-orgheadline55">
<ol class="org-ol">
<li><p>
There are 6 combinations of Peter (A), Paul (B), and Mary (C):
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Order</th>
<th scope="col" class="org-right">Final amount</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">(A, B, C)</td>
<td class="org-right">45</td>
</tr>

<tr>
<td class="org-left">(A, C, B)</td>
<td class="org-right">35</td>
</tr>

<tr>
<td class="org-left">(B, A, C)</td>
<td class="org-right">45</td>
</tr>

<tr>
<td class="org-left">(B, C, A)</td>
<td class="org-right">50</td>
</tr>

<tr>
<td class="org-left">(C, A, B)</td>
<td class="org-right">40</td>
</tr>

<tr>
<td class="org-left">(C, B, A)</td>
<td class="org-right">40</td>
</tr>
</tbody>
</table></li>

<li><p>
For transactions A and B, there are 3 steps:
</p>

<ul class="org-ul">
<li>Read the current balance from the shared account [Xr].</li>
<li>Perform the calculation.</li>
<li>Write the new balance to the shared account [Xw].</li>
</ul>
<p>
However, transaction C reads the shared variable <code>balance</code> twice, so there
are 5 steps:
</p>

<ul class="org-ul">
<li>Read the current balance from the shared account [Cr1].</li>
<li>Perform the division.</li>
<li>Read the current balance from the shared account [Cr2].</li>
<li>Perform the subtraction.</li>
<li>Write the new balance to the shared account [Cw].</li>
</ul>
<p>
The calculations don't modify a shared variable, so the relevant
combinations for each transaction are combinations of Ar, Aw, Br, Bw, Cr1,
Cr2, and Cw, with the constraint that \(t(Ar) \leq t(Aw)\),
\(t(Br) \leq t(Bw)\), and \(t(Cr1) \leq t(Cr2) \leq t(Cw)\) or
\(t(Cr2) \leq t(Cr1) \leq t(Cw)\).
</p></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgheadline56" class="outline-4">
<h4 id="orgheadline56"><span class="todo TODO">TODO</span> 3.4.2: Mechanisms for Controlling Concurrency</h4>
<div class="outline-text-4" id="text-orgheadline56">
<p>
There are too many possible orderings of concurrent processes to ensure a
single answer or to analyze in many cases.
</p>

<p>
Serializer:
</p>
<ul class="org-ul">
<li>Ensures that only one procedure under the control of the serializer can be
executed at a time.</li>
<li><p>
Example: In the below, <code>foo</code> and <code>bar</code> are guaranteed to not execute at the
same time (i.e., their execution is <i>serialized</i>).
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">s</span> <span style="color: #7388d6;">(</span>make-serializer<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>parallel-execute <span style="color: #7388d6;">(</span>s <span style="color: #909183;">(</span>foo<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
                  <span style="color: #7388d6;">(</span>s <span style="color: #909183;">(</span>bar<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>

<li>Implemented in terms of <i>mutexes</i>.</li>
<li>Mutex implemented as a spin lock using a test-and-set instruction.</li>
</ul>

<p>
Here's an implementation of the threading tools <code>parallel-execute</code> and
<code>make-serializer</code> using SRFI-18 mutexes and threads:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> srfi-18<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-serializer</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>mutex <span style="color: #907373;">(</span>make-mutex<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>p<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">define</span> <span style="color: #907373;">(</span><span style="color: #0000ff;">serialized-p</span> . args<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>mutex-lock! mutex<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #a020f0;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>val <span style="color: #80a880;">(</span>apply p args<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span>mutex-unlock! mutex<span style="color: #6276ba;">)</span>
          val<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      serialized-p<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">parallel-execute</span> . fs<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>ts <span style="color: #907373;">(</span><span style="color: #a020f0;">map</span> make-thread fs<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">for-each</span> thread-start! ts<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">for-each</span> thread-join! ts<span style="color: #909183;">)</span>
    '<span style="color: #909183;">()</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>State "HOLD"       from "STARTED"    <span class="timestamp-wrapper"><span class="timestamp">[2014-12-10 Wed 19:54] </span></span> <br  />
Do at some point</li>
</ul>
<ul class="org-ul">
<li>State "STARTED"    from "STARTED"    <span class="timestamp-wrapper"><span class="timestamp">[2014-11-22 Sat 17:31] </span></span> <br  />
Implemented those two functions.</li>
</ul>
<ul class="org-ul">
<li>State "STARTED"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2014-11-22 Sat 17:11]</span></span></li>
</ul>
<p>
Need to implement <code>make-serializer</code> and perhaps <code>parallel-execute</code>.
</p>
<p>
:Effort:   3:00
</p>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2014-11-22 Sat]</span></span>
</p>
</div>

<div id="outline-container-orgheadline57" class="outline-5">
<h5 id="orgheadline57"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%_thm_3.39">Exercise 3.39.</a></h5>
</div>
<div id="outline-container-orgheadline58" class="outline-5">
<h5 id="orgheadline58"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%_thm_3.40">Exercise 3.40.</a></h5>
</div>
<div id="outline-container-orgheadline59" class="outline-5">
<h5 id="orgheadline59"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%_thm_3.41">Exercise 3.41.</a></h5>
</div>
<div id="outline-container-orgheadline60" class="outline-5">
<h5 id="orgheadline60"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%_thm_3.42">Exercise 3.42.</a></h5>
</div>
<div id="outline-container-orgheadline61" class="outline-5">
<h5 id="orgheadline61"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%_thm_3.43">Exercise 3.43.</a></h5>
</div>
