ch3/ch3.org
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%25_thm_3.44][Exercise 3.44.]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%25_thm_3.45][Exercise 3.45.]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%25_thm_3.46][Exercise 3.46.]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%25_thm_3.47][Exercise 3.47.]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%25_thm_3.48][Exercise 3.48.]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%25_thm_3.49][Exercise 3.49.]]

** TODO 3.5: Streams

Basic stream procedures used throughout the section.

#+BEGIN_SRC scheme :tangle stream.scm
  <<stream-primitives>>
  <<stream-fold>>

  (define (stream-ref s n)
    (if (= n 0)
        (stream-car s)
        (stream-ref (stream-cdr s) (- n 1))))
  <<stream-map-poly>>
  (define (stream-for-each proc s)
    (if (stream-null? s)
        'done
        (begin (proc (stream-car s))
               (stream-for-each proc (stream-cdr s)))))
  (define (stream-filter proc s)
    (cond ((stream-null? s) the-empty-stream)
          ((proc (stream-car s))
           (cons-stream (stream-car s)
                        (stream-filter proc (stream-cdr s))))
          (else
           (stream-filter proc (stream-cdr s)))))
  (define (display-line x)
    (newline)
    (display x))
  (define (display-stream s)
    (stream-for-each display-line s))
  (define (stream-enumerate-interval low high)
    (if (> low high)
        the-empty-stream
        (cons-stream
         low
         (stream-enumerate-interval (+ low 1) high))))
#+END_SRC

We start with the primitive procedures on the stream data type:

#+NAME: stream-primitives
#+BEGIN_SRC scheme
  (define the-empty-stream 'the-empty-stream)
  (define (stream-null? s) (eq? s the-empty-stream))
  (define-syntax cons-stream
    (syntax-rules ()
      ((cons-stream a b)
       (cons a (delay b)))))
  (define (stream-car stream) (car stream))
  (define (stream-cdr stream) (force (cdr stream)))
#+END_SRC

Another very useful and generally-applicable stream function is ~fold~. In
fact, both ~map~ and ~filter~ can be implemented in terms of ~fold~:

#+NAME: stream-fold
#+BEGIN_SRC scheme
  (define (stream-fold kons knil . streams)
    (if (or (map stream-null? streams))
        knil
        (cons-stream (apply kons (append (map stream-car streams)
                                         knil))
                     (apply stream-fold kons knil (map stream-cdr streams)))))
#+END_SRC

*** DONE 3.5.1: Streams Are Delayed Lists
