ch3/ch3.html
<div id="outline-container-orgheadline62" class="outline-5">
<h5 id="orgheadline62"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%_thm_3.44">Exercise 3.44.</a></h5>
</div>
<div id="outline-container-orgheadline63" class="outline-5">
<h5 id="orgheadline63"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%_thm_3.45">Exercise 3.45.</a></h5>
</div>
<div id="outline-container-orgheadline64" class="outline-5">
<h5 id="orgheadline64"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%_thm_3.46">Exercise 3.46.</a></h5>
</div>
<div id="outline-container-orgheadline65" class="outline-5">
<h5 id="orgheadline65"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%_thm_3.47">Exercise 3.47.</a></h5>
</div>
<div id="outline-container-orgheadline66" class="outline-5">
<h5 id="orgheadline66"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%_thm_3.48">Exercise 3.48.</a></h5>
</div>
<div id="outline-container-orgheadline67" class="outline-5">
<h5 id="orgheadline67"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-23.html#%_thm_3.49">Exercise 3.49.</a></h5>
</div>
</div>
</div>

<div id="outline-container-orgheadline69" class="outline-3">
<h3 id="orgheadline69"><span class="todo TODO">TODO</span> 3.5: Streams</h3>
<div class="outline-text-3" id="text-orgheadline69">
<p>
Basic stream procedures used throughout the section.
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #228b22;">&lt;&lt;stream-primitives&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;stream-fold&gt;&gt;</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">stream-ref</span> s n<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>= n 0<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>stream-car s<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>stream-ref <span style="color: #709870;">(</span>stream-cdr s<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>- n 1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #228b22;">&lt;&lt;stream-map-poly&gt;&gt;</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">stream-for-each</span> proc s<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>stream-null? s<span style="color: #909183;">)</span>
      'done
      <span style="color: #909183;">(</span><span style="color: #a020f0;">begin</span> <span style="color: #709870;">(</span>proc <span style="color: #907373;">(</span>stream-car s<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
             <span style="color: #709870;">(</span>stream-for-each proc <span style="color: #907373;">(</span>stream-cdr s<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">stream-filter</span> proc s<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>stream-null? s<span style="color: #709870;">)</span> the-empty-stream<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>proc <span style="color: #907373;">(</span>stream-car s<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>cons-stream <span style="color: #907373;">(</span>stream-car s<span style="color: #907373;">)</span>
                      <span style="color: #907373;">(</span>stream-filter proc <span style="color: #6276ba;">(</span>stream-cdr s<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span>
         <span style="color: #709870;">(</span>stream-filter proc <span style="color: #907373;">(</span>stream-cdr s<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">display-line</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>newline<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>display x<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">display-stream</span> s<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>stream-for-each display-line s<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">stream-enumerate-interval</span> low high<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>&gt; low high<span style="color: #909183;">)</span>
      the-empty-stream
      <span style="color: #909183;">(</span>cons-stream
       low
       <span style="color: #709870;">(</span>stream-enumerate-interval <span style="color: #907373;">(</span>+ low 1<span style="color: #907373;">)</span> high<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
We start with the primitive procedures on the stream data type:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock7"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">the-empty-stream</span> 'the-empty-stream<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">stream-null?</span> s<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>eq? s the-empty-stream<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">cons-stream</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">syntax-rules</span> <span style="color: #909183;">()</span>
    <span style="color: #909183;">(</span><span style="color: #709870;">(</span>cons-stream a b<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>cons a <span style="color: #907373;">(</span><span style="color: #a020f0;">delay</span> b<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">stream-car</span> stream<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>car stream<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">stream-cdr</span> stream<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span><span style="color: #a020f0;">force</span> <span style="color: #909183;">(</span>cdr stream<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Another very useful and generally-applicable stream function is <code>fold</code>. In
fact, both <code>map</code> and <code>filter</code> can be implemented in terms of <code>fold</code>:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock8"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">stream-fold</span> kons knil . streams<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span><span style="color: #a020f0;">or</span> <span style="color: #709870;">(</span><span style="color: #a020f0;">map</span> stream-null? streams<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      knil
      <span style="color: #909183;">(</span>cons-stream <span style="color: #709870;">(</span>apply kons <span style="color: #907373;">(</span>append <span style="color: #6276ba;">(</span><span style="color: #a020f0;">map</span> stream-car streams<span style="color: #6276ba;">)</span>
                                       knil<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                   <span style="color: #709870;">(</span>apply stream-fold kons knil <span style="color: #907373;">(</span><span style="color: #a020f0;">map</span> stream-cdr streams<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>

<div id="outline-container-orgheadline73" class="outline-4">
<h4 id="orgheadline73"><span class="done DONE">DONE</span> 3.5.1: Streams Are Delayed Lists</h4>
