ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.50][Exercise 3.50.]]

The ~apply~ procedure can be used to call a function with arguments drawn from
a list, and we can iterate along the argument streams in turn (which are all
assumed to be of the same length):

#+NAME: stream-map-poly
#+BEGIN_SRC scheme :tangle ex-3-50.scm
  (define (stream-map proc . argstreams)
    (if (stream-null? (car argstreams))
        the-empty-stream
        (cons-stream
         (apply proc (map stream-car argstreams))
         (apply stream-map
                (cons proc (map stream-cdr argstreams))))))
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-3-50-test.scm
  (include "stream")
  (use test)
#+END_SRC

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.51][Exercise 3.51.]]

#+BEGIN_SRC scheme :tangle ex-3-51-test.scm
  (include "stream")
  (define (show x) (display-line x) x)
  (define x (stream-map show (stream-enumerate-interval 0 10)))
  (stream-ref x 5)
  (stream-ref x 7)
#+END_SRC

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.52][Exercise 3.52.]]

We have these definitions, which in particular include a mutating procedure
~accum~:

#+BEGIN_SRC scheme :tangle ex-3-52-test.scm
  (include "stream")
  (use test)
  (define sum 0)
  (define (accum x)
    (set! sum (+ x sum))
    sum)
  (define seq (stream-map accum (stream-enumerate-interval 1 20)))
  (define y (stream-filter even? seq))
  (define z (stream-filter (lambda (x) (= (remainder x 5) 0))
                           seq))

  <<ex-3-52-eval-y>>
  <<ex-3-52-eval-z>>
#+END_SRC

First, we obtain the 7^{th} element of ~y~, which is the 14^{th} element of ~seq~,
obtaining the expected result of \( \sum_{i=1}^{14} i = 136 \):
#+NAME: ex-3-52-eval-y
#+BEGIN_SRC scheme
  (stream-ref y 7)
  (test 136
        sum)
#+END_SRC

Next, we look at ~z~, which should contain only those entries of ~seq~
divisible by ~5~. Since \( \sum_{i=1}^{n} i = \frac{n(n + 1)}{2} \), we expect
that both every \(i\)^{th} entry and \(i-1\)^{th} entry of
~(stream-enumerate-interval 1 20)~ should produce a corresponding entry in ~z~,
and this is what we indeed observe, finally obtaining ~(= sum 210)~.

#+NAME: ex-3-52-eval-y
#+BEGIN_SRC scheme
  (display-stream z)
  (test 210
        sum)
#+END_SRC

However, if ~delay~ did not cache its results, the mutation in ~accum~ would
cause a different result to be obtained for ~z~ (but not for ~y~, since it was
the first evaluated). The execution of ~y~ would have gone through the first 14
integers, as before, giving ~(= sum 136)~. The values of ~seq~ when ~z~ was
executed would therefore all be increased by 136, producing a different stream
for ~z~ and a final sum of \(136 + 210 = 346\).


   CLOCK: [2014-12-14 Sun 15:04]--[2014-12-14 Sun 16:11] =>  1:07
   CLOCK: [2014-12-14 Sun 15:01]--[2014-12-14 Sun 15:04] =>  0:03
   :PROPERTIES:
   :Effort:   1:00
   :END:
   [2014-11-22 Sat]

*** TODO 3.5.2: Infinite Streams

The book defines several miscellaneous procedures that are useful for exercises
in this section:

#+BEGIN_SRC scheme :tangle stream-util.scm
  (include "stream")

  (define (integers-starting-from n)
    (cons-stream n (integers-starting-from (+ n 1))))

  (define integers (integers-starting-from 1))

  (define (add-streams s1 s2)
    (stream-map + s1 s2))
  (define (scale-stream stream factor)
    (stream-map (lambda (x) (* x factor)) stream))

  <<stream-partial-sums>>
  <<stream-pairs>>
#+END_SRC

   CLOCK: [2015-01-03 Sat 20:05]--[2015-01-03 Sat 21:19] =>  1:14
   :PROPERTIES:
   :Effort:   3:00
   :END:
   [2014-11-22 Sat]

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.53][Exercise 3.53.]]

This produces a stream consisting of the powers of 2: ~1 2 4 8 16 ...~.

**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.54][Exercise 3.54.]]

#+BEGIN_SRC scheme

#+END_SRC

