ch3/ch3.html
<div class="outline-text-4" id="text-orgheadline73">
</div><div id="outline-container-orgheadline70" class="outline-5">
<h5 id="orgheadline70"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.50">Exercise 3.50.</a></h5>
<div class="outline-text-5" id="text-orgheadline70">
<p>
The <code>apply</code> procedure can be used to call a function with arguments drawn from
a list, and we can iterate along the argument streams in turn (which are all
assumed to be of the same length):
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock9"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">stream-map</span> proc . argstreams<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>stream-null? <span style="color: #709870;">(</span>car argstreams<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      the-empty-stream
      <span style="color: #909183;">(</span>cons-stream
       <span style="color: #709870;">(</span>apply proc <span style="color: #907373;">(</span><span style="color: #a020f0;">map</span> stream-car argstreams<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
       <span style="color: #709870;">(</span>apply stream-map
              <span style="color: #907373;">(</span>cons proc <span style="color: #6276ba;">(</span><span style="color: #a020f0;">map</span> stream-cdr argstreams<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline71" class="outline-5">
<h5 id="orgheadline71"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.51">Exercise 3.51.</a></h5>
<div class="outline-text-5" id="text-orgheadline71">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">show</span> x<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>display-line x<span style="color: #7388d6;">)</span> x<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span> <span style="color: #7388d6;">(</span>stream-map show <span style="color: #909183;">(</span>stream-enumerate-interval 0 10<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>stream-ref x 5<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>stream-ref x 7<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline72" class="outline-5">
<h5 id="orgheadline72"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.52">Exercise 3.52.</a></h5>
<div class="outline-text-5" id="text-orgheadline72">
<p>
We have these definitions, which in particular include a mutating procedure
<code>accum</code>:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">sum</span> 0<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">accum</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">set!</span> sum <span style="color: #909183;">(</span>+ x sum<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  sum<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">seq</span> <span style="color: #7388d6;">(</span>stream-map accum <span style="color: #909183;">(</span>stream-enumerate-interval 1 20<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">y</span> <span style="color: #7388d6;">(</span>stream-filter even? seq<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">z</span> <span style="color: #7388d6;">(</span>stream-filter <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>= <span style="color: #907373;">(</span>remainder x 5<span style="color: #907373;">)</span> 0<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                         seq<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #228b22;">&lt;&lt;ex-3-52-eval-y&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;ex-3-52-eval-z&gt;&gt;</span>
</pre>
</div>

<p>
First, we obtain the 7<sup>th</sup> element of <code>y</code>, which is the 14<sup>th</sup> element of <code>seq</code>,
obtaining the expected result of \( \sum_{i=1}^{14} i = 136 \):
</p>
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock10"><span style="color: #707183;">(</span>stream-ref y 7<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 136
      sum<span style="color: #707183;">)</span>
</pre>
</div>

<p>
Next, we look at <code>z</code>, which should contain only those entries of <code>seq</code>
divisible by <code>5</code>. Since \( \sum_{i=1}^{n} i = \frac{n(n + 1)}{2} \), we expect
that both every \(i\)<sup>th</sup> entry and \(i-1\)<sup>th</sup> entry of
<code>(stream-enumerate-interval 1 20)</code> should produce a corresponding entry in <code>z</code>,
and this is what we indeed observe, finally obtaining <code>(= sum 210)</code>.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock11"><span style="color: #707183;">(</span>display-stream z<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 210
      sum<span style="color: #707183;">)</span>
</pre>
</div>

<p>
However, if <code>delay</code> did not cache its results, the mutation in <code>accum</code> would
cause a different result to be obtained for <code>z</code> (but not for <code>y</code>, since it was
the first evaluated). The execution of <code>y</code> would have gone through the first 14
integers, as before, giving <code>(= sum 136)</code>. The values of <code>seq</code> when <code>z</code> was
executed would therefore all be increased by 136, producing a different stream
for <code>z</code> and a final sum of \(136 + 210 = 346\).
</p>


<p>
:Effort:   1:00
</p>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2014-11-22 Sat]</span></span>
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline74" class="outline-4">
<h4 id="orgheadline74"><span class="todo TODO">TODO</span> 3.5.2: Infinite Streams</h4>
<div class="outline-text-4" id="text-orgheadline74">
<p>
The book defines several miscellaneous procedures that are useful for exercises
in this section:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">integers-starting-from</span> n<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>cons-stream n <span style="color: #909183;">(</span>integers-starting-from <span style="color: #709870;">(</span>+ n 1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">integers</span> <span style="color: #7388d6;">(</span>integers-starting-from 1<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">add-streams</span> s1 s2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>stream-map + s1 s2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">scale-stream</span> stream factor<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>stream-map <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>* x factor<span style="color: #709870;">)</span><span style="color: #909183;">)</span> stream<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #228b22;">&lt;&lt;stream-partial-sums&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;stream-pairs&gt;&gt;</span>
</pre>
</div>

<p>
:Effort:   3:00
</p>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2014-11-22 Sat]</span></span>
</p>
</div>

<div id="outline-container-orgheadline75" class="outline-5">
<h5 id="orgheadline75"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.53">Exercise 3.53.</a></h5>
<div class="outline-text-5" id="text-orgheadline75">
<p>
This produces a stream consisting of the powers of 2: <code>1 2 4 8 16 ...</code>.
</p>
</div>
</div>

<div id="outline-container-orgheadline76" class="outline-5">
<h5 id="orgheadline76"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.54">Exercise 3.54.</a></h5>
<div class="outline-text-5" id="text-orgheadline76">
<div class="org-src-container">

<pre class="src src-scheme"></pre>
</div>
</div>
</div>
