ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.55][Exercise 3.55.]]

In order to calculate the partial sum corresponding to an element in the input
stream, you need two pieces of information: the partial sum of the elements
before this one and the element itself. This is most easily done using
recursion. The recursive function call tracks in its parameters the partial sum
of the preceding elements and the start of the remaining input stream and
returns the entire output stream.

#+NAME: stream-partial-sums
#+BEGIN_SRC scheme
  (include "stream")
  (define (partial-sums s)
    (let rec ((partial-sum 0)
              (s s))
      (if (stream-null? s)
          the-empty-stream
          (let ((new-sum (+ partial-sum (stream-car s))))
            (cons-stream new-sum
                         (rec new-sum (stream-cdr s)))))))
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-3-55-test.scm
  (use test)
  (include "stream-util")

  (test 15
        (stream-ref (partial-sums integers) 4))
#+END_SRC

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.56][Exercise 3.56.]]

The ~merge~ procedure combines two streams ordered in ascending order,
eliminating repetitions:

#+NAME: stream-merge
#+BEGIN_SRC scheme
  (define (merge s1 s2)
    (cond ((stream-null? s1) s2)
          ((stream-null? s2) s1)
          (else
           (let ((s1car (stream-car s1))
                 (s2car (stream-car s2)))
             (cond ((< s1car s2car)
                    (cons-stream s1car (merge (stream-cdr s1) s2)))
                   ((> s1car s2car)
                    (cons-stream s2car (merge s1 (stream-cdr s2))))
                   (else
                    (cons-stream s1car
                                 (merge (stream-cdr s1)
                                        (stream-cdr s2)))))))))
#+END_SRC

Given this, we can create ~S~, the list of integers with no prime factors but
2, 3, and 5:

#+BEGIN_SRC scheme :tangle ex-3-56.scm
  (include "stream")
  (include "stream-util")
  <<stream-merge>>

  (define S (cons-stream 1 (merge (scale-stream S 2)
                                  (merge (scale-stream S 3)
                                         (scale-stream S 5)))))
#+END_SRC

**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.57][Exercise 3.57.]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.58][Exercise 3.58.]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.59][Exercise 3.59.]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.60][Exercise 3.60.]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.61][Exercise 3.61.]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.62][Exercise 3.62.]]
*** TODO 3.5.3: Exploiting the Stream Paradigm
    CLOCK: [2015-01-19 Mon 16:53]--[2015-01-19 Mon 17:15] =>  0:22
    CLOCK: [2015-01-19 Mon 15:27]--[2015-01-19 Mon 15:48] =>  0:21
    CLOCK: [2015-01-19 Mon 13:27]--[2015-01-19 Mon 15:27] =>  2:00

For convenience:

#+NAME: stream-pairs
#+BEGIN_SRC scheme
  (define (interleave s1 s2)
    (if (stream-null? s1)
        s2
        (cons-stream (stream-car s1)
                     (interleave s2 (stream-cdr s1)))))
  (define (pairs s t)
    (cons-stream
     (list (stream-car s) (stream-car t))
     (interleave
      (stream-map (lambda (x) (list (stream-car s) x))
                  (stream-cdr t))
      (pairs (stream-cdr s) (stream-cdr t)))))
#+END_SRC

