ch3/ch3.html

<div id="outline-container-orgheadline77" class="outline-5">
<h5 id="orgheadline77"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.55">Exercise 3.55.</a></h5>
<div class="outline-text-5" id="text-orgheadline77">
<p>
In order to calculate the partial sum corresponding to an element in the input
stream, you need two pieces of information: the partial sum of the elements
before this one and the element itself. This is most easily done using
recursion. The recursive function call tracks in its parameters the partial sum
of the preceding elements and the start of the remaining input stream and
returns the entire output stream.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock12"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">partial-sums</span> s<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">rec</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>partial-sum 0<span style="color: #709870;">)</span>
            <span style="color: #709870;">(</span>s s<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>stream-null? s<span style="color: #709870;">)</span>
        the-empty-stream
        <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>new-sum <span style="color: #858580;">(</span>+ partial-sum <span style="color: #80a880;">(</span>stream-car s<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>cons-stream new-sum
                       <span style="color: #6276ba;">(</span>rec new-sum <span style="color: #858580;">(</span>stream-cdr s<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream-util"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>test 15
      <span style="color: #7388d6;">(</span>stream-ref <span style="color: #909183;">(</span>partial-sums integers<span style="color: #909183;">)</span> 4<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline78" class="outline-5">
<h5 id="orgheadline78"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.56">Exercise 3.56.</a></h5>
<div class="outline-text-5" id="text-orgheadline78">
<p>
The <code>merge</code> procedure combines two streams ordered in ascending order,
eliminating repetitions:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock13"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">merge</span> s1 s2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>stream-null? s1<span style="color: #709870;">)</span> s2<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>stream-null? s2<span style="color: #709870;">)</span> s1<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span>
         <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>s1car <span style="color: #858580;">(</span>stream-car s1<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
               <span style="color: #6276ba;">(</span>s2car <span style="color: #858580;">(</span>stream-car s2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>&lt; s1car s2car<span style="color: #858580;">)</span>
                  <span style="color: #858580;">(</span>cons-stream s1car <span style="color: #80a880;">(</span>merge <span style="color: #887070;">(</span>stream-cdr s1<span style="color: #887070;">)</span> s2<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                 <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>&gt; s1car s2car<span style="color: #858580;">)</span>
                  <span style="color: #858580;">(</span>cons-stream s2car <span style="color: #80a880;">(</span>merge s1 <span style="color: #887070;">(</span>stream-cdr s2<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                 <span style="color: #6276ba;">(</span><span style="color: #a020f0;">else</span>
                  <span style="color: #858580;">(</span>cons-stream s1car
                               <span style="color: #80a880;">(</span>merge <span style="color: #887070;">(</span>stream-cdr s1<span style="color: #887070;">)</span>
                                      <span style="color: #887070;">(</span>stream-cdr s2<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Given this, we can create <code>S</code>, the list of integers with no prime factors but
2, 3, and 5:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream-util"</span><span style="color: #707183;">)</span>
<span style="color: #228b22;">&lt;&lt;stream-merge&gt;&gt;</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">S</span> <span style="color: #7388d6;">(</span>cons-stream 1 <span style="color: #909183;">(</span>merge <span style="color: #709870;">(</span>scale-stream S 2<span style="color: #709870;">)</span>
                                <span style="color: #709870;">(</span>merge <span style="color: #907373;">(</span>scale-stream S 3<span style="color: #907373;">)</span>
                                       <span style="color: #907373;">(</span>scale-stream S 5<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline79" class="outline-5">
<h5 id="orgheadline79"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.57">Exercise 3.57.</a></h5>
</div>
<div id="outline-container-orgheadline80" class="outline-5">
<h5 id="orgheadline80"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.58">Exercise 3.58.</a></h5>
</div>
<div id="outline-container-orgheadline81" class="outline-5">
<h5 id="orgheadline81"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.59">Exercise 3.59.</a></h5>
</div>
<div id="outline-container-orgheadline82" class="outline-5">
<h5 id="orgheadline82"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.60">Exercise 3.60.</a></h5>
</div>
<div id="outline-container-orgheadline83" class="outline-5">
<h5 id="orgheadline83"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.61">Exercise 3.61.</a></h5>
</div>
<div id="outline-container-orgheadline84" class="outline-5">
<h5 id="orgheadline84"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.62">Exercise 3.62.</a></h5>
</div>
</div>
<div id="outline-container-orgheadline85" class="outline-4">
<h4 id="orgheadline85"><span class="todo TODO">TODO</span> 3.5.3: Exploiting the Stream Paradigm</h4>
<div class="outline-text-4" id="text-orgheadline85">
<p>
For convenience:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock14"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">interleave</span> s1 s2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>stream-null? s1<span style="color: #909183;">)</span>
      s2
      <span style="color: #909183;">(</span>cons-stream <span style="color: #709870;">(</span>stream-car s1<span style="color: #709870;">)</span>
                   <span style="color: #709870;">(</span>interleave s2 <span style="color: #907373;">(</span>stream-cdr s1<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">pairs</span> s t<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>cons-stream
   <span style="color: #909183;">(</span>list <span style="color: #709870;">(</span>stream-car s<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>stream-car t<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>interleave
    <span style="color: #709870;">(</span>stream-map <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">(</span>x<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>list <span style="color: #858580;">(</span>stream-car s<span style="color: #858580;">)</span> x<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                <span style="color: #907373;">(</span>stream-cdr t<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
    <span style="color: #709870;">(</span>pairs <span style="color: #907373;">(</span>stream-cdr s<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>stream-cdr t<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
