ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.63][Exercise 3.63.]]

*TODO*: Explain better.

First, note that both procedures are inefficient without memoization, because
~guesses~ has to be evaluated always in Alyssa's version as well. However, with
memoization, the ~guesses~ variable is bound in the environment of
~sqrt-stream~, so the delayed cdr of the stream returned by ~cons-stream~ is
memoized after the first call.

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.64][Exercise 3.64.]]

A straightforward recursive procedure:

#+BEGIN_SRC scheme :tangle ex-3-64.scm
  (include "stream")

  (define (stream-limit stream tol)
    (let rec ((stream stream)
              (previous +inf))  ; +INF is IEEE-754 positive infinity
      (if (stream-null? stream)
          (error "STREAM-LIMIT - stream exhausted without tolerance achieved")
          (let ((current (stream-car stream))
                (rest (stream-cdr stream)))
            (if (< (abs (- previous current)) tol)
                current
                (rec rest current))))))

#+END_SRC

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.65][Exercise 3.65.]]

This is the original sequence:

#+NAME: ln2-stream
#+BEGIN_SRC scheme
  (include "stream")
  (include "stream-util")

  (define (ln2-summands)
    (cons-stream 1.0
                 (stream-map (lambda (k)
                               (* (if (even? k) -1.0 1.0)
                                  (/ 1.0 k)))
                             (integers-starting-from 2))))
  (define (ln2-stream)
    (partial-sums (ln2-summands)))
#+END_SRC

In order to accelerate the \(\ln{2}\) sequence, we use the Euler transform from
this subsection:

#+NAME: stream-euler-transform
#+BEGIN_SRC scheme
  (define (make-tableau transform s)
    (cons-stream s
                 (make-tableau transform
                               (transform s))))

  (define (accelerated-sequence transform s)
    (stream-map stream-car
                (make-tableau transform s)))

  (define (square x) (* x x))
  (define (euler-transform s)
    (let ((s0 (stream-ref s 0))           ; S_{n-1}
          (s1 (stream-ref s 1))           ; S_{n}
          (s2 (stream-ref s 2)))          ; S_{n+1}
      (cons-stream (- s2 (/ (square (- s2 s1))
                            (+ s0 (* -2 s1) s2)))
                   (euler-transform (stream-cdr s)))))
#+END_SRC

We put the sequence and the transform in the same file for ease of testing:

#+BEGIN_SRC scheme :tangle ex-3-65.scm
  <<stream-euler-transform>>
  <<ln2-stream>>
#+END_SRC

With that, we can calculate the convergence of the original sequence as well as
its acceleration one and two times. As expected, the more accelerated sequences
converge much faster---while the original sequence has not converged even after
hundreds of iterations, it only takes 10 iterations for the first accelerated
sequence to converge to the limits of floating-point accuracy, and 5 iterations
for the second accelerated sequence.

#+BEGIN_SRC scheme :tangle ex-3-65-test.scm
  (use test)
  (include "ex-3-65")

  (define orig (ln2-stream))
  (define acc1 (accelerated-sequence euler-transform orig))
  (define acc2 (accelerated-sequence euler-transform acc1))
#+END_SRC

