ch3/ch3.html

<div id="outline-container-orgheadline86" class="outline-5">
<h5 id="orgheadline86"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.63">Exercise 3.63.</a></h5>
<div class="outline-text-5" id="text-orgheadline86">
<p>
<b>TODO</b>: Explain better.
</p>

<p>
First, note that both procedures are inefficient without memoization, because
<code>guesses</code> has to be evaluated always in Alyssa's version as well. However, with
memoization, the <code>guesses</code> variable is bound in the environment of
<code>sqrt-stream</code>, so the delayed cdr of the stream returned by <code>cons-stream</code> is
memoized after the first call.
</p>
</div>
</div>

<div id="outline-container-orgheadline87" class="outline-5">
<h5 id="orgheadline87"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.64">Exercise 3.64.</a></h5>
<div class="outline-text-5" id="text-orgheadline87">
<p>
A straightforward recursive procedure:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">stream-limit</span> stream tol<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">rec</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>stream stream<span style="color: #709870;">)</span>
            <span style="color: #709870;">(</span>previous +inf<span style="color: #709870;">)</span><span style="color: #909183;">)</span>  <span style="color: #b22222;">; </span><span style="color: #b22222;">+INF is IEEE-754 positive infinity</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>stream-null? stream<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"STREAM-LIMIT - stream exhausted without tolerance achieved"</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>current <span style="color: #858580;">(</span>stream-car stream<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span>rest <span style="color: #858580;">(</span>stream-cdr stream<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">if</span> <span style="color: #6276ba;">(</span>&lt; <span style="color: #858580;">(</span>abs <span style="color: #80a880;">(</span>- previous current<span style="color: #80a880;">)</span><span style="color: #858580;">)</span> tol<span style="color: #6276ba;">)</span>
              current
              <span style="color: #6276ba;">(</span>rec rest current<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline88" class="outline-5">
<h5 id="orgheadline88"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.65">Exercise 3.65.</a></h5>
<div class="outline-text-5" id="text-orgheadline88">
<p>
This is the original sequence:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock15"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream-util"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">ln2-summands</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>cons-stream 1.0
               <span style="color: #909183;">(</span>stream-map <span style="color: #709870;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #907373;">(</span>k<span style="color: #907373;">)</span>
                             <span style="color: #907373;">(</span>* <span style="color: #6276ba;">(</span><span style="color: #a020f0;">if</span> <span style="color: #858580;">(</span>even? k<span style="color: #858580;">)</span> -1.0 1.0<span style="color: #6276ba;">)</span>
                                <span style="color: #6276ba;">(</span>/ 1.0 k<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                           <span style="color: #709870;">(</span>integers-starting-from 2<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">ln2-stream</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>partial-sums <span style="color: #909183;">(</span>ln2-summands<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
In order to accelerate the \(\ln{2}\) sequence, we use the Euler transform from
this subsection:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock16"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-tableau</span> transform s<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>cons-stream s
               <span style="color: #909183;">(</span>make-tableau transform
                             <span style="color: #709870;">(</span>transform s<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">accelerated-sequence</span> transform s<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>stream-map stream-car
              <span style="color: #909183;">(</span>make-tableau transform s<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">square</span> x<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>* x x<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">euler-transform</span> s<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>s0 <span style="color: #907373;">(</span>stream-ref s 0<span style="color: #907373;">)</span><span style="color: #709870;">)</span>           <span style="color: #b22222;">; </span><span style="color: #b22222;">S_{n-1}</span>
        <span style="color: #709870;">(</span>s1 <span style="color: #907373;">(</span>stream-ref s 1<span style="color: #907373;">)</span><span style="color: #709870;">)</span>           <span style="color: #b22222;">; </span><span style="color: #b22222;">S_{n}</span>
        <span style="color: #709870;">(</span>s2 <span style="color: #907373;">(</span>stream-ref s 2<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>          <span style="color: #b22222;">; </span><span style="color: #b22222;">S_{n+1}</span>
    <span style="color: #909183;">(</span>cons-stream <span style="color: #709870;">(</span>- s2 <span style="color: #907373;">(</span>/ <span style="color: #6276ba;">(</span>square <span style="color: #858580;">(</span>- s2 s1<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                          <span style="color: #6276ba;">(</span>+ s0 <span style="color: #858580;">(</span>* -2 s1<span style="color: #858580;">)</span> s2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 <span style="color: #709870;">(</span>euler-transform <span style="color: #907373;">(</span>stream-cdr s<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
We put the sequence and the transform in the same file for ease of testing:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #228b22;">&lt;&lt;stream-euler-transform&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;ln2-stream&gt;&gt;</span>
</pre>
</div>

<p>
With that, we can calculate the convergence of the original sequence as well as
its acceleration one and two times. As expected, the more accelerated sequences
converge much faster&#x2014;while the original sequence has not converged even after
hundreds of iterations, it only takes 10 iterations for the first accelerated
sequence to converge to the limits of floating-point accuracy, and 5 iterations
for the second accelerated sequence.
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-65"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">orig</span> <span style="color: #7388d6;">(</span>ln2-stream<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">acc1</span> <span style="color: #7388d6;">(</span>accelerated-sequence euler-transform orig<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">acc2</span> <span style="color: #7388d6;">(</span>accelerated-sequence euler-transform acc1<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
