ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.66][Exercise 3.66.]]

Here are the first twenty pairs:

#+BEGIN_SRC scheme :tangle ex-3-66-test.scm
  (include "stream")
  (include "stream-util")

  (test (map (lambda (i) (stream-ref (pairs integers integers) i))
             (iota 20))
        '((1 1) (1 2) (2 2) (1 3) (2 3) (1 4) (3 3) (1 5) (2 4) (1 6)
          (3 4) (1 7) (2 5) (1 8) (4 4) (1 9) (2 6) (1 10) (3 5) (1 11)))
#+END_SRC

Notice that two streams seem to be interleaved:

- A stream of pairs ~(1 k)~ in the second, fourth, etc. positions; i.e., where
  \(i\) is odd (starting from \(0\)). More
  precisely, if ~(odd? i)~, ~(stream-ref pairs-stream i)~ is
  ~(+ 1 (quotient (- i 1) 2))~.
- A stream of pairs where all pairs that sum to \(n\) are generated before those
  that sum to \(n + 1\). In these pairs, \(i\) decreases from \(\lfloor n / 2 \rfloor\) to \(2\),
  since \(i = 1\) is already taken.

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.67][Exercise 3.67.]]

We proceed by induction. Consider the case where all pairs \((S_{k < i}, T_{j})\)
have been generated. Then the stream to generate consists of the following
three parts:

- The single element \((S_{i}, T_{0})\).
- The pairs of \(S_{i}\) with the rest of the elements in \(T\): \((S_{i}, T_{j > 0})\).
- The pairs the remaining elements of \(S\) with everything: \((S_{k > i}, T_{j})\).

The pair \((S_{0}, T_{0})\) is obviously in the stream to be generated, so our
construction in fact does produce all the pairs \((S_{i}, T_{j})\). The Scheme
implementation below straightforwardly generates these three parts of the
stream (see the comments):

#+BEGIN_SRC scheme :tangle ex-3-67.scm
  (include "stream")
  (include "stream-util")

  (define (both-pairs s t)
    (cons-stream
     ;; (S_{i}, T_{0})
     (list (stream-car s) (stream-car t))
     (interleave
      ;; (S_{i}, T_{j > 0})
      (stream-map (lambda (x) (list (stream-car s) x))
                  (stream-cdr t))
      ;; (S_{k > i}, T_{j})
      (both-pairs (stream-cdr s) t))))
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-3-67-test.scm
  (use test)
  (include "ex-3-67")
#+END_SRC

**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.68][Exercise 3.68.]]

This does not work---it generates the list \((S_{i}, T_{j}), i \leq j\).

**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.69][Exercise 3.69.]]

#+BEGIN_SRC scheme ex-3-69.scm
  (define (triples s t u)
    )
#+END_SRC

