ch3/ch3.html

<div id="outline-container-orgheadline89" class="outline-5">
<h5 id="orgheadline89"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.66">Exercise 3.66.</a></h5>
<div class="outline-text-5" id="text-orgheadline89">
<p>
Here are the first twenty pairs:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream-util"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>test <span style="color: #7388d6;">(</span><span style="color: #a020f0;">map</span> <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>i<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>stream-ref <span style="color: #907373;">(</span>pairs integers integers<span style="color: #907373;">)</span> i<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
           <span style="color: #909183;">(</span>iota 20<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
      '<span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>1 1<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>1 2<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>2 2<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>1 3<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>2 3<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>1 4<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>3 3<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>1 5<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>2 4<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>1 6<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>3 4<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>1 7<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>2 5<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>1 8<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>4 4<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>1 9<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>2 6<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>1 10<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>3 5<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>1 11<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Notice that two streams seem to be interleaved:
</p>

<ul class="org-ul">
<li>A stream of pairs <code>(1 k)</code> in the second, fourth, etc. positions; i.e., where
\(i\) is odd (starting from \(0\)). More
precisely, if <code>(odd? i)</code>, <code>(stream-ref pairs-stream i)</code> is
<code>(+ 1 (quotient (- i 1) 2))</code>.</li>
<li>A stream of pairs where all pairs that sum to \(n\) are generated before those
that sum to \(n + 1\). In these pairs, \(i\) decreases from \(\lfloor n / 2 \rfloor\) to \(2\),
since \(i = 1\) is already taken.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline90" class="outline-5">
<h5 id="orgheadline90"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.67">Exercise 3.67.</a></h5>
<div class="outline-text-5" id="text-orgheadline90">
<p>
We proceed by induction. Consider the case where all pairs \((S_{k < i}, T_{j})\)
have been generated. Then the stream to generate consists of the following
three parts:
</p>

<ul class="org-ul">
<li>The single element \((S_{i}, T_{0})\).</li>
<li>The pairs of \(S_{i}\) with the rest of the elements in \(T\): \((S_{i}, T_{j > 0})\).</li>
<li>The pairs the remaining elements of \(S\) with everything: \((S_{k > i}, T_{j})\).</li>
</ul>

<p>
The pair \((S_{0}, T_{0})\) is obviously in the stream to be generated, so our
construction in fact does produce all the pairs \((S_{i}, T_{j})\). The Scheme
implementation below straightforwardly generates these three parts of the
stream (see the comments):
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream-util"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">both-pairs</span> s t<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>cons-stream
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">(S_{i}, T_{0})</span>
   <span style="color: #909183;">(</span>list <span style="color: #709870;">(</span>stream-car s<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>stream-car t<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>interleave
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">(S_{i}, T_{j &gt; 0})</span>
    <span style="color: #709870;">(</span>stream-map <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">(</span>x<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>list <span style="color: #858580;">(</span>stream-car s<span style="color: #858580;">)</span> x<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                <span style="color: #907373;">(</span>stream-cdr t<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">(S_{k &gt; i}, T_{j})</span>
    <span style="color: #709870;">(</span>both-pairs <span style="color: #907373;">(</span>stream-cdr s<span style="color: #907373;">)</span> t<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-67"</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline91" class="outline-5">
<h5 id="orgheadline91"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.68">Exercise 3.68.</a></h5>
<div class="outline-text-5" id="text-orgheadline91">
<p>
This does not work&#x2014;it generates the list \((S_{i}, T_{j}), i \leq j\).
</p>
</div>
</div>

<div id="outline-container-orgheadline92" class="outline-5">
<h5 id="orgheadline92"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.69">Exercise 3.69.</a></h5>
<div class="outline-text-5" id="text-orgheadline92">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">triples</span> s t u<span style="color: #7388d6;">)</span>
  <span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
