ch3/ch3.org
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.70][Exercise 3.70.]]

Here, we want to construct a list of all pairs \((S_{i}, T_{j})\) just as in Exercise
3.67, but we want to make sure that instead of interleaving streams one after
the other, we interleave according to whichever stream has a first element with
a smaller weight.

#+BEGIN_SRC scheme
  (include "stream")
  (include "stream-util")

  (define (merge-weighted s1 s2 weight)
    (let recur ((s1 s1) (s2 s2))
      (cond ((stream-null? s1) s2)
            ((stream-null? s2) s1)
            (else
             (let* ((s1car (stream-car s1))
                    (s2car (stream-car s2))
                    (w (weight s1car s2car))
                    (wrev (weight s2car s1car)))
               (cond ((< w wrev)
                      (cons-stream s1car (recur (stream-cdr s1) s2)))
                     ((> w wrev)
                      (cons-stream s2car (recur s1 (stream-cdr s2))))
                     (else
                      (cons-stream s1car
                                   (recur (stream-cdr s1)
                                          (stream-cdr s2))))))))))
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-3-70.scm
  (define (weighted-pairs s t weight)
    (cons-stream
     ;; (S_{i}, T_{0})
     (list (stream-car s) (stream-car t))
     (merge-weighted
      ;; (S_{i}, T_{j > 0})
      (stream-map (lambda (x) (list (stream-car s) x))
                  (stream-cdr t))
      ;; (S_{k > i}, T_{j})
      (both-pairs (stream-cdr s) t)
      weight)))
#+END_SRC

Now we can compute:

a. the stream of all pairs of positive integers \((i, j)\) with \((i \leq j)\)
   ordered according to the sum \(i + j\):

   #+BEGIN_SRC scheme :tangle ex-3-70-test.scm
     (use test)
     (include "ex-3-70")

     (define stream-a (weighted-pairs integers integers <))
     (define stream-b
       (stream-filter (lambda (p)
                        (not (apply or
                                    (map (lambda (q)
                                           (= 0 (remainder p q)))
                                         '(2 3 5)))))
                      (weighted-pairs integers integers
                                      (lambda (i j)
                                        (+ (* 2 i)
                                           (* 3 j)
                                           (* 5 i j))))))
   #+END_SRC

**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.71][Exercise 3.71.]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.72][Exercise 3.72.]]
