ch3/ch3.html

<div id="outline-container-orgheadline93" class="outline-5">
<h5 id="orgheadline93"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.70">Exercise 3.70.</a></h5>
<div class="outline-text-5" id="text-orgheadline93">
<p>
Here, we want to construct a list of all pairs \((S_{i}, T_{j})\) just as in Exercise
3.67, but we want to make sure that instead of interleaving streams one after
the other, we interleave according to whichever stream has a first element with
a smaller weight.
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream-util"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">merge-weighted</span> s1 s2 weight<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">recur</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>s1 s1<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>s2 s2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>stream-null? s1<span style="color: #907373;">)</span> s2<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>stream-null? s2<span style="color: #907373;">)</span> s1<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span>
           <span style="color: #907373;">(</span><span style="color: #a020f0;">let*</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>s1car <span style="color: #80a880;">(</span>stream-car s1<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                  <span style="color: #858580;">(</span>s2car <span style="color: #80a880;">(</span>stream-car s2<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                  <span style="color: #858580;">(</span>w <span style="color: #80a880;">(</span>weight s1car s2car<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                  <span style="color: #858580;">(</span>wrev <span style="color: #80a880;">(</span>weight s2car s1car<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>&lt; w wrev<span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span>cons-stream s1car <span style="color: #887070;">(</span>recur <span style="color: #707183;">(</span>stream-cdr s1<span style="color: #707183;">)</span> s2<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                   <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>&gt; w wrev<span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span>cons-stream s2car <span style="color: #887070;">(</span>recur s1 <span style="color: #707183;">(</span>stream-cdr s2<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                   <span style="color: #858580;">(</span><span style="color: #a020f0;">else</span>
                    <span style="color: #80a880;">(</span>cons-stream s1car
                                 <span style="color: #887070;">(</span>recur <span style="color: #707183;">(</span>stream-cdr s1<span style="color: #707183;">)</span>
                                        <span style="color: #707183;">(</span>stream-cdr s2<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">weighted-pairs</span> s t weight<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>cons-stream
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">(S_{i}, T_{0})</span>
   <span style="color: #909183;">(</span>list <span style="color: #709870;">(</span>stream-car s<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>stream-car t<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>merge-weighted
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">(S_{i}, T_{j &gt; 0})</span>
    <span style="color: #709870;">(</span>stream-map <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">(</span>x<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>list <span style="color: #858580;">(</span>stream-car s<span style="color: #858580;">)</span> x<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                <span style="color: #907373;">(</span>stream-cdr t<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">(S_{k &gt; i}, T_{j})</span>
    <span style="color: #709870;">(</span>both-pairs <span style="color: #907373;">(</span>stream-cdr s<span style="color: #907373;">)</span> t<span style="color: #709870;">)</span>
    weight<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Now we can compute:
</p>

<ol class="org-ol">
<li><p>
the stream of all pairs of positive integers \((i, j)\) with \((i \leq j)\)
   ordered according to the sum \(i + j\):
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-70"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">stream-a</span> <span style="color: #7388d6;">(</span>weighted-pairs integers integers &lt;<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">stream-b</span>
  <span style="color: #7388d6;">(</span>stream-filter <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>p<span style="color: #709870;">)</span>
                   <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>apply or
                               <span style="color: #6276ba;">(</span><span style="color: #a020f0;">map</span> <span style="color: #858580;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #80a880;">(</span>q<span style="color: #80a880;">)</span>
                                      <span style="color: #80a880;">(</span>= 0 <span style="color: #887070;">(</span>remainder p q<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                                    '<span style="color: #858580;">(</span>2 3 5<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                 <span style="color: #909183;">(</span>weighted-pairs integers integers
                                 <span style="color: #709870;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #907373;">(</span>i j<span style="color: #907373;">)</span>
                                   <span style="color: #907373;">(</span>+ <span style="color: #6276ba;">(</span>* 2 i<span style="color: #6276ba;">)</span>
                                      <span style="color: #6276ba;">(</span>* 3 j<span style="color: #6276ba;">)</span>
                                      <span style="color: #6276ba;">(</span>* 5 i j<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline94" class="outline-5">
<h5 id="orgheadline94"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.71">Exercise 3.71.</a></h5>
</div>
<div id="outline-container-orgheadline95" class="outline-5">
<h5 id="orgheadline95"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.72">Exercise 3.72.</a></h5>
</div>
