ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.73][Exercise 3.73.]]

#+BEGIN_SRC scheme :tangle stream-integral.scm
  (include "stream")
  (include "stream-util")

  (define (integral integrand initial-value dt)
    (define int
      (cons-stream initial-value
                   (add-streams (scale-stream integrand dt)
                                int)))
    int)
#+END_SRC


#+BEGIN_SRC scheme :tangle ex-3-73.scm
  (include "stream")
  (include "stream-util")

  (define (RC R C dt)
    (define (circuit i v0)
      (add-streams (scale-stream i R)
                   (integral (scale-stream i (/ 1.0 C)) v0)))
    circuit)
#+END_SRC

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.74][Exercise 3.74.]]

#+BEGIN_SRC scheme ex-3-74.scm
  (define zero-crossings
    (stream-map sign-change-detector
                sense-data
                (stream-cdr sense-data)))
#+END_SRC

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.75][Exercise 3.75.]]

Alyssa wants to run the sign change detector on the smoothed stream. In other
words, the sign change detector should be run on two values: first, the average
of the current and last points; second, the average between the last and
previous-to-last points. However, Louis' program runs the sign change detector
between the average point and the previous, unsmoothed point. Here is the
correct version, which needs to preserve the average between the last and
previous-to-last points:

#+BEGIN_SRC scheme
  (define (make-zero-crossings input-stream last-value last-avpt)
    (let* ((current (stream-car input-stream))
           (avpt (/ (+ current last-value) 2)))
      (cons-stream
       (sign-change-detector avpt last-avpt)
       (make-zero-crossings
        (stream-cdr input-stream) current avpt))))
#+END_SRC

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.76][Exercise 3.76.]]

Here, we exploit the inherent independence between the smoothing process and
the sign-change detection to compose the two transformations:

#+BEGIN_SRC scheme
  (define (smooth input-stream)
    (define (inner input-stream last-value)
      (let* ((current (stream-car input-stream))
             (avpt (/ (+ current last-value) 2)))
        (cons-stream avpt
                     (inner (stream-cdr input-stream) current))))
    (inner input-stream 0))

  (define zero-crossings
    (let ((s (smooth sense-stream)))
      (stream-map sign-change-detector
                  s (cdr s))))
#+END_SRC


*** DONE 3.5.4: Streams and Delayed Evaluation
    CLOCK: [2015-01-25 Sun 19:37]--[2015-01-25 Sun 20:50] =>  1:13
    CLOCK: [2015-01-19 Mon 13:19]--[2015-01-19 Mon 13:25] =>  0:06
    :PROPERTIES:
    :Effort:   2:00
    :END:

**** Code

Stream integral function from text:

#+BEGIN_SRC scheme :tangle stream-integral.scm
  (include "stream")
  (include "stream-util")

  (define (integral delayed-integrand initial-value dt)
    (define int
      (cons-stream initial-value
                   (let ((integrand (force delayed-integrand)))
                     (add-streams (scale-stream integrand dt)
                                  int))))
    int)
#+END_SRC

