ch3/ch3.html
<div id="outline-container-orgheadline96" class="outline-5">
<h5 id="orgheadline96"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.73">Exercise 3.73.</a></h5>
<div class="outline-text-5" id="text-orgheadline96">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream-util"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">integral</span> integrand initial-value dt<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">int</span>
    <span style="color: #909183;">(</span>cons-stream initial-value
                 <span style="color: #709870;">(</span>add-streams <span style="color: #907373;">(</span>scale-stream integrand dt<span style="color: #907373;">)</span>
                              int<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  int<span style="color: #707183;">)</span>
</pre>
</div>


<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream-util"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">RC</span> R C dt<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">circuit</span> i v0<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>add-streams <span style="color: #709870;">(</span>scale-stream i R<span style="color: #709870;">)</span>
                 <span style="color: #709870;">(</span>integral <span style="color: #907373;">(</span>scale-stream i <span style="color: #6276ba;">(</span>/ 1.0 C<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> v0<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  circuit<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline97" class="outline-5">
<h5 id="orgheadline97"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.74">Exercise 3.74.</a></h5>
<div class="outline-text-5" id="text-orgheadline97">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">zero-crossings</span>
  <span style="color: #7388d6;">(</span>stream-map sign-change-detector
              sense-data
              <span style="color: #909183;">(</span>stream-cdr sense-data<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline98" class="outline-5">
<h5 id="orgheadline98"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.75">Exercise 3.75.</a></h5>
<div class="outline-text-5" id="text-orgheadline98">
<p>
Alyssa wants to run the sign change detector on the smoothed stream. In other
words, the sign change detector should be run on two values: first, the average
of the current and last points; second, the average between the last and
previous-to-last points. However, Louis' program runs the sign change detector
between the average point and the previous, unsmoothed point. Here is the
correct version, which needs to preserve the average between the last and
previous-to-last points:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-zero-crossings</span> input-stream last-value last-avpt<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>current <span style="color: #907373;">(</span>stream-car input-stream<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>avpt <span style="color: #907373;">(</span>/ <span style="color: #6276ba;">(</span>+ current last-value<span style="color: #6276ba;">)</span> 2<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>cons-stream
     <span style="color: #709870;">(</span>sign-change-detector avpt last-avpt<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>make-zero-crossings
      <span style="color: #907373;">(</span>stream-cdr input-stream<span style="color: #907373;">)</span> current avpt<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline99" class="outline-5">
<h5 id="orgheadline99"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.76">Exercise 3.76.</a></h5>
<div class="outline-text-5" id="text-orgheadline99">
<p>
Here, we exploit the inherent independence between the smoothing process and
the sign-change detection to compose the two transformations:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">smooth</span> input-stream<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">inner</span> input-stream last-value<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let*</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>current <span style="color: #6276ba;">(</span>stream-car input-stream<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>avpt <span style="color: #6276ba;">(</span>/ <span style="color: #858580;">(</span>+ current last-value<span style="color: #858580;">)</span> 2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>cons-stream avpt
                   <span style="color: #907373;">(</span>inner <span style="color: #6276ba;">(</span>stream-cdr input-stream<span style="color: #6276ba;">)</span> current<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>inner input-stream 0<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">zero-crossings</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>s <span style="color: #907373;">(</span>smooth sense-stream<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>stream-map sign-change-detector
                s <span style="color: #709870;">(</span>cdr s<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline100" class="outline-4">
<h4 id="orgheadline100"><span class="done DONE">DONE</span> 3.5.4: Streams and Delayed Evaluation</h4>
<div class="outline-text-4" id="text-orgheadline100">
<p>
:Effort:   2:00
</p>
</div>

<div id="outline-container-orgheadline101" class="outline-5">
<h5 id="orgheadline101">Code</h5>
<div class="outline-text-5" id="text-orgheadline101">
<p>
Stream integral function from text:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream-util"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">integral</span> delayed-integrand initial-value dt<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">int</span>
    <span style="color: #909183;">(</span>cons-stream initial-value
                 <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>integrand <span style="color: #858580;">(</span><span style="color: #a020f0;">force</span> delayed-integrand<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                   <span style="color: #907373;">(</span>add-streams <span style="color: #6276ba;">(</span>scale-stream integrand dt<span style="color: #6276ba;">)</span>
                                int<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  int<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
