ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.77][Exercise 3.77.]]

This should just be a matter of delaying the evaluation of ~integrand~ until
the ~cdr~ of the ~cons-stream~ is forced, the same way as is done for the
implicit definition:

#+BEGIN_SRC scheme :tangle ex-3-77.scm
  (include "stream")
  (include "stream-util")

  (define (integral delayed-integrand initial-value dt)
    (cons-stream
     initial-value
     (let ((integrand (force delayed-integrand)))
       (if (stream-null? integrand)
           the-empty-stream
           (integral
            ;; The first argument to INTEGRAL is a *delayed* integrand.
            (delay (stream-cdr integrand))
            (+ (* dt (stream-car integrand))
               initial-value)
            dt)))))

#+END_SRC

#+BEGIN_SRC scheme :tangle ex-3-77-test.scm
  (include "ex-3-77")
  (use test)

  (define (solve f y0 dt)
    (define y (integral (delay dy) y0 dt))
    (define dy (stream-map f y))
    y)

  (test 2.716924
        (stream-ref (solve (lambda (y) y) 1 0.001) 1000))
#+END_SRC

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.78][Exercise 3.78.]]

Straightforward encoding of the diagram in the text:

#+BEGIN_SRC scheme
  (include "stream")
  (include "stream-util")

  (define (solve-2nd a b dt y0 dy0)
    (define y (integrate (delay dy) y0 dt))
    (define dy (integrate (delay ddy) dy0 dt))
    (define ddy (add-streams (scale-stream dy a) (scale-stream y b)))
    y)
#+END_SRC

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.79][Exercise 3.79.]]

The integration of ~ddy~ to ~dy~ and ~dy~ to ~y~ remain identical with the
previous answer. The only change is to generalize the definition of ~ddy~ to an
arbitrary function of the two variables \(\mathtt{dy} \equiv \frac{dy}{dt}\) and
\(\mathtt{y} \equiv y\):

#+BEGIN_SRC scheme
  (include "stream")
  (include "stream-util")

  (define (solve-2nd f dt y0 dy0)
    (define y (integrate (delay dy) y0 dt))
    (define dy (integrate (delay ddy) dy0 dt))
    (define ddy (stream-map-poly f dy y))  ; (define (f dy y) ...)
    y)
#+END_SRC

