ch3/ch3.html

<div id="outline-container-orgheadline102" class="outline-5">
<h5 id="orgheadline102"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.77">Exercise 3.77.</a></h5>
<div class="outline-text-5" id="text-orgheadline102">
<p>
This should just be a matter of delaying the evaluation of <code>integrand</code> until
the <code>cdr</code> of the <code>cons-stream</code> is forced, the same way as is done for the
implicit definition:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream-util"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">integral</span> delayed-integrand initial-value dt<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>cons-stream
   initial-value
   <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>integrand <span style="color: #6276ba;">(</span><span style="color: #a020f0;">force</span> delayed-integrand<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> <span style="color: #907373;">(</span>stream-null? integrand<span style="color: #907373;">)</span>
         the-empty-stream
         <span style="color: #907373;">(</span>integral
          <span style="color: #b22222;">;; </span><span style="color: #b22222;">The first argument to INTEGRAL is a *delayed* integrand.</span>
          <span style="color: #6276ba;">(</span><span style="color: #a020f0;">delay</span> <span style="color: #858580;">(</span>stream-cdr integrand<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span>+ <span style="color: #858580;">(</span>* dt <span style="color: #80a880;">(</span>stream-car integrand<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
             initial-value<span style="color: #6276ba;">)</span>
          dt<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-77"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">solve</span> f y0 dt<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">y</span> <span style="color: #909183;">(</span>integral <span style="color: #709870;">(</span><span style="color: #a020f0;">delay</span> dy<span style="color: #709870;">)</span> y0 dt<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">dy</span> <span style="color: #909183;">(</span>stream-map f y<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  y<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>test 2.716924
      <span style="color: #7388d6;">(</span>stream-ref <span style="color: #909183;">(</span>solve <span style="color: #709870;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #907373;">(</span>y<span style="color: #907373;">)</span> y<span style="color: #709870;">)</span> 1 0.001<span style="color: #909183;">)</span> 1000<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline103" class="outline-5">
<h5 id="orgheadline103"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.78">Exercise 3.78.</a></h5>
<div class="outline-text-5" id="text-orgheadline103">
<p>
Straightforward encoding of the diagram in the text:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream-util"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">solve-2nd</span> a b dt y0 dy0<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">y</span> <span style="color: #909183;">(</span>integrate <span style="color: #709870;">(</span><span style="color: #a020f0;">delay</span> dy<span style="color: #709870;">)</span> y0 dt<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">dy</span> <span style="color: #909183;">(</span>integrate <span style="color: #709870;">(</span><span style="color: #a020f0;">delay</span> ddy<span style="color: #709870;">)</span> dy0 dt<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">ddy</span> <span style="color: #909183;">(</span>add-streams <span style="color: #709870;">(</span>scale-stream dy a<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>scale-stream y b<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  y<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline104" class="outline-5">
<h5 id="orgheadline104"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.79">Exercise 3.79.</a></h5>
<div class="outline-text-5" id="text-orgheadline104">
<p>
The integration of <code>ddy</code> to <code>dy</code> and <code>dy</code> to <code>y</code> remain identical with the
previous answer. The only change is to generalize the definition of <code>ddy</code> to an
arbitrary function of the two variables \(\mathtt{dy} \equiv \frac{dy}{dt}\) and
\(\mathtt{y} \equiv y\):
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream-util"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">solve-2nd</span> f dt y0 dy0<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">y</span> <span style="color: #909183;">(</span>integrate <span style="color: #709870;">(</span><span style="color: #a020f0;">delay</span> dy<span style="color: #709870;">)</span> y0 dt<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">dy</span> <span style="color: #909183;">(</span>integrate <span style="color: #709870;">(</span><span style="color: #a020f0;">delay</span> ddy<span style="color: #709870;">)</span> dy0 dt<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">ddy</span> <span style="color: #909183;">(</span>stream-map-poly f dy y<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>  <span style="color: #b22222;">; </span><span style="color: #b22222;">(define (f dy y) ...)</span>
  y<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
