ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.80][Exercise 3.80.]]


Another transcription of the equations/signal-flow diagram:

#+BEGIN_SRC scheme :tangle ex-3-80.scm
  (include "stream")
  (include "stream-util")
  (include "stream-integral")

  (define (RLC R L C dt vC0 iL0)
    (define iL (integral (delay diL) iL0 dt))
    (define vC (integral (delay dVC) vC0 dt))
    (define dVC (scale-stream iL (/ (- 1) C)))
    (define diL (add-streams (scale-stream vC (/ 1 L))
                             (scale-stream iL (/ (- R) L))))
    (cons vC iL))
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-3-80-test.scm
  (include "ex-3-80")
  (use test)

  (define vCiL (RLC 1 0.2 1 0.1 0 10))
  (define vC (car vCiL))
  (define iL (cdr vCiL))

  (parameterize ((current-test-epsilon 0.01))
                (test -0.9605
                      (stream-ref vC 10))
                (test -1.2153
                      (stream-ref iL 10)))
#+END_SRC

*** DONE 3.5.5: Modularity of Functional Programs and Modularity of Objects
    SCHEDULED: <2015-01-25 Sun>
    CLOCK: [2015-01-25 Sun 22:57]--[2015-01-26 Mon 00:20] =>  1:23
    CLOCK: [2015-01-25 Sun 22:53]--[2015-01-25 Sun 22:56] =>  0:03
    CLOCK: [2015-01-25 Sun 22:34]--[2015-01-25 Sun 22:39] =>  0:05
    :PROPERTIES:
    :Effort:   2:00
    :END:

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.81][Exercise 3.81.]]

#+BEGIN_SRC scheme :tangle ex-3-81.scm
  (include "stream")
  (include "stream-util")

  ;;; Generates a stream of random numbers given a stream of requests to the RNG,
  ;;; which can take two forms:
  ;;;
  ;;; - GENERATE: emit the next number in the random number sequence
  ;;; - a number: reset the sequence using the number as the seed. Should be
  ;;;   between 0 and 1.
  ;;;
  ;;; REQUEST-STREAM must start with a number to initialize the seed.
  (define (rand-stream request-stream)
    ;; Linear congruential generator -- glibc coefficients
    (define (rand-update x)
      (define m (expt 2 31))
      (/ (modulo (+ (* 1103515245 (floor (* x m))) 12345) (expt 2 31))
         m))
    (define (reset? request) (number? request))
    (when (not (or (stream-null? request-stream)
                   (reset? (stream-car request-stream))))
          (error "RAND-STREAM -- first element must be random seed"))
    (let recur ((request-stream request-stream)
                (value-stream the-empty-stream))
      (if (stream-null? request-stream)
          the-empty-stream
          (let ((request (stream-car request-stream)))
            (define output-stream
              (cond ((eq? request 'generate) value-stream)
                    ((reset? request)
                     (cons-stream request
                                  (stream-map rand-update output-stream)))
                    (else (error "RAND-STREAM -- bad request"))))
            (cons-stream (stream-car output-stream)
                         (rec (stream-cdr request-stream)
                              (stream-cdr output-stream)))))))
#+END_SRC


#+BEGIN_SRC scheme :tangle

#+END_SRC

