ch3/ch3.html

<div id="outline-container-orgheadline105" class="outline-5">
<h5 id="orgheadline105"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.80">Exercise 3.80.</a></h5>
<div class="outline-text-5" id="text-orgheadline105">
<p>
Another transcription of the equations/signal-flow diagram:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream-util"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream-integral"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">RLC</span> R L C dt vC0 iL0<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">iL</span> <span style="color: #909183;">(</span>integral <span style="color: #709870;">(</span><span style="color: #a020f0;">delay</span> diL<span style="color: #709870;">)</span> iL0 dt<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">vC</span> <span style="color: #909183;">(</span>integral <span style="color: #709870;">(</span><span style="color: #a020f0;">delay</span> dVC<span style="color: #709870;">)</span> vC0 dt<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">dVC</span> <span style="color: #909183;">(</span>scale-stream iL <span style="color: #709870;">(</span>/ <span style="color: #907373;">(</span>- 1<span style="color: #907373;">)</span> C<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">diL</span> <span style="color: #909183;">(</span>add-streams <span style="color: #709870;">(</span>scale-stream vC <span style="color: #907373;">(</span>/ 1 L<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                           <span style="color: #709870;">(</span>scale-stream iL <span style="color: #907373;">(</span>/ <span style="color: #6276ba;">(</span>- R<span style="color: #6276ba;">)</span> L<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>cons vC iL<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-80"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">vCiL</span> <span style="color: #7388d6;">(</span>RLC 1 0.2 1 0.1 0 10<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">vC</span> <span style="color: #7388d6;">(</span>car vCiL<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">iL</span> <span style="color: #7388d6;">(</span>cdr vCiL<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">parameterize</span> <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>current-test-epsilon 0.01<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
              <span style="color: #7388d6;">(</span>test -0.9605
                    <span style="color: #909183;">(</span>stream-ref vC 10<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
              <span style="color: #7388d6;">(</span>test -1.2153
                    <span style="color: #909183;">(</span>stream-ref iL 10<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline106" class="outline-4">
<h4 id="orgheadline106"><span class="done DONE">DONE</span> 3.5.5: Modularity of Functional Programs and Modularity of Objects</h4>
<div class="outline-text-4" id="text-orgheadline106">
<p>
:Effort:   2:00
</p>
</div>

<div id="outline-container-orgheadline107" class="outline-5">
<h5 id="orgheadline107"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.81">Exercise 3.81.</a></h5>
<div class="outline-text-5" id="text-orgheadline107">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"stream-util"</span><span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Generates a stream of random numbers given a stream of requests to the RNG,</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">which can take two forms:</span>
<span style="color: #b22222;">;;;</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">- GENERATE: emit the next number in the random number sequence</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">- a number: reset the sequence using the number as the seed. Should be</span>
<span style="color: #b22222;">;;;   </span><span style="color: #b22222;">between 0 and 1.</span>
<span style="color: #b22222;">;;;</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">REQUEST-STREAM must start with a number to initialize the seed.</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">rand-stream</span> request-stream<span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Linear congruential generator -- glibc coefficients</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">rand-update</span> x<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">m</span> <span style="color: #709870;">(</span>expt 2 31<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>/ <span style="color: #709870;">(</span>modulo <span style="color: #907373;">(</span>+ <span style="color: #6276ba;">(</span>* 1103515245 <span style="color: #858580;">(</span>floor <span style="color: #80a880;">(</span>* x m<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> 12345<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>expt 2 31<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
       m<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">reset?</span> request<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>number? request<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">when</span> <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span><span style="color: #a020f0;">or</span> <span style="color: #907373;">(</span>stream-null? request-stream<span style="color: #907373;">)</span>
                 <span style="color: #907373;">(</span>reset? <span style="color: #6276ba;">(</span>stream-car request-stream<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>error <span style="color: #8b2252;">"RAND-STREAM -- first element must be random seed"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">recur</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>request-stream request-stream<span style="color: #709870;">)</span>
              <span style="color: #709870;">(</span>value-stream the-empty-stream<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>stream-null? request-stream<span style="color: #709870;">)</span>
        the-empty-stream
        <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>request <span style="color: #858580;">(</span>stream-car request-stream<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">output-stream</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>eq? request 'generate<span style="color: #80a880;">)</span> value-stream<span style="color: #858580;">)</span>
                  <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>reset? request<span style="color: #80a880;">)</span>
                   <span style="color: #80a880;">(</span>cons-stream request
                                <span style="color: #887070;">(</span>stream-map rand-update output-stream<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                  <span style="color: #858580;">(</span><span style="color: #a020f0;">else</span> <span style="color: #80a880;">(</span>error <span style="color: #8b2252;">"RAND-STREAM -- bad request"</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>cons-stream <span style="color: #6276ba;">(</span>stream-car output-stream<span style="color: #6276ba;">)</span>
                       <span style="color: #6276ba;">(</span>rec <span style="color: #858580;">(</span>stream-cdr request-stream<span style="color: #858580;">)</span>
                            <span style="color: #858580;">(</span>stream-cdr output-stream<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>


<div class="org-src-container">

<pre class="src src-scheme"></pre>
</div>
</div>
</div>
