ch3/ch3.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%25_thm_3.82][Exercise 3.82.]]

#+BEGIN_SRC scheme :tangle ex-3-82.scm
  (include "ex-3-81")

  (define (stream-estimate-interval P x1 x2 y1 y2)
    (define (constant-stream c)
      (define s (cons-stream c s))
      s)
    (define area (* (- x2 x1) (- y2 y1)))
    (define rand-stream-input
      (cons-stream seed
                   (constant-stream 'generate)))
    (let recur ((rands (rand-stream rand-stream-input))
                (pf (cons 0 0)))
      (let ((x (stream-car rands))
            (y (stream-car (stream-cdr rands))))
        (let* ((pass (car pf))
               (fail (cdr pf))
               (pfnext
                (if (P x y)
                    (cons (+ 1 pass) fail)
                    (cons pass (+ 1 fail)))))
          (cons-stream (* area
                          ;; Probability of satisfying P
                          (/ (car pfnext) (+ (car pfnext) (cdr pfnext))))
                       (recur (stream-cdr rands) pfnext))))))
#+END_SRC
