ch3/ch3.html

<div id="outline-container-orgheadline108" class="outline-5">
<h5 id="orgheadline108"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-24.html#%_thm_3.82">Exercise 3.82.</a></h5>
<div class="outline-text-5" id="text-orgheadline108">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-3-81"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">stream-estimate-interval</span> P x1 x2 y1 y2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">constant-stream</span> c<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">s</span> <span style="color: #709870;">(</span>cons-stream c s<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    s<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">area</span> <span style="color: #909183;">(</span>* <span style="color: #709870;">(</span>- x2 x1<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>- y2 y1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">rand-stream-input</span>
    <span style="color: #909183;">(</span>cons-stream seed
                 <span style="color: #709870;">(</span>constant-stream 'generate<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">recur</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>rands <span style="color: #907373;">(</span>rand-stream rand-stream-input<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
              <span style="color: #709870;">(</span>pf <span style="color: #907373;">(</span>cons 0 0<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>x <span style="color: #6276ba;">(</span>stream-car rands<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>y <span style="color: #6276ba;">(</span>stream-car <span style="color: #858580;">(</span>stream-cdr rands<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">let*</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>pass <span style="color: #858580;">(</span>car pf<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>fail <span style="color: #858580;">(</span>cdr pf<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>pfnext
              <span style="color: #858580;">(</span><span style="color: #a020f0;">if</span> <span style="color: #80a880;">(</span>P x y<span style="color: #80a880;">)</span>
                  <span style="color: #80a880;">(</span>cons <span style="color: #887070;">(</span>+ 1 pass<span style="color: #887070;">)</span> fail<span style="color: #80a880;">)</span>
                  <span style="color: #80a880;">(</span>cons pass <span style="color: #887070;">(</span>+ 1 fail<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>cons-stream <span style="color: #6276ba;">(</span>* area
                        <span style="color: #b22222;">;; </span><span style="color: #b22222;">Probability of satisfying P</span>
                        <span style="color: #858580;">(</span>/ <span style="color: #80a880;">(</span>car pfnext<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>+ <span style="color: #887070;">(</span>car pfnext<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>cdr pfnext<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                     <span style="color: #6276ba;">(</span>recur <span style="color: #858580;">(</span>stream-cdr rands<span style="color: #858580;">)</span> pfnext<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Robert Irelan</p>
<p class="email">Email: <a href="mailto:rirelan@gmail.com">rirelan@gmail.com</a></p>
<p class="date">Created: 2015-08-28 Fri 08:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
